{
  "sources": [
    {
      "title": "Christian Heilmann",
      "feedUrl": "https://christianheilmann.com/feed/",
      "siteUrl": "https://christianheilmann.com",
      "articles": [
        {
          "id": "https://christianheilmann.com/?p=6938",
          "author": "Chris Heilmann",
          "description": "If you want to know the value of a certain expression in any JavaScript on the web, you can use logpoints for that. It is like injecting a console.log() anywhere you want. Here’s a quick demo: Here’s how the demo works: Open https://codepo8.github.io/dog-browser/ in the browser Open Developer Tools, go to the Sources tool Locate […]",
          "link": "https://christianheilmann.com/2021/08/24/using-console-log-on-any-website-logpoints-let-you-do-that/",
          "publishedOn": "2021-08-24T22:34:53.000Z",
          "wordCount": 302,
          "title": "Using console.log() on any website? Logpoints let you do that!"
        },
        {
          "id": "https://christianheilmann.com/?p=6932",
          "author": "Chris Heilmann",
          "description": "Adding your face in a small circle to videos has become fashionable lately and some extensions do that automatically for you. Good old Screenflow, which I’ve used for years now, has no masking option though. But you still can achieve round videos using a setting and learning that screenflow’s sliders are weird. By default, Screenflow […]",
          "link": "https://christianheilmann.com/2021/08/23/quick-tip-creating-round-talking-heads-videos-in-screenflow/",
          "publishedOn": "2021-08-23T08:56:43.000Z",
          "wordCount": 411,
          "title": "Quick tip: creating round “talking heads” videos in Screenflow"
        },
        {
          "id": "https://christianheilmann.com/?p=6923",
          "author": "Chris Heilmann",
          "description": "Visual Studio Code now has a TikTok channel and they asked me if I wanted to contribute, so here you are: @vscode A look under the hood ##vscode ##techtok ##codetok ##programming ##edutok ♬ original sound – Visual Studio Code A 20 second video of me explaining that I like VS Code a lot as it […]",
          "link": "https://christianheilmann.com/2021/08/11/published-on-tiktok-but-kompressor-does-not-dance/",
          "publishedOn": "2021-08-11T11:05:23.000Z",
          "wordCount": 380,
          "title": "Published on TikTok, but Kompressor does not dance"
        },
        {
          "id": "https://christianheilmann.com/?p=6916",
          "author": "Chris Heilmann",
          "description": "This weekend I released a video on the YouTube Channel of Visual Studio Code that shows end-to-end web project debugging. In five minutes I walk through debugging a web project bit by bit: I open a project inside VS Code by opening its folder. The demo used is a simple, plain Vanilla JS/CSS/HTML ToDo app […]",
          "link": "https://christianheilmann.com/2021/08/09/video-learn-how-to-debug-web-projects-end-to-end-in-vs-code-in-5-minutes/",
          "publishedOn": "2021-08-09T20:46:52.000Z",
          "wordCount": 744,
          "title": "[Video] Learn how to debug web projects end-to-end in VS Code in 5 minutes"
        },
        {
          "id": "https://christianheilmann.com/?p=6912",
          "author": "Chris Heilmann",
          "description": "Today the World Wide Web is 30 years old. I’ve worked on it since 1997 or so and I saw a lot of technologies and design trends come and go. I’ve also seen a lot of “this is much better and will replace the web” solutions come and go. What remained is the web with […]",
          "link": "https://christianheilmann.com/2021/08/06/happy-birthday-www-30-years-of-mining-a-landfill-for-valid-code/",
          "publishedOn": "2021-08-06T15:37:31.000Z",
          "wordCount": 1122,
          "title": "Happy Birthday, WWW – 30 years of mining a landfill for valid code"
        },
        {
          "id": "https://christianheilmann.com/?p=6904",
          "author": "Chris Heilmann",
          "description": "Today I finished moving the Edge Tools for VS Code extension documentation to its official space in the Microsoft docs. That meant I needed to redirect the documentation I hosted with GitHub pages in a docs folder/branch of the repository. There are plugins available for that, but I didn’t want to install any extra features […]",
          "link": "https://christianheilmann.com/2021/08/03/redirecting-github-pages/",
          "publishedOn": "2021-08-03T17:06:01.000Z",
          "wordCount": 432,
          "title": "Redirecting GitHub Pages"
        },
        {
          "id": "https://christianheilmann.com/?p=6880",
          "author": "Chris Heilmann",
          "description": "Using the new in-built JavaScript debugger in Visual Studio code you can use the browser developer tools Console right inside the editor. I just published a “TikTok” style video on the official Visual Studio Code channel explaining this and – after lots of criticism for the quality of the video (lads, this is on purpose!) […]",
          "link": "https://christianheilmann.com/2021/07/30/using-console-log-debugging-in-visual-studio-code/",
          "publishedOn": "2021-07-30T10:22:18.000Z",
          "wordCount": 499,
          "title": "Using console.log() debugging in Visual Studio Code"
        },
        {
          "id": "https://christianheilmann.com/?p=6869",
          "author": "Chris Heilmann",
          "description": "I’m currently investigating a strange bug we got reported with the Edge Developer Tools. Voiceover on MacOS announces the DOM tree as a table and tells you how to navigate it – which then doesn’t work. The reason is that the markup isn’t a table. The DOM tree is, well, a tree, built with OL, […]",
          "link": "https://christianheilmann.com/2021/07/28/accessibility-wtf-voiceover-on-mac-announcing-a-list-tree-as-a-table/",
          "publishedOn": "2021-07-28T20:14:58.000Z",
          "wordCount": 309,
          "title": "Accessibility WTF: Voiceover on Mac announcing a list tree as a table?"
        },
        {
          "id": "https://christianheilmann.com/?p=6860",
          "author": "Chris Heilmann",
          "description": "Now that Visual Studio Code has an in-built JavaScript debugger, it has become incredibly convenient to debug your project without leaving the editor. You can debug JavaScript, tweak CSS and the DOM and interact with the browser Console right inside VS Code. And you don’t need to know which extensions to install as the editor […]",
          "link": "https://christianheilmann.com/2021/07/22/debugging-javascript-dom-css-and-logging-console-without-leaving-visual-studio-code/",
          "publishedOn": "2021-07-22T10:27:35.000Z",
          "wordCount": 444,
          "title": "Debugging JavaScript, DOM, CSS and accessing the browser console without leaving Visual Studio Code"
        },
        {
          "id": "https://christianheilmann.com/?p=6854",
          "author": "Chris Heilmann",
          "description": "Over the course of my career I’ve seen a lot of excellent accessibility presentations and learned a lot. That’s because I worked in the accessibility space and went to specialist conferences. Web development conferences also have accessibility talks and their number is rising. But often these don’t go past the 101 stage or repeat things […]",
          "link": "https://christianheilmann.com/2021/07/20/the-accessibility-stalemate/",
          "publishedOn": "2021-07-20T19:17:50.000Z",
          "wordCount": 1035,
          "title": "The accessibility stalemate"
        },
        {
          "id": "https://christianheilmann.com/?p=6848",
          "author": "Chris Heilmann",
          "description": "The other day, I mulled over the problem of bad user experience resulting in more usage of products. Half your job as a product manager is not to get excited about rising usage numbers caused by bad UX. Often delivering a great experience means less usage - people get what they came for quickly. Tough […]",
          "link": "https://christianheilmann.com/2021/07/15/how-many-happy-users-did-your-product-have-this-month/",
          "publishedOn": "2021-07-15T20:39:24.000Z",
          "wordCount": 1201,
          "title": "How many happy users did your product have this month?"
        }
      ]
    },
    {
      "title": "Hundred Rabbits",
      "feedUrl": "https://100r.co/links/rss.xml",
      "siteUrl": "https://100r.co",
      "articles": [
        {
          "id": "log.html#july2021",
          "author": "Rekka Bellum",
          "description": "Hey everyone! This is the list of all the changes we've done to our projects and apps during the month of July. We'll also be reporting in our on position in the world, and on our future plans.\nSummary Of Changes\nNasu, implemented the export of .theme files, and theme support.\nLeft, worked on Uxn-native version, and implemented theme support.\nNiju, progressed on animations and started implementing controls.\nGrimgrains, added a new recipe: Stovetop Blackberry Cake.\nWiktopher, added a new chapter: Lupin's Logbook.\nUxn, created a proportional font format for Uxn, and improved documention for Varvara.\nOrca, implemented theme support\nNoodle, published tutorial, and implemented theme support\n\n\nNews\nThis month, Calcifer is being re-built. While we wait for that, we're working on more projects aboard. We added insulation to the v-berth, an attempt to keep Pino warm this winter. We created a new portal called boat projects on our wiki that covers most of the major construction projects we've done to the boat.\nOur friends at Compudanzas have started writing an Introduction to Uxn Programming tutorial. We recommend it to anyone interested in programming for the Uxn Computer. No prior understanding of stack-machines, or Assembly, required! The first covers basics, and the latest chapter focuses on learning to draw pixels on the screen.\nIf you missed Devine's performance at Flash Crash, you can watch it here.\nPino book club\nWe're reading Mingming & the Art of Minimal Ocean Sailing by Roger Taylor and The Swarm by Frank Schatzing.\nPino's location: 48° 40.768'N, 123° 24.802'W\nContinue Reading",
          "link": "https://100r.co/site/log.html#july2021",
          "publishedOn": "2021-08-01T00:00:00.000Z",
          "wordCount": 5448,
          "title": "Summary of changes for July"
        },
        {
          "id": "dry_toilet_installation.html",
          "author": "Rekka Bellum",
          "description": "The work is done. Building a dry toilet was more work than we had anticipated, but we still prefer it over the ready-made models. We learned tons doing it, and now our toilet is perfectly suited to our space. The pandemic has pushed more people into boat and van living (to travel within their own countries) and towards simple systems. Looking at the Nature's Head website, they've had a 8-week waiting list for ages. It's either you wait for the thing, or you build the thing.\nDry toilets are simple to use and have few parts, but it doesn't mean that they are simple to build. Simple is hard, it costs time, and requires a ton of creativity.\nContinue Reading",
          "link": "https://100r.co/site/dry_toilet_installation.html",
          "publishedOn": "2021-07-28T00:00:00.000Z",
          "wordCount": 1902,
          "title": "Dry Toilet Installation"
        }
      ]
    },
    {
      "title": "Blog on SaraSoueidan.com",
      "feedUrl": "https://www.sarasoueidan.com/blog/index.xml",
      "siteUrl": "https://sarasoueidan.com/blog/",
      "articles": [
        {
          "id": "https://sarasoueidan.com/blog/focus-indicators/",
          "author": null,
          "description": "This post is a modified, text-only excerpt from my Practical Accessibility video course. I wanted to share this guide to designing accessible focus indicators because focus styles are a recurring discussion I have with designers I work with on most projects, so I thought it would be useful to provide this guide as a helpful reference. This guide is aimed at both designers who want to learn about accessibility considerations for designing focus indicators, as well as developers who want to implement them.\nImagine you visit a Web site and you want to browse it for some content. You want to buy something; or maybe book a flight somewhere. And as you move your cursor onto the page, it suddenly disappears. Your hand may be still on the mouse, and you’re moving the mouse across the screen and ac…",
          "link": "https://sarasoueidan.com/blog/focus-indicators/",
          "publishedOn": "2021-08-13T00:00:00.000Z",
          "wordCount": 6909,
          "title": "A guide to designing accessible, WCAG-compliant focus indicators"
        },
        {
          "id": "https://sarasoueidan.com/blog/curating-aaa/",
          "author": null,
          "description": "I’m speaking, MC’ing and curating the programme for Access All Areas — an upcoming accessibility-focussed conference. Here’s all about the event, and how you can join us to learn more about accessibility, and maybe even present and share your expertise at the event!\nAbout the conference (what, when, where)\nAccess All Areas (or aaa) is a new online conference—part of a series of focussed conferences created by the folks at Web Directions. This conference is focussed on accessibility for developers: understanding the different kinds of accessibility issues that our code may create, finding those issues using available auditing and testing tools, as well as techniques and technologies for addressing them.\nThis inclusive, remote-friendly conference will take place for the first time this year …",
          "link": "https://sarasoueidan.com/blog/curating-aaa/",
          "publishedOn": "2021-08-02T00:00:00.000Z",
          "wordCount": 902,
          "title": "I’m curating the programme for an upcoming accessibility-focussed conference ✨"
        }
      ]
    },
    {
      "title": "there.oughta.be/",
      "feedUrl": "https://there.oughta.be/feed.xml",
      "siteUrl": "https://there.oughta.be/",
      "articles": []
    },
    {
      "title": "Grumpy Gamer",
      "feedUrl": "https://grumpygamer.com/rss",
      "siteUrl": "https://grumpygamer.com",
      "articles": []
    },
    {
      "title": "Emily Short's Interactive Storytelling",
      "feedUrl": "https://emshort.blog/feed/",
      "siteUrl": "https://emshort.blog",
      "articles": [
        {
          "id": "http://emshort.blog/?p=42268",
          "author": "Emily Short",
          "description": "At a recentish Oxford/London IF Meetup, some participants expressed an interest in writing for, and playing with, Seltani. If you’re not familiar with it, Seltani is Andrew Plotkin’s multiplayer choice-based narrative platform. It lets players explore a shared environment, view each others’ actions, and change the world in ways that will affect others — in some … Continue reading \"Seltani Jam\"",
          "link": "https://emshort.blog/2021/08/22/seltani-jam/",
          "publishedOn": "2021-08-22T20:15:19.000Z",
          "wordCount": 1696,
          "title": "Seltani Jam"
        },
        {
          "id": "http://emshort.blog/?p=42007",
          "author": "Emily Short",
          "description": "Events The People’s Republic of IF, the Cambridge MA-based IF group, meets August 31 at 6:30 PM online. September 1 is the deadline to register as an author for IF Comp, and the games themselves will be due September 28. This year, unusually, there is a move so that authors participating in the competition may … Continue reading \"Mid-August Link Assortment\"",
          "link": "https://emshort.blog/2021/08/15/mid-august-link-assortment-5/",
          "publishedOn": "2021-08-15T10:26:00.000Z",
          "wordCount": 1909,
          "title": "Mid-August Link Assortment"
        },
        {
          "id": "http://emshort.blog/?p=42090",
          "author": "Emily Short",
          "description": "I used to publish questions that people have asked me either by email or on Twitter. That went on a hiatus for the past year-and-a-bit, as I’d stepped back from blogging for a time. To kick off something similar again, I asked Twitter folks what they’d be most interested in seeing me write about. One … Continue reading \"Mailbag: Plot. It’s a Problem.\"",
          "link": "https://emshort.blog/2021/08/10/mailbag-plot-its-a-problem/",
          "publishedOn": "2021-08-10T17:38:00.000Z",
          "wordCount": 4024,
          "title": "Mailbag: Plot. It’s a Problem."
        },
        {
          "id": "http://emshort.blog/?p=42004",
          "author": "Emily Short",
          "description": "Events The competition for games with a classic text parser, ParserComp, is just winding up now, so the results should be visible either now or in the very near future. And if you haven’t had a chance to play yet, you may enjoy checking out the range of games here. August 2-6 is the Foundations … Continue reading \"End of July Link Assortment\"",
          "link": "https://emshort.blog/2021/07/31/end-of-july-link-assortment-5/",
          "publishedOn": "2021-07-31T10:23:00.000Z",
          "wordCount": 1925,
          "title": "End of July Link Assortment"
        },
        {
          "id": "http://emshort.blog/?p=42020",
          "author": "Emily Short",
          "description": "Many years ago, I started writing a fantasy story. In the story, there was a culturally important game you could play with friends, which was usually mostly a bit like poker. The thing was, every once in a while you would draw some totally weird extra card that had never been in the pack before. … Continue reading \"The Uncanny Deck: Co-authoring with GPT-2\"",
          "link": "https://emshort.blog/2021/07/18/the-uncanny-deck-co-authoring-with-gpt-2/",
          "publishedOn": "2021-07-18T17:39:36.000Z",
          "wordCount": 3210,
          "title": "The Uncanny Deck: Co-authoring with GPT-2"
        },
        {
          "id": "http://emshort.blog/?p=41987",
          "author": "Emily Short",
          "description": "Thanks Sharp-eyed readers may have noticed that over the last year and a half, a lot of these posts have been signed “Mort Short” rather than “Emily.” This is because, for a lot of the pandemic, I haven’t had the time and energy to guarantee that the link assortment would happen on time twice a … Continue reading \"Mid-July Link Assortment\"",
          "link": "https://emshort.blog/2021/07/15/mid-july-link-assortment-6/",
          "publishedOn": "2021-07-15T20:59:00.000Z",
          "wordCount": 1885,
          "title": "Mid-July Link Assortment"
        }
      ]
    },
    {
      "title": "xkcd.com",
      "feedUrl": "https://xkcd.com/atom.xml",
      "siteUrl": "https://xkcd.com/",
      "articles": [
        {
          "id": "https://xkcd.com/2508/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/circumappendiceal_somectomy.png\" title=\"Some personal news: After treating my first case a few years ago with antibiotics, I can report that I have now had appendicitis for the second and--unless something extremely unexpected happened with the surgery--final time.\" alt=\"Some personal news: After treating my first case a few years ago with antibiotics, I can report that I have now had appendicitis for the second and--unless something extremely unexpected happened with the surgery--final time.\" />",
          "link": "https://xkcd.com/2508/",
          "publishedOn": "2021-08-27T00:00:00.000Z",
          "wordCount": 185,
          "title": "Circumappendiceal Somectomy"
        },
        {
          "id": "https://xkcd.com/2507/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/usv_c.png\" title=\"Ultra-Serial Violet C light is unpolarized, so you don't have to flip the polarizing filter over when you get the orientation wrong the first time.\" alt=\"Ultra-Serial Violet C light is unpolarized, so you don't have to flip the polarizing filter over when you get the orientation wrong the first time.\" />",
          "link": "https://xkcd.com/2507/",
          "publishedOn": "2021-08-25T00:00:00.000Z",
          "wordCount": 183,
          "title": "USV-C"
        },
        {
          "id": "https://xkcd.com/2506/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/projecting.png\" title=\"This is something we all need to work on, but especially you all.\" alt=\"This is something we all need to work on, but especially you all.\" />",
          "link": "https://xkcd.com/2506/",
          "publishedOn": "2021-08-23T00:00:00.000Z",
          "wordCount": 183,
          "title": "Projecting"
        },
        {
          "id": "https://xkcd.com/2505/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/news_story_reaction.png\" title=\"Unless the next line is, &quot;After we broke up, she blamed the painting and spent years planning her revenge, so my sorrow is mixed with relief that the dogs at least denied her that triumph.&quot;\" alt=\"Unless the next line is, &quot;After we broke up, she blamed the painting and spent years planning her revenge, so my sorrow is mixed with relief that the dogs at least denied her that triumph.&quot;\" />",
          "link": "https://xkcd.com/2505/",
          "publishedOn": "2021-08-20T00:00:00.000Z",
          "wordCount": 187,
          "title": "News Story Reaction"
        },
        {
          "id": "https://xkcd.com/2504/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/fissile_raspberry_isotopes.png\" title=\"Grandma's shelf-stable blackberry pie meson recipe was a huge seller until her farm was shut down by a joint FDA/NRC investigation.\" alt=\"Grandma's shelf-stable blackberry pie meson recipe was a huge seller until her farm was shut down by a joint FDA/NRC investigation.\" />",
          "link": "https://xkcd.com/2504/",
          "publishedOn": "2021-08-18T00:00:00.000Z",
          "wordCount": 187,
          "title": "Fissile Raspberry Isotopes"
        },
        {
          "id": "https://xkcd.com/2503/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/memo_spike_connector.png\" title=\"Backward-compatible with many existing cables, and can connect directly to phones or tablets if you press them down hard enough.\" alt=\"Backward-compatible with many existing cables, and can connect directly to phones or tablets if you press them down hard enough.\" />",
          "link": "https://xkcd.com/2503/",
          "publishedOn": "2021-08-16T00:00:00.000Z",
          "wordCount": 187,
          "title": "Memo Spike Connector"
        },
        {
          "id": "https://xkcd.com/2502/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/every_data_table.png\" title=\"I'm hoping 2022 is relatively normal because I don't know what symbol comes after the asterisk and the dagger.\" alt=\"I'm hoping 2022 is relatively normal because I don't know what symbol comes after the asterisk and the dagger.\" />",
          "link": "https://xkcd.com/2502/",
          "publishedOn": "2021-08-13T00:00:00.000Z",
          "wordCount": 187,
          "title": "Every Data Table"
        },
        {
          "id": "https://xkcd.com/2501/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/average_familiarity.png\" title=\"How could anyone consider themselves a well-rounded adult without a basic understanding of silicate geochemistry? Silicates are everywhere! It's hard to throw a rock without throwing one!\" alt=\"How could anyone consider themselves a well-rounded adult without a basic understanding of silicate geochemistry? Silicates are everywhere! It's hard to throw a rock without throwing one!\" />",
          "link": "https://xkcd.com/2501/",
          "publishedOn": "2021-08-11T00:00:00.000Z",
          "wordCount": 185,
          "title": "Average Familiarity"
        },
        {
          "id": "https://xkcd.com/2500/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/global_temperature_over_my_lifetime.png\" title=\"I was really impressed by the accuracy of some of the report's predictions about fossil fuel consumption. Then I realized, oh, right, of course.\" alt=\"I was really impressed by the accuracy of some of the report's predictions about fossil fuel consumption. Then I realized, oh, right, of course.\" />",
          "link": "https://xkcd.com/2500/",
          "publishedOn": "2021-08-09T00:00:00.000Z",
          "wordCount": 191,
          "title": "Global Temperature Over My Lifetime"
        },
        {
          "id": "https://xkcd.com/2499/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/abandonment_function.png\" title=\"Remember to only adopt domesticated drones that specifically request it. It's illegal to collect wild ones under the Migratory Drone Treaty Act.\" alt=\"Remember to only adopt domesticated drones that specifically request it. It's illegal to collect wild ones under the Migratory Drone Treaty Act.\" />",
          "link": "https://xkcd.com/2499/",
          "publishedOn": "2021-08-06T00:00:00.000Z",
          "wordCount": 185,
          "title": "Abandonment Function"
        },
        {
          "id": "https://xkcd.com/2498/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/forest_walk.png\" title=\"The only other person to walk by was a linguist back in the 80s, but she just spent a while dissecting the phrase 'help me down' before getting distracted by a squirrel and wandering off.\" alt=\"The only other person to walk by was a linguist back in the 80s, but she just spent a while dissecting the phrase 'help me down' before getting distracted by a squirrel and wandering off.\" />",
          "link": "https://xkcd.com/2498/",
          "publishedOn": "2021-08-04T00:00:00.000Z",
          "wordCount": 185,
          "title": "Forest Walk"
        },
        {
          "id": "https://xkcd.com/2497/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/logic_gates.png\" title=\"In C, the multiocular O represents the bitwise norxondor gorgonax.\" alt=\"In C, the multiocular O represents the bitwise norxondor gorgonax.\" />",
          "link": "https://xkcd.com/2497/",
          "publishedOn": "2021-08-02T00:00:00.000Z",
          "wordCount": 185,
          "title": "Logic Gates"
        },
        {
          "id": "https://xkcd.com/2496/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/mine_captcha.png\" title=\"This data is actually going into improving our self-driving car project, so hurry up--it's almost at the minefield.\" alt=\"This data is actually going into improving our self-driving car project, so hurry up--it's almost at the minefield.\" />",
          "link": "https://xkcd.com/2496/",
          "publishedOn": "2021-07-30T00:00:00.000Z",
          "wordCount": 185,
          "title": "Mine Captcha"
        },
        {
          "id": "https://xkcd.com/2495/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/universal_seat_belt.png\" title=\"The plug fits really snugly, so it should be safe in a crash.\" alt=\"The plug fits really snugly, so it should be safe in a crash.\" />",
          "link": "https://xkcd.com/2495/",
          "publishedOn": "2021-07-28T00:00:00.000Z",
          "wordCount": 187,
          "title": "Universal Seat Belt"
        },
        {
          "id": "https://xkcd.com/2494/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/flawed_data.png\" title=\"We trained it to produce data that looked convincing, and we have to admit the results look convincing!\" alt=\"We trained it to produce data that looked convincing, and we have to admit the results look convincing!\" />",
          "link": "https://xkcd.com/2494/",
          "publishedOn": "2021-07-26T00:00:00.000Z",
          "wordCount": 185,
          "title": "Flawed Data"
        },
        {
          "id": "https://xkcd.com/2493/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/dual_usb_c.png\" title=\"Small devices use two-prong USB-AC, but there's also a three-prong version with a USB-B plug as the ground.\" alt=\"Small devices use two-prong USB-AC, but there's also a three-prong version with a USB-B plug as the ground.\" />",
          "link": "https://xkcd.com/2493/",
          "publishedOn": "2021-07-23T00:00:00.000Z",
          "wordCount": 185,
          "title": "Dual USB-C"
        },
        {
          "id": "https://xkcd.com/2492/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/commonly_mispronounced_equations.png\" title=\"&quot;Epsihootamoo doopsiquorps&quot; --the Schrödinger equation for the hydrogen atom\" alt=\"&quot;Epsihootamoo doopsiquorps&quot; --the Schrödinger equation for the hydrogen atom\" />",
          "link": "https://xkcd.com/2492/",
          "publishedOn": "2021-07-21T00:00:00.000Z",
          "wordCount": 187,
          "title": "Commonly Mispronounced Equations"
        },
        {
          "id": "https://xkcd.com/2491/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/immune_factory.png\" title=\"In the final vote, the doubters were won over by the strength of the name IMMUNION.\" alt=\"In the final vote, the doubters were won over by the strength of the name IMMUNION.\" />",
          "link": "https://xkcd.com/2491/",
          "publishedOn": "2021-07-19T00:00:00.000Z",
          "wordCount": 185,
          "title": "Immune Factory"
        },
        {
          "id": "https://xkcd.com/2490/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/pre_pandemic_ketchup.png\" title=\"I wonder what year I'll discard the last weird food item that I bought online in early 2020.\" alt=\"I wonder what year I'll discard the last weird food item that I bought online in early 2020.\" />",
          "link": "https://xkcd.com/2490/",
          "publishedOn": "2021-07-16T00:00:00.000Z",
          "wordCount": 185,
          "title": "Pre-Pandemic Ketchup"
        },
        {
          "id": "https://xkcd.com/2489/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/bad_map_projection_the_greenland_special.png\" title=\"The projection for those who think the Mercator projection gives people a distorted idea of how big Greenland is, but a very accurate idea of how big it SHOULD be.\" alt=\"The projection for those who think the Mercator projection gives people a distorted idea of how big Greenland is, but a very accurate idea of how big it SHOULD be.\" />",
          "link": "https://xkcd.com/2489/",
          "publishedOn": "2021-07-14T00:00:00.000Z",
          "wordCount": 193,
          "title": "Bad Map Projection: The Greenland Special"
        },
        {
          "id": "https://xkcd.com/2488/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/board_game_argument_legacy.png\" title=\"Listen, you need to get over your reluctance to permanently alter a game. Now roll 2d6 to determine how many ounces of soda to spill into the box.\" alt=\"Listen, you need to get over your reluctance to permanently alter a game. Now roll 2d6 to determine how many ounces of soda to spill into the box.\" />",
          "link": "https://xkcd.com/2488/",
          "publishedOn": "2021-07-12T00:00:00.000Z",
          "wordCount": 189,
          "title": "Board Game Argument: Legacy"
        },
        {
          "id": "https://xkcd.com/2487/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/danger_mnemonic.png\" title=\"It's definitely not the time to try drinking beer before liquor.\" alt=\"It's definitely not the time to try drinking beer before liquor.\" />",
          "link": "https://xkcd.com/2487/",
          "publishedOn": "2021-07-09T00:00:00.000Z",
          "wordCount": 185,
          "title": "Danger Mnemonic"
        },
        {
          "id": "https://xkcd.com/2486/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/board_game_party_schedule.png\" title=\"Several of the guests are secretly playing Meta Board Game Party. Every minute of parallel debate in the breakaway faction earns double victory points!\" alt=\"Several of the guests are secretly playing Meta Board Game Party. Every minute of parallel debate in the breakaway faction earns double victory points!\" />",
          "link": "https://xkcd.com/2486/",
          "publishedOn": "2021-07-07T00:00:00.000Z",
          "wordCount": 189,
          "title": "Board Game Party Schedule"
        },
        {
          "id": "https://xkcd.com/2485/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/nightmare_code.png\" title=\"Charsets even used to be known as 'alpha-bets' before that word's obvious negative associations caused it to die out.\" alt=\"Charsets even used to be known as 'alpha-bets' before that word's obvious negative associations caused it to die out.\" />",
          "link": "https://xkcd.com/2485/",
          "publishedOn": "2021-07-05T00:00:00.000Z",
          "wordCount": 185,
          "title": "Nightmare Code"
        }
      ]
    },
    {
      "title": "remy sharp's b:log",
      "feedUrl": "https://remysharp.com/feed.xml",
      "siteUrl": "https://remysharp.com",
      "articles": [
        {
          "id": "the-whole-truth-di-adam-fawley-5",
          "author": null,
          "description": "Unstoppable page turner.\nI'm not known for reading books quickly - heck, the last book I read was 45 pages (or 80 pages, or 90 pages, or something low according to Kindle) and it took me a week to read.\nThis book is 400+ pages and I swallowed it in a matter of days. I cannot resist Hunter's writing style and it has me ending each chapter/section with \"just one more…\".\nGreat stuff. It also brings in some of the end of book 4 - All The Rage into a larger storyline.\nThe writing is certainly formulaic to some degree, but that's not particularly a bad thing and having familiarity with the characters, for me having read all the DI Adam Fawley series, means I can follow along at a much more interesting pace through the book.\nI suspect this is classic \"beach reading\" if I were the type. I've enjoyed every one of Hunter's books I've read so far and I'll be pre-ordering the sixth installment: and easy choice.",
          "link": "https://remysharp.com/books/2021/the-whole-truth-di-adam-fawley-5",
          "publishedOn": "2021-08-30T00:00:00.000Z",
          "wordCount": 332,
          "title": "The Whole Truth (DI Adam Fawley, #5) [book]"
        },
        {
          "id": "flowers-for-eleven",
          "author": null,
          "description": "As I write this, it's the evening of the 30th of August. Previous years, indeed the last decade, this evening is terribly painful for me. This evening, 11 years ago Julie and I arrived at hospital, around this precise time, to find that during the late stages of labour, Tia's heartbeat had stopped.\nPrevious years, this evening specifically I try hard to hold the pain (and fear and anger) at arm's length.\nThis year has been different. As each year has always been different. No different bad or different good. Different… peaceful.",
          "link": "https://remysharp.com/2021/08/30/flowers-for-eleven",
          "publishedOn": "2021-08-30T00:00:00.000Z",
          "wordCount": 435,
          "title": "Flowers for Eleven [blog]"
        },
        {
          "id": "the-call-of-the-wild",
          "author": null,
          "description": "Far more brutal than I expected.I'd known that Call of the Wild (and White Fang) were firm favourites of friends, and I knew they were books held in high regard - and I kind of assumed it was good for dog lovers.I had originally thought of reading this aloud to my daughter (absolutely a dog lover) but I'm glad I didn't.This story quickly gets to Buck being beaten, and beaten and then beaten some more. I guess the story is about finding strength when pushed to your limits, but I'm no English scholar so I could have totally missed the point!Buck is certainly heroic (or perhaps stoic) in the face of insurmountable hardship, and perhaps this is representative of the times that London lived in?What amazed me was, apparently, the Kindle version of the book is 45 pages - and it took me a week to read - either my page numbers are wrong or I stumbled through this book!!!",
          "link": "https://remysharp.com/books/2021/the-call-of-the-wild",
          "publishedOn": "2021-08-26T00:00:00.000Z",
          "wordCount": 318,
          "title": "The Call of the Wild [book]"
        },
        {
          "id": "removing-shows-from-spotify",
          "author": null,
          "description": "For some reason Spotify has increasingly been pushing shows and podcasts as a thing I might want to listen to. I don't. I'm happily paying for Spotify so I don't have to listen to ads, so instead I seem to get them in the podcast form.\nI asked Spotify's support how to turn this off, and they said:\n\nWe're afraid that it's not currently possible to remove these recommendations. Rest assured, we'll let the right folks know this is something you'd like to see soon.\n\nSo yeah… I won't be holding my breath.\nThis to me, falls within the right to repair (which I really don't understand or agree with the push back) - so I fixed it myself.",
          "link": "https://remysharp.com/2021/08/17/removing-shows-from-spotify",
          "publishedOn": "2021-08-17T00:00:00.000Z",
          "wordCount": 1422,
          "title": "Removing \"shows\" from Spotify [blog]"
        },
        {
          "id": "hold-up-the-sky",
          "author": null,
          "description": "Interesting mix of ideas.I'd read the Three Body Problem trilogy so I know that Cixin Liu's style was massive ideas of the cosmic scale and showing me how small we really are - and these short stories continue the theme.What I didn't anticipate in these short stories was the total mix of stories (though that's entirely on me).I didn't personally find any one story punching above the rest. I did, oddly, enjoy the story of the poet challenging the energy being and thusly breaking reality on a galactic scale.Overall, well written, cosmic ideas, but not quite my kind of mind bending.",
          "link": "https://remysharp.com/books/2021/hold-up-the-sky",
          "publishedOn": "2021-08-16T00:00:00.000Z",
          "wordCount": 257,
          "title": "Hold Up the Sky [book]"
        },
        {
          "id": "me-and-tinnitus-entry-3",
          "author": null,
          "description": "The day after my last entry on my tinnitus I was approved, or rather I was in an acceptable range of hearing, to qualify for the Lenire treatment. The equipment isn't cheap but I've always justified the money spent on improving my health or mental health is always money worth spending. So I paid up the equipment was configured and shipped from Ireland on the Friday and I had my \"fitting\" appointment on the Wednesday. Then I was off.",
          "link": "https://remysharp.com/2021/08/02/me-and-tinnitus-entry-3",
          "publishedOn": "2021-08-02T00:00:00.000Z",
          "wordCount": 1030,
          "title": "Me & Tinnitus: entry 3 [blog]"
        },
        {
          "id": "2021-07-16",
          "author": null,
          "description": "The game went live just under a week ago and the feedback has been really nice to see.\nThere's been a balance of \"regular\" players and power players, and in those power players is where the game got some more much needed play testing.\nThe one thing that I had designed into the game was the unlimited undo. The side effect was that, technically, there's infinite ability to make your way through the game so long as you had time and patience - a lot of patience!\nThe knock on problem with infinite moves is that the score really isn't infinite. In fact, I alluded to that in a previous devlog because the score is a 16bit value, it has a max range.\nSo with that, this new release adds a penalty to using the undo. I went through a lot of different ideas and tested them out to see how they affected the score. Here's just a few that I tried:\n\nSubtracting 100 points per undo\nHalving the score per undo\nSubtracting the number of blocks restored\nUsing the undo depth as a multiplier - as in: if you undo twice, the penalty is greater\n\nThese had either drastic effects on the score, which made it pointless, or very subtle effects which rendered the penalty ineffective.\nWhat I settled on was using your progress as the multiplier. So, undo costs 25 points per undo on level 1. On level 2, it costs 50 points, level 3 75 points and so on.\nThis changes the dynamic of the game in a really interesting way. You start to consider the impact on your decisions against your score: do I continue with undo and risk it, or do I accept the fate of stable score and hope it's good enough for a highscore?\nThere was also some fixes for the custom themes - around the palette because I require a custom palette for the game's main tiles, but when you add your own custom tiles the game switches to the default Layer 2 palette - so there were fixes around that too. And here's Gaz Mashall's own custom theme in action behind a new user interface change:",
          "link": "https://remysharp.com/devlog/marbles2/2021-07-16",
          "publishedOn": "2021-07-16T00:00:00.000Z",
          "wordCount": 506,
          "title": "Marbles2 - 16-Jul 2021 [devlog/marbles2]"
        },
        {
          "id": "me-and-tinnitus-entry-2",
          "author": null,
          "description": "To test if I'm suitable for the treatment I talked about in entry 1, and the only in-person appointment I'd need, I would have to have a hearing test.\nI've only ever had a hearing test when I was a kid and I do remember even then they mentioned there was some slight loss. Hearing is important to the The Lenire System treatment because it plays audio to help rewire the brain, so if I have hearing damage, I won't be suitable.",
          "link": "https://remysharp.com/2021/07/14/me-and-tinnitus-entry-2",
          "publishedOn": "2021-07-14T00:00:00.000Z",
          "wordCount": 951,
          "title": "Me & Tinnitus: entry 2 [blog]"
        },
        {
          "id": "tip-not-everyone-has-macos-to-hide-those-ugly-scrollbars",
          "author": null,
          "description": "This is a shorties as blog posts go, but a goodie, and certainly one for future Rem to read.\nMy default machine for development has a trackpad for input. Both in the laptop state and when I have it connected to an external monitor. Up until recently, I had no idea that other users were seeing a very different view of my web pages than I was.",
          "link": "https://remysharp.com/2021/07/13/tip-not-everyone-has-macos-to-hide-those-ugly-scrollbars",
          "publishedOn": "2021-07-13T00:00:00.000Z",
          "wordCount": 429,
          "title": "Tip: not everyone has macOS to hide those ugly scrollbars [blog]"
        },
        {
          "id": "how-to-inspect-elements-that-hide-on-mouse-move",
          "author": null,
          "description": "Specific blog post title, eh? But very specific problem that's a pain in the backside when it comes to debugging it.\nHow do you inspect an element that hides on mouse move? Such as a tooltip (though I'm not a fan of the UI element, if only for the lack of accessibility) it's certainly not obvious.",
          "link": "https://remysharp.com/2021/07/09/how-to-inspect-elements-that-hide-on-mouse-move",
          "publishedOn": "2021-07-09T00:00:00.000Z",
          "wordCount": 501,
          "title": "How to inspect elements that hide on mouse move [blog]"
        },
        {
          "id": "2021-07-05",
          "author": null,
          "description": "Ready for release.\nAfter nearly ten months of tinkering in the evening, the Marbles Squared ZX Spectrum Next port is going live this weekend.\nIt's not that it actually took 10 months to develop, it's just along the way I learnt and wrote the code grid handling in assembly, and then I wrote an assembly based dot command that handles HTTP requests both getting and posting data to web servers - and this is now part of the official spectrum core code (which will ship in future machines) - so that's a nice bonus.\nI'm fairly confident there's no lurking bugs, though I am trying to squash one non blocking issue where the game can't get the high scores from the web (though oddly the game was able to post the high score for the player in question 🤔). Still, I think it's looking pretty snazzy:\n\nAll the same, the itch download page is primed and ready for release on Saturday. There's two downloads available: the game and the game with fully documented source code and PDF overview article.\nIn lieu of the release, I've been looking back at the original version I wrote in the early 2000s and found a web based Palm Pilot emulator that let me actually play and capture screenshots of the original game (I even managed to recover the source code and published it on github). So I present to you - the old version:\n\nOnce the game is live for the Spectrum I'll release the web version and if I planned the code right, we'll all be able to contribute to the high score leader board!",
          "link": "https://remysharp.com/devlog/marbles2/2021-07-05",
          "publishedOn": "2021-07-05T00:00:00.000Z",
          "wordCount": 413,
          "title": "Marbles2 - 5-Jul 2021 [devlog/marbles2]"
        },
        {
          "id": "broad-band-the-untold-story-of-the-women-who-made-the-internet",
          "author": null,
          "description": "A real kind of urgency and excitement in their writing. Superb.\nA refreshing lesson in the history of the internet, primarily focused on the US (with a decent hat tip to Dame Wendy Hall) but really well written.\nA recommendation by Jeremy Keith tipped this from my \"to read\" list into my brain and it was one of the easier non-fiction books I've read, purely down to Evens' writing style.\nHighly recommend if you're working on the web or interested in modern computing history.",
          "link": "https://remysharp.com/books/2021/broad-band-the-untold-story-of-the-women-who-made-the-internet",
          "publishedOn": "2021-07-04T00:00:00.000Z",
          "wordCount": 257,
          "title": "Broad Band: The Untold Story of the Women Who Made the Internet [book]"
        }
      ]
    },
    {
      "title": "Writing - rachelbythebay",
      "feedUrl": "https://rachelbythebay.com/w/atom.xml",
      "siteUrl": "https://rachelbythebay.com/w/",
      "articles": [
        {
          "id": "https://rachelbythebay.com/w/2021/08/28/big/",
          "author": null,
          "description": "One of the projects I did at a big company once upon a time was evolving \norganically, and we eventually realized we needed a \"dashboard\" of \nsorts.  That is, we wanted an internally-hosted page that would let \nanyone load it up and see what was going on with the service.  It was \nintended to be simple: ping our server, ask for the status, and then \nrender the response into a simple list.  Later on, we knew we were going \nto want to add the ability to send a \"panic\" signal to our server from \nthis page, so that anyone in the company could hit the \"big red button\" \nif things went haywire.\n\n\nJanuary 1: we put up a terrible hack: a shell script that runs a \nPython script that talks to the service to get the status and then \ndumps out raw HTML to a file in someone's public_html path.  \n\n\nJanua…",
          "link": "https://rachelbythebay.com/w/2021/08/28/big/",
          "publishedOn": "2021-08-29T06:37:52.000Z",
          "wordCount": 1672,
          "title": "Big company tale: six months for a list and a button"
        },
        {
          "id": "https://rachelbythebay.com/w/2021/08/23/shield/",
          "author": null,
          "description": "In reading some of the news today, I got to thinking about my own \nexperiences at big companies, and then started wondering how much I had \nwritten about a certain topic.  I went looking through the now-decade of \nposts here, and somehow, I've never talked about \"padding\".  I mean, \nsure, the word itself comes up, but that's when talking about padding \nout meeting times, jamming a C-64 into a suitcase, or sticking spaces \nor zeroes in front of some number.\n\n\nFor me, it goes something like this: if things are generally okay in my \nlife, then I start the day with some amount of padding.  If something \nhappens, that impacts the padding.  If there's enough padding, it ends \nup being a mild inconvenience at worst.  For instance, this time last \nweek when I had my\nflat tire\nat 75 mph, I was in a…",
          "link": "https://rachelbythebay.com/w/2021/08/23/shield/",
          "publishedOn": "2021-08-23T19:52:50.000Z",
          "wordCount": 699,
          "title": "Human shielding and how things impact a person"
        },
        {
          "id": "https://rachelbythebay.com/w/2021/08/20/phones/",
          "author": null,
          "description": "I \nwrote\nthe other day about how I went out and bought a second cell \nphone just because I wanted it to take the burden of all of the crap my \nnew employer was about to throw at me.  I didn't get into the reasoning \nbehind this, or some of my experiences, and figured it's probably worth \nsome explanation.\n\n\nThis was far enough back in time to where we all still had desk \nphones, and assigned numbers that would ring in straight from the \noutside world, if you can believe it.  Mine never got any use, but it \nwas definitely there for the first couple of years.\n\n\nIn those times, things were relatively simple.  The most mixing of work \nand personal stuff you could do was using your work laptop for other \nstuff.  I did this, and I know now that it was stupid, but I will now \nexplain how it came …",
          "link": "https://rachelbythebay.com/w/2021/08/20/phones/",
          "publishedOn": "2021-08-20T21:16:15.000Z",
          "wordCount": 1885,
          "title": "Your devices and your employer"
        },
        {
          "id": "https://rachelbythebay.com/w/2021/08/19/batt/",
          "author": null,
          "description": "I have a secondary phone which doesn't get a whole lot of use.  I bought \nit a couple of years ago before starting a full time employee gig with \nthe pink mustache factory.  I did this because my friends who were \nalready there advised me that the company did not supply phones but did \nexpect you to load a crapload of apps on to do your job.\n\n\nIt also meant that I could put it away at the end of the day and all \nwork-related stuff would stay out of sight and out of mind until the \nnext morning.\n\n\nSo, overall, I was surprised when it started being really belligerent \nabout battery statuses.  I would find it at the end of the day somewhere \ndown below 30% charge despite doing nothing but carrying it around in my \npurse all day.  Then, it would stay there at some low value for a very \nlong ti…",
          "link": "https://rachelbythebay.com/w/2021/08/19/batt/",
          "publishedOn": "2021-08-20T02:17:32.000Z",
          "wordCount": 1076,
          "title": "Sometimes it really is just a bad battery"
        },
        {
          "id": "https://rachelbythebay.com/w/2021/08/18/infra/",
          "author": null,
          "description": "A while back, I bought and installed a dash camera on my car.  I figured \nafter initially seeing tons of crazy Russian insurance scams thwarted by \nit, and then a bunch of crazy videos from the rest of the world, it was \nmy turn.  Then, over the weekend, it finally paid off by capturing video \nof something awful that happened to me.\n\n\nMy assumption is that the Phoenix-Vegas traffic makes things really \ncrappy, hence the added enforcement and whatnot.  I figured, okay, I'll \nset the cruise control exactly at the 75 mph limit and just leave it \nthere until I'm well past this area.  At least it's going to be \nwell-maintained, well-lit, and all of that, right?  Safety corridor?\nSurely that means they also maintain it better, since they enforce much \nmore strenuously?\n\n\nIt was just a single sou…",
          "link": "https://rachelbythebay.com/w/2021/08/18/infra/",
          "publishedOn": "2021-08-18T23:42:04.000Z",
          "wordCount": 787,
          "title": "A big hole in a big road ate one of my tires"
        },
        {
          "id": "https://rachelbythebay.com/w/2021/08/17/pop/",
          "author": null,
          "description": "There was a SEV review meeting once upon a time, and in it, we had \nreviewed some incident where something bad happened involving something \nthat ran as root.  I don't remember the finer points of that one any \nmore, but the resident VP who ran the show wondered aloud how much \n\"root exposure\" we had in our infra in general.  That got my attention.\n\n\nAfter the meeting ended without using the whole 90 minutes, the room was \nstill reserved for another 15-20 minutes or so, and a couple of people \nhung out to look at the list.  One noticed that this one service \nrunning everywhere had these options for \"pre\" and \"post\" commands.  \nThis was a service which was normally used for performance measurement \nstuff and involved running an external command.  You'd say \"okay, \nanalyze this thing for me\"…",
          "link": "https://rachelbythebay.com/w/2021/08/17/pop/",
          "publishedOn": "2021-08-17T21:27:02.000Z",
          "wordCount": 941,
          "title": "Asking nicely for root command execution (and getting it)"
        },
        {
          "id": "https://rachelbythebay.com/w/2021/08/02/meetings/",
          "author": null,
          "description": "I was a new employee.  I wanted to see what the reliability situation \nwas at the company.  Nobody was going to just tell me, so I had to just \ntry a bunch of things to see how much could be learned from poking \naround.\n\n\nAt one of them, there were two people representing a single outage.  One \nof them (\"user\") was from this team that used GPUs to compute something \nor other.  The other one (\"service\") managed the team that ran the \ngunk that let people ask for machines with GPUs so they can run stuff.  \nWhat happened is that \"service\" presented it as \"user screwed up and \nwas down because of some stuff that happened\".\n\n\nIt turned out to be a completely different story than the one they were \npitching.  In fact, what happened is that the \"service\" team made some \nchange and started shippin…",
          "link": "https://rachelbythebay.com/w/2021/08/02/meetings/",
          "publishedOn": "2021-08-02T09:15:15.000Z",
          "wordCount": 1160,
          "title": "Reliability meeting experiences"
        }
      ]
    },
    {
      "title": "LOW-TECH MAGAZINE",
      "feedUrl": "https://feeds2.feedburner.com/typepad/krisdedecker/lowtechmagazineenglish",
      "siteUrl": "https://www.lowtechmagazine.com/",
      "articles": []
    },
    {
      "title": "esoteric.codes",
      "feedUrl": "https://esoteric.codes/rss",
      "siteUrl": "https://esoteric.codes",
      "articles": [
        {
          "id": "https://esoteric.codes/blog/bouk-monkey-satirical-code-used-by-people-who-dont-get-the-joke",
          "author": null,
          "description": "Collisions between the personal and the commercial in open-source have become familiar, like when an irate independent developer pulled a widely-used package entirely in 2016 bringing down hundreds of projects. But we don't expect a commercial enterprise to suddenly discover a package they have long relied on forbids any use at all—and does so for a very good reason.\n\r\nThis was the realization for dapr, a “portable, serverless, event-driven runtime,” with 14k stars on GitHub, when an issue was opened last week about its dependency bouk/monkey. Monkey's license, in its entirety, reads:\n\r\n\r\nI do not give anyone permissions to use this tool for any purpose. Don’t use it.\n\r\nI’m not interested in changing this license. Please don’t ask.\n\r\n\r\nIt raises the question: do even corporate entities read the licenses of packages they use? While Dapr was called out, Arduino, SalesForce, and hundreds of other projects also reference Monkey.\nRead More",
          "link": "https://esoteric.codes/blog/bouk-monkey-satirical-code-used-by-people-who-dont-get-the-joke",
          "publishedOn": "2021-08-30T10:33:00.000Z",
          "wordCount": 1908,
          "title": "Monkey: the satirical Go package used unwittingly by Arduino and SalesForce"
        },
        {
          "id": "https://esoteric.codes/blog/african-programming-languages",
          "author": null,
          "description": "A phonebook.yl program in Yorlang\n\r\nThe language Yorlang began like many code projects, with a group of programmers contemplating a what-if.\n\r\n\r\nOne evening after work, i was scrolling through the messages in a group chat that i'm in and i read a message by someone talking about how cool it will be to have a programming language in yoruba that can process the command \"sope 'hello world' \". So, i thought it was cool and i decided to create a very small language.\n\r\n\r\nWith that modest intention in mind, Karounwi Anoulowapo (based in Nigeria) created Yorlang, a JS-like language using keywords drawn from Yoruba. As colleagues requested more features, he kept expanding it until it became a full-fledged language. Other Yoruba-speaking programmers contributed, along with some non-speakers who were excited about a programming language created by and for West Africans.\n\r\n\r\nOne of the major contributors to the projects is a guy from the Igbo tribe. He documented the architecture of the code, contributed helper functions to the language, and also made small sample programs using yorlang.\nRead More",
          "link": "https://esoteric.codes/blog/african-programming-languages",
          "publishedOn": "2021-08-18T09:20:00.000Z",
          "wordCount": 1547,
          "title": "Coding in Indigenous African Languages"
        },
        {
          "id": "https://esoteric.codes/blog/fat-dactyls",
          "author": null,
          "description": "If you make a language and are lucky, someone else will write code for it. If you are very lucky, someone else will find uses for it you never intended, or that even challenge the premise of the language.\n\r\nThis is not the same as using the language in an unexpected way. Urban Müller could not have foreseen brainfuck as the bedrock for a Rust-like language or a CPU. But do these projects truly counter brainfuck's premise? I would argue not. Brainfuck appears chaotic but part of its appeal has always been in conquering that chaos, in building efficient algorithms using the language despite the challenge. These projects counter the chaos of brainfuck, but that really is the appeal of brainfuck in the first place, they are simply taking it much further than could have been anticipated. If Müller had wanted brainfuck to be impossible to master, he would have designed the language much differently.\n\r\nSometimes, however, a language inspires work that falls very far from the intent of its original designer. Most esolangs, like mainstream programming languages, are open systems and don't dictate how programmers use them. C# offers many features to make structured code easy. But I can also write C# that looks like 80s BASIC wrapped in some standard C# boilerplate:\nRead More",
          "link": "https://esoteric.codes/blog/fat-dactyls",
          "publishedOn": "2021-07-13T10:18:00.000Z",
          "wordCount": 1354,
          "title": "Fat Dactyls"
        }
      ]
    },
    {
      "title": "Lea Verou",
      "feedUrl": "https://feeds.feedburner.com/leaverou",
      "siteUrl": "https://lea.verou.me",
      "articles": []
    },
    {
      "title": "TEXT-MODE",
      "feedUrl": "https://text-mode.tumblr.com/rss",
      "siteUrl": "https://text-mode.tumblr.com/",
      "articles": []
    },
    {
      "title": "Julia Evans",
      "feedUrl": "https://jvns.ca/atom.xml",
      "siteUrl": "http://jvns.ca/atom.xml",
      "articles": [
        {
          "id": "https://jvns.ca/blog/confusing-explanations/",
          "author": null,
          "description": "Hello! Recently I’ve been thinking about why I explain things the way I do. The\nusual way I write is:\nTry to learn a topic\nRead a bunch of explanations that I find confusing\nEventually understand the topic\nWrite an explanation that makes sense to me, to help others\nSo why do I find all these explanations so confusing? I decided to try and find\nout! I came up with a list of 12 patterns that make explanations hard for me to\nunderstand. For each pattern I’ll also explain what I like to do instead to\navoid the issue.\nthese patterns are very normal\nThis list isn’t meant to make you feel bad about your writing. I’ve probably\ndone all of these things! I’m certainly going to do them again! I even did at\nleast one of them while writing this post!\nBut knowing that I’m likely to accidently do these t…",
          "link": "https://jvns.ca/blog/confusing-explanations/",
          "publishedOn": "2021-08-19T02:13:26.000Z",
          "wordCount": 3819,
          "title": "Patterns in confusing explanations"
        },
        {
          "id": "https://jvns.ca/blog/2021/07/08/writing-great-examples/",
          "author": null,
          "description": "When I write about programming, I spend a lot of time trying to come up with\ngood examples. I haven’t seen a lot written about how to make examples, so\nhere’s a little bit about my approach to writing examples!\nThe basic idea here is to start with real code that you wrote and then remove\nirrelevant details to make it into a self-contained example instead of coming\nup with examples out of thin air.\nI’ll talk about two kinds of examples: realistic examples and suprising\nexamples.\ngood examples are realistic\nTo see why examples should be realistic, let’s first talk about an unrealistic\nexample! Let’s say we’re trying to explain Python lambdas (which is just the\nfirst concept I thought of). You could give this example, of using map and a\nlambda to double a set of numbers.\nnumbers = [1, 2, 3, 4…",
          "link": "https://jvns.ca/blog/2021/07/08/writing-great-examples/",
          "publishedOn": "2021-07-08T11:00:46.000Z",
          "wordCount": 847,
          "title": "Write good examples by starting with real code"
        }
      ]
    },
    {
      "title": "Josh Comeau's blog",
      "feedUrl": "https://www.joshwcomeau.com/rss.xml",
      "siteUrl": "https://www.joshwcomeau.com/",
      "articles": [
        {
          "id": "https://www.joshwcomeau.com/gatsby/seo-friendly-sitemap/",
          "author": "Josh W. Comeau",
          "description": "If you maintain a blog, documentation, or any other sort of writing-based Gatsby site, you know how much work goes into content creation. Help users find your work by ensuring that it's properly indexed by Google!",
          "link": "https://www.joshwcomeau.com/gatsby/seo-friendly-sitemap/",
          "publishedOn": "2021-08-30T20:41:53.000Z",
          "wordCount": 1758,
          "title": "Generate an SEO-Friendly Sitemap for your Gatsby Site"
        },
        {
          "id": "https://www.joshwcomeau.com/css/transforms/",
          "author": "Josh W. Comeau",
          "description": "The “transform” property is such a powerful part of the CSS language! In this blog post, we'll take a deep look at this property and see some of the nifty things it can do.",
          "link": "https://www.joshwcomeau.com/css/transforms/",
          "publishedOn": "2021-08-09T19:35:43.000Z",
          "wordCount": 1946,
          "title": "The World of CSS Transforms"
        },
        {
          "id": "https://www.joshwcomeau.com/react/prefers-reduced-motion/",
          "author": "Josh W. Comeau",
          "description": "I really love animation, but not everybody does. In fact, it can make some people literally sick! In this tutorial, we'll see how to ensure that we respect user preferences, and create animations that can be disabled.",
          "link": "https://www.joshwcomeau.com/react/prefers-reduced-motion/",
          "publishedOn": "2021-07-21T19:42:21.000Z",
          "wordCount": 1826,
          "title": "Accessible Animations in React"
        },
        {
          "id": "https://www.joshwcomeau.com/career/remote-work-pt2/",
          "author": "Josh W. Comeau",
          "description": "As remote work becomes increasingly popular, I am frequently asked how to get started. This article shares everything I know about landing that first remote gig.",
          "link": "https://www.joshwcomeau.com/career/remote-work-pt2/",
          "publishedOn": "2021-07-20T14:40:45.000Z",
          "wordCount": 3349,
          "title": "Finding your first remote job"
        },
        {
          "id": "https://www.joshwcomeau.com/blog/how-to-learn-stuff-quickly/",
          "author": "Josh W. Comeau",
          "description": "As software developers, we're always learning new things; it's practically the whole gig! If we can learn to quickly pick up new languages/frameworks/tools, we'll become so much more effective at our job. It's sort of a superpower.",
          "link": "https://www.joshwcomeau.com/blog/how-to-learn-stuff-quickly/",
          "publishedOn": "2021-07-19T14:24:16.000Z",
          "wordCount": 2893,
          "title": "How To Learn Stuff Quickly"
        }
      ]
    },
    {
      "title": "The Mozilla Blog",
      "feedUrl": "https://blog.mozilla.org/en/feed/",
      "siteUrl": "https://blog.mozilla.org/en/",
      "articles": [
        {
          "id": "https://blog.mozilla.org/?p=66868",
          "author": "Elise Blanchard",
          "description": "The internet has ingrained itself into every aspect of our lives, but there’s one aspect of the digital world that I bet you take for granted. Did you ever notice that many links, specifically hyperlinks, are blue? When a co-worker casually asked me why links are blue, I was stumped. As a user experience designer […]\nThe post Why are hyperlinks blue? appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/internet-culture/deep-dives/why-are-hyperlinks-blue/",
          "publishedOn": "2021-08-26T15:00:00.000Z",
          "wordCount": 2910,
          "title": "Why are hyperlinks blue?"
        },
        {
          "id": "https://blog.mozilla.org/?p=67138",
          "author": "Mozilla",
          "description": "With Listen, you can have your articles in Pocket read out loud. This is perfect for those times when you’re doing chores around the house or driving during your commute, when your eyes and hands are busy. Step 1: Open your Pocket list in your mobile device and choose an article. Step 2: Tap the […]\nThe post How to enable text-to-speech in Pocket appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/videos/how-to-enable-text-to-speech-in-pocket/",
          "publishedOn": "2021-08-25T22:18:01.000Z",
          "wordCount": 761,
          "title": "How to enable text-to-speech in Pocket"
        },
        {
          "id": "https://blog.mozilla.org/?p=67150",
          "author": "Rebecca Smith",
          "description": "Pocket has long been the go-to place to discover, save, and spend time with the most thought-provoking and entertaining content from around the web. Now, Pocket – a Mozilla product – has teamed up with Slate’s world-class podcast hosts to provide deep dives into the episodes their listeners can’t stop thinking about. Through curated Pocket […]\nThe post Stories Behind the Podcasts: Pocket’s New Partnership With Slate appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/products/pocket/pocket-slate-podcast-partnership-announcement/",
          "publishedOn": "2021-08-25T15:17:36.000Z",
          "wordCount": 1079,
          "title": "Stories Behind the Podcasts: Pocket’s New Partnership With Slate"
        },
        {
          "id": "https://blog.mozilla.org/?p=67127",
          "author": "Mozilla",
          "description": "Save what inspires you. Pocket is your save button for the internet. When a story catches your eye anywhere online, save it to Pocket and it’ll go straight to your list, ready for you to dig into when you’re free. Step 1: Create a Pocket account. Step 2: Install the Pocket app across your iOS […]\nThe post Get started with Pocket appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/videos/get-started-with-pocket/",
          "publishedOn": "2021-08-24T22:39:27.000Z",
          "wordCount": 796,
          "title": "Get started with Pocket"
        },
        {
          "id": "https://blog.mozilla.org/?p=66930",
          "author": "Lindsey Shepard",
          "description": "This past graduation season, Mozilla’s Pocket teamed up with Her Campus for The Future Connection, a writing contest for college students to reflect on what it’s like to come of age in a “hyper-online and always-connected world.” While this isn’t a new concept for them — this generation, including our essay contest winner, Esther Omole, were born […]\nThe post Here’s what I learned from reading dozens of essays about the internet appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/products/pocket/mozilla-cmo-lindsey-shepard-thoughts-pocket-college-essay-contest/",
          "publishedOn": "2021-08-24T16:00:00.000Z",
          "wordCount": 1584,
          "title": "Here’s what I learned from reading dozens of essays about the internet"
        },
        {
          "id": "https://blog.mozilla.org/?p=66826",
          "author": "Rebecca Smith",
          "description": "This past May, Pocket and HerCampus teamed up to announce an essay contest asking college students to reflect on what it’s like to come of age in a hyper-online world for a $5,000 cash prize and the opportunity to be published and promoted on Pocket. There were over 800 entries, and we are excited to […]\nThe post Reflection: Embracing My Undulating Image appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/products/pocket/college-esssay-contest-winner-mozilla-pocket-hercampus/",
          "publishedOn": "2021-08-23T14:06:32.000Z",
          "wordCount": 1305,
          "title": "Reflection: Embracing My Undulating Image"
        },
        {
          "id": "https://blog.mozilla.org/?p=66855",
          "author": "Damiano",
          "description": "At Mozilla, we believe part of making the internet we want is celebrating the best of the internet, and that can be as simple as sharing a tweet that made us pause in our feed. Twitter isn’t perfect, but there are individual tweets that come pretty close. Each week in Top Shelf, we will be […]\nThe post Cybersecurity, Facebook data, OnlyFans update and more are on this week’s Top Shelf appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/internet-culture/best-tweets-august-16-cybersecurity-facebook-data-onlyfans/",
          "publishedOn": "2021-08-20T22:22:18.000Z",
          "wordCount": 1167,
          "title": "Cybersecurity, Facebook data, OnlyFans update and more are on this week’s Top Shelf"
        },
        {
          "id": "https://blog.mozilla.org/?p=66812",
          "author": "Damiano",
          "description": "At Mozilla, we believe part of making the internet we want is celebrating the best of the internet, and that can be as simple as sharing a tweet that made us pause in our feed. Twitter isn’t perfect, but there are individual tweets that come pretty close. Each week in Top Shelf, we will be […]\nThe post Fall Plans vs. the Delta Variant, Deciphering Gen Z’s use of emojis, Sarah Paulson as Linda Tripp, and more are on this week’s Top Shelf appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/internet-culture/best-tweets-week-of-august-8/",
          "publishedOn": "2021-08-13T21:28:51.000Z",
          "wordCount": 1103,
          "title": "Fall Plans vs. the Delta Variant, Deciphering Gen Z’s use of emojis, Sarah Paulson as Linda Tripp, and more are on this week’s Top Shelf"
        },
        {
          "id": "https://blog.mozilla.org/?p=66686",
          "author": "M.J. Kelly",
          "description": "Every summer I say I’m going to go watch the meteor showers, but life always seems to get in the way. This year, however, I scored a last minute midweek campsite on the Washington coast so I can take in the Perseid meteor shower away from city lights. While the Perseids are ongoing from mid-July […]\nThe post Perseid meteor shower on your mind? Check out these online resources for newbie astronomers plus 6 Firefox themes for daytime stargazing. appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/products/firefox/extensions-addons/perseid-meteor-shower-online-resources-firefox-themes/",
          "publishedOn": "2021-08-05T20:40:28.000Z",
          "wordCount": 1206,
          "title": "Perseid meteor shower on your mind? Check out these online resources for newbie astronomers plus 6 Firefox themes for daytime stargazing."
        },
        {
          "id": "https://blog.mozilla.org/?p=66683",
          "author": "Mozilla",
          "description": "The post An update from Firefox appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/products/firefox/an-update-from-firefox/",
          "publishedOn": "2021-08-05T14:46:22.000Z",
          "wordCount": 749,
          "title": "An update from Firefox"
        },
        {
          "id": "https://blog.mozilla.org/?p=66790",
          "author": "Marshall Erwin",
          "description": "Recently the Surgeon General of the United States weighed in on the spread of disinformation on major platforms and its effects on people and society. He echoed the calls of researchers, activists and organizations, like Mozilla, for the major platforms to release more data, and to provide access to researchers in order to analyze the […]\nThe post Why Facebook’s claims about the Ad Observer are wrong appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/mozilla/news/why-facebooks-claims-about-the-ad-observer-are-wrong/",
          "publishedOn": "2021-08-04T17:33:45.000Z",
          "wordCount": 1412,
          "title": "Why Facebook’s claims about the Ad Observer are wrong"
        },
        {
          "id": "https://blog.mozilla.org/?p=66787",
          "author": "Mozilla",
          "description": "Earlier this summer, we started a series of blog posts analyzing the technical merits of the various privacy-preserving advertising proposals out there. Our goal is to advance the debate and help break down this complex topic. In this new addition to this series, we look at the SWAN.community and United ID 2.0 proposals. We have […]\nThe post Privacy analysis of SWAN.community and United ID 2.0 appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/mozilla/swan-uid2-privacy/",
          "publishedOn": "2021-08-04T17:13:53.000Z",
          "wordCount": 1183,
          "title": "Privacy analysis of SWAN.community and United ID 2.0"
        },
        {
          "id": "https://blog.mozilla.org/?p=66633",
          "author": "Mozilla",
          "description": "Will 2021 prove to be the year privacy went mainstream? Our guest author discusses events pointing to a turning point in favor of consumer privacy.\nThe post 2021: The year privacy went mainstream appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/internet-culture/deep-dives/2021-the-year-privacy-went-mainstream/",
          "publishedOn": "2021-07-29T16:00:36.000Z",
          "wordCount": 1761,
          "title": "2021: The year privacy went mainstream"
        },
        {
          "id": "https://blog.mozilla.org/?p=66635",
          "author": "M.J. Kelly",
          "description": "On the internet you are never alone, and because of that at Mozilla we know that we can’t work to build a better internet alone. We believe in and rely on our community — from our volunteers, to our staff, to our users, fans and friends. Meet Lalo Luevano, partner and co-founder of Bodega, a […]\nThe post Lalo Luevano, restaurateur and co-founder of Bodega wine bar appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/products/firefox/sidebar-lalo-luevano-restauranteur-bodega/",
          "publishedOn": "2021-07-28T17:00:02.000Z",
          "wordCount": 1988,
          "title": "Lalo Luevano, restaurateur and co-founder of Bodega wine bar"
        },
        {
          "id": "https://blog.mozilla.org/?p=66621",
          "author": "Mozilla",
          "description": "A year goes by so quickly, and we have good reason to celebrate. Since our launch last year, Mozilla VPN, our fast and easy-to-use Virtual Private Network service, has expanded to seven countries including Austria, Belgium, France, Germany, Italy, Spain and Switzerland adding to 13 countries where Mozilla VPN is available. We also expanded our […]\nThe post Celebrating Mozilla VPN: How we’re keeping your data safe for you appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/mozilla/celebrating-mozilla-vpn-how-were-keeping-your-data-safe-for-you/",
          "publishedOn": "2021-07-28T16:00:00.000Z",
          "wordCount": 1380,
          "title": "Celebrating Mozilla VPN: How we’re keeping your data safe for you"
        },
        {
          "id": "https://blog.mozilla.org/?p=66604",
          "author": "Damiano",
          "description": "Our favorite tweets from journalists this week that featured baseball, a rocket and more. \nThe post Space Cowboy, Guardians of Cleveland, and Tony Award winner Ellen Barkin considers a Subtack – here is this week’s Top Shelf. appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/internet-culture/top-shelf-july-23/",
          "publishedOn": "2021-07-23T21:08:08.000Z",
          "wordCount": 1124,
          "title": "Space Cowboy, Guardians of Cleveland, and Tony Award winner Ellen Barkin considers a Subtack – here is this week’s Top Shelf."
        },
        {
          "id": "https://blog.mozilla.org/?p=66573",
          "author": "Jen Caltrider",
          "description": "A growing number of us have connected devices in our homes, offices, driveways and even our bodies. The convenience and fun of integrating a device with daily life is real, but there haven’t been nearly enough conversations about who owns that data and how much consumers are letting big companies into their lives in unexpected […]\nThe post Do you own a connected device? Here’s why you should be wary of the Peloton lock issue. appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/internet-culture/deep-dives/peloton-connected-device-ownership/",
          "publishedOn": "2021-07-20T21:51:14.000Z",
          "wordCount": 1197,
          "title": "Do you own a connected device? Here’s why you should be wary of the Peloton lock issue."
        },
        {
          "id": "https://blog.mozilla.org/?p=66547",
          "author": "Damiano",
          "description": "At Mozilla, we believe part of making the internet we want is celebrating the best of the internet, and that can be as simple as sharing a tweet that made us pause in our feed. Twitter isn’t perfect, but there are individual tweets that come pretty close. Each week in Top Shelf, we will be […]\nThe post Olivia Rodrigo, the cast of “The French Dispatch,” “Loki” and more are on this week’s Top Shelf appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/internet-culture/top-shelf-olivia-rodrigo-july-12/",
          "publishedOn": "2021-07-16T20:16:56.000Z",
          "wordCount": 1197,
          "title": "Olivia Rodrigo, the cast of “The French Dispatch,” “Loki” and more are on this week’s Top Shelf"
        },
        {
          "id": "http://blog.mozilla.org/foxtail/2020/10/05/break-free-from-the-doomscroll-with-pocket/",
          "author": "M.J. Kelly",
          "description": "Last year a new phrase crept into the zeitgeist: doomscrolling, the tendency to get stuck in a bad news content cycle even when consuming it makes us feel worse. That’s no surprise given that 2020 was one for the books with an unrelenting flow of calamitous topics, from the pandemic to murder hornets to wild […]\nThe post Break free from the doomscroll with Pocket appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/internet-culture/deep-dives/break-free-from-the-doomscroll-with-pocket/",
          "publishedOn": "2021-07-12T18:26:09.000Z",
          "wordCount": 2307,
          "title": "Break free from the doomscroll with Pocket"
        },
        {
          "id": "https://blog.mozilla.org/?p=66519",
          "author": "Mozilla",
          "description": "The Biden Administration issued today an Executive Order on Promoting Competition in the American Economy. “Reinstating net neutrality is a crucial down payment on the much broader internet reform that we need and we’re glad to see the Biden Administration make this a priority in its new Executive Order today. Net neutrality preserves the environment […]\nThe post Net neutrality: reacting to the Executive Order on Promoting Competition in the American Economy appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/mozilla/internet-policy/net-neutrality-reacting-on-the-executive-order-on-promoting-competition-in-the-american-economy/",
          "publishedOn": "2021-07-09T23:17:15.000Z",
          "wordCount": 953,
          "title": "Net neutrality: reacting to the Executive Order on Promoting Competition in the American Economy"
        },
        {
          "id": "https://blog.mozilla.org/?p=66519",
          "author": "Mozilla",
          "description": "The Biden Administration issued today an Executive Order on Promoting Competition in the American Economy. “Reinstating net neutrality is a crucial down payment on the much broader internet reform that we need and we’re glad to see the Biden Administration make this a priority in its new Executive Order today. Net neutrality preserves the environment […]\nThe post Net neutrality: reacting on the Executive Order on Promoting Competition in the American Economy appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/mozilla/net-neutrality-reacting-on-the-executive-order-on-promoting-competition-in-the-american-economy/",
          "publishedOn": "2021-07-09T23:17:15.000Z",
          "wordCount": 943,
          "title": "Net neutrality: reacting on the Executive Order on Promoting Competition in the American Economy"
        },
        {
          "id": "https://blog.mozilla.org/?p=66514",
          "author": "Marshall Erwin",
          "description": "Regulators and technology companies together have an unique opportunity to improve the privacy properties of online advertising. Improving privacy for everyone must remain the north star of efforts surrounding privacy preserving advertising and we welcome the recent moves by the UK’s Competition Markets Authority to invite public comments on the recent voluntary commitments proposed by […]\nThe post Mozilla responds to the UK CMA consultation on Google’s commitments on the Chrome Privacy Sandbox appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/mozilla/uk-cma-google-commitments-chrome-privacy-sandbox/",
          "publishedOn": "2021-07-09T08:00:00.000Z",
          "wordCount": 1219,
          "title": "Mozilla responds to the UK CMA consultation on Google’s commitments on the Chrome Privacy Sandbox"
        },
        {
          "id": "https://blog.mozilla.org/?p=66512",
          "author": "Mozilla",
          "description": "CIRA Joins Firefox’s Trusted Recursive Resolver Program In a few weeks, Firefox will start the by-default rollout of DNS over HTTPS (or DoH for short) to its Canadian users in partnership with local DoH provider CIRA, the Canadian Internet Registration Authority. DoH will first become a default for 1% of Canadian Firefox users on July […]\nThe post Firefox extends privacy and security of Canadian internet users with by-default DNS-over-HTTPS rollout in Canada appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/mozilla/news/firefox-by-default-dns-over-https-rollout-in-canada/",
          "publishedOn": "2021-07-08T13:00:00.000Z",
          "wordCount": 1379,
          "title": "Firefox extends privacy and security of Canadian internet users with by-default DNS-over-HTTPS rollout in Canada"
        }
      ]
    },
    {
      "title": "A List Apart: The Full Feed",
      "feedUrl": "https://alistapart.com/main/feed/",
      "siteUrl": "https://alistapart.com",
      "articles": [
        {
          "id": "https://alistapart.com/article/design-for-safety-excerpt/",
          "author": "by",
          "description": "Antiracist economist Kim Crayton says that “intention without strategy is chaos.” We’ve discussed how our biases, assumptions, and inattention toward marginalized and vulnerable groups lead to dangerous and unethical tech—but what, specifically, do we need to do to fix it? The intention to make our tech safer is not enough; we need a strategy.\nThis chapter will equip you with that plan of action. It covers how to integrate safety principles into your design work in order to create tech that’s safe, how to convince your stakeholders that this work is necessary, and how to respond to the critique that what we actually need is more diversity. (Spoiler: we do, but diversity alone is not the antidote to fixing unethical, unsafe tech.)\nThe process for inclusive safety\nWhen you are designing for …",
          "link": "https://alistapart.com/article/design-for-safety-excerpt/",
          "publishedOn": "2021-08-26T15:01:43.000Z",
          "wordCount": 3998,
          "title": "Design for Safety, An Excerpt"
        },
        {
          "id": "https://alistapart.com/article/sustainable-web-design-excerpt/",
          "author": "by",
          "description": "In the 1950s, many in the elite running community had begun to believe it wasn’t possible to run a mile in less than four minutes. Runners had been attempting it since the late 19th century and were beginning to draw the conclusion that the human body simply wasn’t built for the task. \nBut on May 6, 1956, Roger Bannister took everyone by surprise. It was a cold, wet day in Oxford, England—conditions no one expected to lend themselves to record-setting—and yet Bannister did just that, running a mile in 3:59.4 and becoming the first person in the record books to run a mile in under four minutes. \nThis shift in the benchmark had profound effects; the world now knew that the four-minute mile was possible. Bannister’s record lasted only forty-six days, when it was snatched away by Australian ru…",
          "link": "https://alistapart.com/article/sustainable-web-design-excerpt/",
          "publishedOn": "2021-08-05T14:00:00.000Z",
          "wordCount": 3535,
          "title": "Sustainable Web Design, An Excerpt"
        },
        {
          "id": "https://alistapart.com/article/voice-content-and-usability/",
          "author": "by",
          "description": "We’ve been having conversations for thousands of years. Whether to convey information, conduct transactions, or simply to check in on one another, people have yammered away, chattering and gesticulating, through spoken conversation for countless generations. Only in the last few millennia have we begun to commit our conversations to writing, and only in the last few decades have we begun to outsource them to the computer, a machine that shows much more affinity for written correspondence than for the slangy vagaries of spoken language.\nComputers have trouble because between spoken and written language, speech is more primordial. To have successful conversations with us, machines must grapple with the messiness of human speech: the disfluencies and pauses, the gestures and body language, an…",
          "link": "https://alistapart.com/article/voice-content-and-usability/",
          "publishedOn": "2021-07-29T13:00:00.000Z",
          "wordCount": 3835,
          "title": "Voice Content and Usability"
        },
        {
          "id": "https://alistapart.com/article/designing-for-the-unexpected/",
          "author": "by",
          "description": "I’m not sure when I first heard this quote, but it’s something that has stayed with me over the years. How do you create services for situations you can’t imagine? Or design products that work on devices yet to be invented?\nFlash, Photoshop, and responsive design\nWhen I first started designing websites, my go-to software was Photoshop. I created a 960px canvas and set about creating a layout that I would later drop content in. The development phase was about attaining pixel-perfect accuracy using fixed widths, fixed heights, and absolute positioning.\nEthan Marcotte’s talk at An Event Apart and subsequent article “Responsive Web Design” in A List Apart in 2010 changed all this. I was sold on responsive design as soon as I heard about it, but I was also terrified. The pixel-perfect designs f…",
          "link": "https://alistapart.com/article/designing-for-the-unexpected/",
          "publishedOn": "2021-07-15T13:00:00.000Z",
          "wordCount": 4564,
          "title": "Designing for the Unexpected"
        }
      ]
    },
    {
      "title": "Pluralistic: Daily links from Cory Doctorow",
      "feedUrl": "https://pluralistic.net/feed/",
      "siteUrl": "https://pluralistic.net",
      "articles": [
        {
          "id": "https://pluralistic.net/?p=2555",
          "author": "Cory Doctorow",
          "description": "Today's links India's 'toxic' ed-tech giant: How Byju's hard-sells desperate parents into taking out predatory loans for their kids' education. Podcasting \"Utilities and Empires\" and \"FB's War on Switching Costs\": A twofer from EFF's Deeplinks blog, on this week's podcast. This day in history: 2001, 2011, 2016, 2020 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading India's 'toxic' ed-tech giant (permalink) Byju's is a titan of the Indian ed-tech market, and its flagship program, The Learning App, has 40m users and 2.8m paid subscribers; its valuation is about to climb to $21b; it's been on a spending spree, buying up competitors in Asia and the USA. But as Akanksha Singh writes for Rest of World, the company's sales culture is rotten from…",
          "link": "https://pluralistic.net/2021/08/30/the-learning-app/",
          "publishedOn": "2021-08-30T16:52:37.000Z",
          "wordCount": 1656,
          "title": "Pluralistic: 30 Aug 2021",
          "enclosure": {
            "url": "https://archive.org/download/Cory_Doctorow_Podcast_401/Cory_Doctorow_Podcast_401_-_With_Great_Power_Comes_Great_Responsibility.mp3",
            "length": "0",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://pluralistic.net/?p=2547",
          "author": "Cory Doctorow",
          "description": "Today's links The \"work ethic\" is a dirty trick we play on ourselves: Rationalizing away the pointlessness and indignity of low-waged work. Facebook's war on switching costs: Network effects attract users, switching costs take them hostage. This day in history: 2001, 2006, 2020. Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading The \"work ethic\" is a dirty trick we play on ourselves (permalink) In Nebraska – and elsewhere – the forced-labor camps that some prisoners are sent to have been rebranded. They're called \"Work-Ethic Camps\" now, and prisoners do 30-40h/week of hard labor for $1.21/day, interspersed with \"intro to business\" courses. As Jamiek McCallum writes in Aeon: \"If there was a formula for obliterating the work ethic, giving pe…",
          "link": "https://pluralistic.net/2021/08/28/talking-hard-work-blues/",
          "publishedOn": "2021-08-28T18:01:31.000Z",
          "wordCount": 2618,
          "title": "Pluralistic: 28 Aug 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2537",
          "author": "Cory Doctorow",
          "description": "Today's links Vaccinate workers at (almost) any price: Corporate America sabotaged paid vaccination leave. This day in history: 2001, 2011, 2020 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Vaccinate workers at (almost) any price (permalink) I admit it. I look at the overloaded hospitals, read the testimony of overworked health care workers, see the spiking case- and death-counts, and I find myself angry at people who won't get vaccinated. It's hard not to be angry, especially when you see people who reject the assurances about vaccine safety but conduct uncontrolled experiments on themselves using livestock medicine, based on conspiratorial social media threads. https://www.dailyposter.com/the-corporate-deterrent-to-more-vaccination…",
          "link": "https://pluralistic.net/2021/08/26/chained-to-the-mast/",
          "publishedOn": "2021-08-26T16:24:32.000Z",
          "wordCount": 1252,
          "title": "Pluralistic: 26 Aug 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2531",
          "author": "Cory Doctorow",
          "description": "Today's links Big Box stores' other shoe drops: Lowe's is a parasite that is killing its host. Belarusian dictator pwned by \"cyber-partisans\": When a secretive autocrat has no more secrets. This day in history: 2001, 2006, 2011, 2020 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Big Box stores' other shoe drops (permalink) Since the start of this century, small and mid-sized towns have courted big box stores, using tax revenues to fund expensive road, sewer and electric expansions to lure large corporate chains to town. These companies promised jobs and tax revenues, and, technically speaking, they delivered both, but only if you do some very funny math. National chains pay little or no federal income tax, and often secure state tax a…",
          "link": "https://pluralistic.net/2021/08/25/taxes-are-for-the-little-stores/",
          "publishedOn": "2021-08-25T17:28:34.000Z",
          "wordCount": 2420,
          "title": "Pluralistic: 25 Aug 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2522",
          "author": "Cory Doctorow",
          "description": "Today's links Are privacy and antitrust on a collision course?: Harmful dominance, democratic privacy controls, interop and illegitimate greatness. This day in history: 2001, 2006, 2011, 2016, 2020 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Are privacy and antitrust on a collision course? (permalink) In \"The New Antitrust/Data Privacy Law Interface,\" Temple Law's Erika M Douglas presents a fascinating look at the tensions between privacy and competition. https://www.yalelawjournal.org/forum/the-new-antitrustdata-privacy-law-interface It's only fitting that Douglas published her paper in the Yale Law Journal, as that's the same journal that kickstarted the modern antitrust revolution when it published Lina Khan's \"Amazon's Antitrust…",
          "link": "https://pluralistic.net/2021/08/24/illegitimate-greatness/",
          "publishedOn": "2021-08-24T15:13:25.000Z",
          "wordCount": 2689,
          "title": "Pluralistic: 24 Aug 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2516",
          "author": "Cory Doctorow",
          "description": "Today's links Podcasting \"Disneyland at a stroll\": Winding up my series on \"amusement parks, crowd control, and load-balancing\" (for now). The Unraveling: Ben Rosenbaum's stunning debut novel. What kind of emergency is our emergency?: Kim Stanley Robinson on the structure of feeling of this perilous moment. The secrets of hospital bills: What do you call a \"market\" where no one chooses the services or knows the prices? This day in history: None Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Podcasting \"Disneyland at a stroll\" (permalink) This week on my podcast, I read parts four and five of my Medium series on \"amusement parks, crowd control, and load-balancing\" – \"Expectations management\" and \"Disneyland at a stroll.\" https://craphou…",
          "link": "https://pluralistic.net/2021/08/23/dont-wanna-spoil-the-surprise/",
          "publishedOn": "2021-08-23T16:56:34.000Z",
          "wordCount": 4546,
          "title": "Pluralistic: 23 Aug 2021",
          "enclosure": {
            "url": "https://archive.org/download/Cory_Doctorow_Podcast_400/Cory_Doctorow_Podcast_400_-_Disneyland_at_a_stroll.mp3",
            "length": "0",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://pluralistic.net/?p=2506",
          "author": "Cory Doctorow",
          "description": "Today's links Bubble: Fantastic graphic novel adaptation of the brilliant comedy/sf podcast. This day in history: 2001, 2011, 2016, 2020 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Bubble (permalink) Bubble is a wildly improbable artifact – a graphic novel adaptation of a comedy/drama podcast that manages to turn podcasting into a visual medium. https://us.macmillan.com/books/9781250245564 Written by Jordan Morris and Sarah Morgan with art by Tony Cliff and colors by Natalie Riess, this Firstcecond book manages to recapture the comedy, the snark, the trenchant commentary and the drama of the original Maximim Fun podcast series. https://maximumfun.org/podcasts/bubble/ Bubble is a comedy/sf story about a distant outpost on a hostile p…",
          "link": "https://pluralistic.net/2021/08/21/podcasting-as-a-visual-medium/",
          "publishedOn": "2021-08-21T16:21:37.000Z",
          "wordCount": 1281,
          "title": "Pluralistic: 21 Aug 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2499",
          "author": "Cory Doctorow",
          "description": "Today's links Machine learning's crumbling foundations: Doing 'data science' with bad data. Hench: The madcap rage of life under vigilante rule. This day in history: 2001, 2006, 2011, 2020 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Machine learning's crumbling foundations (permalink) Technological debt is insidious, a kind of socio-infrastructural subprime crisis that's unfolding around us in slow motion. Our digital infrastructure is built atop layers and layers and layers of code that's insecure due to a combination of bad practices and bad frameworks. Even people who write secure code import insecure libraries, or plug it into insecure authorization systems or databases. Like asbestos in the walls, this cruft has been fragmentin…",
          "link": "https://pluralistic.net/2021/08/19/failure-cascades/",
          "publishedOn": "2021-08-19T17:06:10.000Z",
          "wordCount": 3093,
          "title": "Pluralistic: 19 Aug 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2495",
          "author": "Cory Doctorow",
          "description": "Today's links The Sacklers threaten us all with a good time: \"Give us total impunity or we won't accede to the total impunity deal\" is a hell of an ultimatum. This day in history: 2006, 2011, 2016, 2020 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading The Sacklers threaten us all with a good time (permalink) The Sacklers are a multigenerational family of drug dealers, descended from the pioneer of the benzo epidemic, whose family drug business, Purdue Pharma, jumpstarted the opioid epidemic with its drug Oxycontin. The epidemic's US body count is past 800,000. The Sacklers are worth billions – the family's net worth exceeds that of other criminal dynasties like the Rockefellers. They are facing a blizzard of litigation thanks to their ac…",
          "link": "https://pluralistic.net/2021/08/18/lets-make-a-deal/",
          "publishedOn": "2021-08-18T17:41:08.000Z",
          "wordCount": 1966,
          "title": "Pluralistic: 18 Aug 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2489",
          "author": "Cory Doctorow",
          "description": "Today's links Sandman Slim's final adventure: King Bullet brings in Richard Kadrey's masterpiece for a hell of a landing. Big Oil caught lying about methane: 84 times worse than CO2. This day in history: 2001, 2006, 2011, 2016, 2020 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Sandman Slim's final adventure (permalink) It's been more than a decade since Richard Kadrey blew the roof off supernatural horror with his hardboiled SANDMAN SLIM, the tale of an LA magician whose coven sends him to hell, who returns to wreak bloody revenge. https://memex.craphound.com/2009/07/24/kadreys-sandman-slim-a-hard-boiled-revenge-novel-from-hell/ As impressive as that breakout was, Kadrey has only gone from strength to strength, publishing ten more vo…",
          "link": "https://pluralistic.net/2021/08/17/king-bullet/",
          "publishedOn": "2021-08-17T16:02:53.000Z",
          "wordCount": 1881,
          "title": "Pluralistic: 17 Aug 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2480",
          "author": "Cory Doctorow",
          "description": "Today's links Housing, money laundry, speculation and precarity: Henry George was an optimist. This day in history: 2001, 2006, 2011, 2016, 2020 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Housing, money laundry, speculation and precarity (permalink) Something amazing is happening in Berlin. Next month, Berliners will vote in a referendum to force Germany's largest publicly traded landlords to sell 240,000 homes to the state, whereupon those homes will become publicly owned housing. https://www.ft.com/content/4a5fb5ed-00cf-4a70-8653-820f0c1ff757 Berlin is a rarity: a semi-autonomous city whose history is overshadowed by a half-century of heavy public spending (in the west) as part of a program to prove that capitalism was a system o…",
          "link": "https://pluralistic.net/2021/08/16/die-miete-ist-zu-hoch/",
          "publishedOn": "2021-08-16T17:36:46.000Z",
          "wordCount": 2824,
          "title": "Pluralistic: 16 Aug 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2472",
          "author": "Cory Doctorow",
          "description": "Today's links Provocateur copyrights a Magic: The Gathering Deck: Come for the compilation copyright, stay for the free IP Law Casebook. This day in history: 2001, 2006, 2011, 2020 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Provocateur copyrights a Magic: The Gathering Deck (permalink) Copyright does not protect the fruits of your hard work. It just doesn't. No matter what you've heard, the legal basis for copyright – in US law and in international treaties – is to protect creativity, not effort. If you labor for five years to create a faithful catalog of all the houses in a city or all the books in a library, with the goal of creating as faithful, logical and linear resource as possible, copyright holds no protection for you. On t…",
          "link": "https://pluralistic.net/2021/08/14/angels-and-demons/",
          "publishedOn": "2021-08-14T21:23:58.000Z",
          "wordCount": 2029,
          "title": "Pluralistic: 14 Aug 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2467",
          "author": "Cory Doctorow",
          "description": "Today's links Smart cities are neither, 2021 edition: \"Whose Streets? Our Streets! (Tech Edition).\" End of the line for Reaganomics: The OG antitrust is back, baby! This day in history: 2001, 2006, 2011, 2016, 2020 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Smart cities are neither, 2021 edition (permalink) The lockdown was a chaotic time for \"smart cities.\" On the one hand, the most prominent smart city project in the world – Google's Sidewalk Labs project in Toronto – collapsed thanks to the company's lies about privacy and land use coming to light. https://pluralistic.net/2020/05/07/just-look-at-it/#ding-dong On the other hand, the standalone vendors that promise smart city services that you can graft onto your \"dumb\" city saw t…",
          "link": "https://pluralistic.net/2021/08/13/post-bork-era/",
          "publishedOn": "2021-08-13T16:26:05.000Z",
          "wordCount": 2821,
          "title": "Pluralistic: 13 Aug 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2464",
          "author": "Cory Doctorow",
          "description": "Today's links Canada's got the world's worst internet ideas: The Canada Variant is the most virulent \"online harms\" rule. IRS leaks reveal billions reaped through ultra-wealthy lobbying on the tax bill: A cast of dozens. This day in history: 2001, 2006, 2011, 2016, 2020 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Canada's got the world's worst internet ideas (permalink) Canada's government is poised to pass a \"harmful content\" regulation. It's a worst-in-class mutation of a dangerous idea that's swept the globe, in which governments demand that hamfisted tech giants remove broad categories of speech – too swiftly for meaningful analysis. Many countries have proposed or passed rules on these lines: Australia, France, UK, Germany, Ind…",
          "link": "https://pluralistic.net/2021/08/11/the-canada-variant/",
          "publishedOn": "2021-08-11T15:49:38.000Z",
          "wordCount": 2643,
          "title": "Pluralistic: 11 Aug 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2456",
          "author": "Cory Doctorow",
          "description": "Today's links End of the line for Uber: Accounting tricks and tech gimmickry don't matter when the coffers are empty. This day in history: 2006, 2011, 2016, 2020 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading End of the line for Uber (permalink) Uber is a bezzle (\"the magic interval when a confidence trickster knows he has the money he has appropriated but the victim does not yet understand that he has lost it\"). Every bezzle ends. Uber's time is up. Uber was never going to be profitable. Never. It lured drivers and riders into cars by subsidizing rides with billions and billions of dollars from the Saudi royal family, keeping up the con-artist's ever-shifting patter about how all of this would some day stand on its own. Like the prete…",
          "link": "https://pluralistic.net/2021/08/10/unter/",
          "publishedOn": "2021-08-10T17:01:39.000Z",
          "wordCount": 2675,
          "title": "Pluralistic: 10 Aug 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2453",
          "author": "Cory Doctorow",
          "description": "Today's links Podcasting \"Managing aggregate demand\": What antitrust law tells us about the moral way to cope with demand that outstrips supply. The 22 Murders of Madison May: Max Barry's existential interdimensional crime thriller. When your boss wants an AI camera in your bedroom: \"Work from home\" is really \"live at work.\" This day in history: 2001, 2006, 2011, 2016, 2020 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Podcasting \"Managing aggregate demand\" (permalink) This week on my podcast, I read \"Managing Aggregate Demand,\" the fourth part in my ongoing Medium series about \"amusement parks, crowd control and load-balancing.\" https://doctorow.medium.com/managing-aggregate-demand-part-iv-8d2022a5125b It's a reflection on the econom…",
          "link": "https://pluralistic.net/2021/08/09/computer-says-no/",
          "publishedOn": "2021-08-09T16:53:02.000Z",
          "wordCount": 3055,
          "title": "Pluralistic: 09 Aug 2021",
          "enclosure": {
            "url": "https://archive.org/download/Cory_Doctorow_Podcast_399/Cory_Doctorow_Podcast_399_-_Managing_Aggregate_Demand.mp3",
            "length": "0",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://pluralistic.net/?p=2447",
          "author": "Cory Doctorow",
          "description": "Today's links Doordash privacywashes its war on workers: Tech rights are workers' rights. End bankruptcy shopping: No more Sacklers, ever. This day in history: 2001, 2006, 2016, 2020 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Doordash privacywashes its war on workers (permalink) Dashers aren't stupid. They know that the difference between a profitable Doordash delivery and one where they earn less than they spend on gas is the size of the tip they get at the end of the job. Of course, Doordash knows this too. The company – a corporate predator with a history of wage theft and worker misclassification – knows that its only hope of sustainability is to make real, profitable businesses like restaurants dependent on it. If Doordash can…",
          "link": "https://pluralistic.net/2021/08/07/hr-4193/",
          "publishedOn": "2021-08-07T16:42:41.000Z",
          "wordCount": 2685,
          "title": "Pluralistic: 07 Aug 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2444",
          "author": "Cory Doctorow",
          "description": "Today's links Scammers sell griefers social media banning services: And charge their victims 100x more to get un-banned. Facebook's official disinformation research portal is a bad joke: Especially compared with the independent Ad Obervatory, which the company wants to destroy. This day in history: 2001, 2011, 2016, 2020 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Scammers sell griefers social media banning services (permalink) The Big Tech platforms can be horrible places. Harassers, abusers and griefers have figured out how to use them to meet one another, form vicious assault squads, and drive their targets off the service and make life miserable for those who stay. https://www.themarysue.com/phd-in-gamergate/ What's more, the pl…",
          "link": "https://pluralistic.net/2021/08/06/get-you-coming-and-going/",
          "publishedOn": "2021-08-06T16:48:06.000Z",
          "wordCount": 2604,
          "title": "Pluralistic: 06 Aug 2021",
          "enclosure": {
            "url": "http://www.ntk.net/ballmer/dancemonkeyboy.mpg",
            "length": "162",
            "type": "video/mpeg"
          }
        },
        {
          "id": "https://pluralistic.net/?p=2441",
          "author": "Cory Doctorow",
          "description": "Today's links Meet the new generation of pro-abortion activists: No more Mx Nice Intersectionalist. Anti-vaxers cool the mark: Using sociology to understand the con. Drone delivery crashes: What do AI, self-driving cars and Amazon drones have in common? Facebook escalates war on accountability: Privacywashing vs Ad Observer. This day in history: 2011, 2016, 2020 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Meet the new generation of pro-abortion activists (permalink) With Roe v Wade likely headed to the US Supreme Court and a woman's right to a safe and legal abortion under grave threat, a new generation of pro-abortion activists are rising up. As Amelia Pollard writes for The American Prospect, this new wave is militant, organized a…",
          "link": "https://pluralistic.net/2021/08/05/comprehensive-sex-ed/",
          "publishedOn": "2021-08-05T18:29:22.000Z",
          "wordCount": 3403,
          "title": "Pluralistic: 05 Aug 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2436",
          "author": "Cory Doctorow",
          "description": "Today's links Vaccine refusal and health insurance: Insurers to unvaccinated: \"Drop dead.\" Congress has allocated enough money to end the eviction crisis: But they asked the states to hand it out. Utilities governed like empires: One bad account disconnection can cost you everything. This day in history: 2001, 2006, 2011, 2016, 2020 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Vaccine refusal and health insurance (permalink) At the start of the pandemic, the otherwise irredeemable American health insurance industry experienced a momentary lapse in shittiness and agreed to waive copayments and deductibles for covid hospitalizations. Now, that's ending. This is bad news for anyone who gets hospitalized with covid, because hospitals hav…",
          "link": "https://pluralistic.net/2021/08/04/eighty-sixed/",
          "publishedOn": "2021-08-04T16:16:00.000Z",
          "wordCount": 2363,
          "title": "Pluralistic: 04 Aug 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2429",
          "author": "Cory Doctorow",
          "description": "Today's links Elite debt hits record heights: How the rich get free money and don't pay taxes on it. This day in history: 2001, 2006, 2011, 2016, 2020 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Elite debt hits record heights (permalink) This summer started with a bang, with Propublica's #ecret IRS Files leaks – a massive data-set detailing the tax-evasion strategies of the rich, confirming F Scott Fitzgerald's maxim that \"they are different from you and me\" (We pay tax. They don't). https://pluralistic.net/2021/06/08/leona-helmsley-was-a-pioneer/#eat-the-rich When you are very rich, you can borrow money at interest rates that are next to zero; you can also take your income in stock, rather than cash. Stock is only taxed when you se…",
          "link": "https://pluralistic.net/2021/08/03/fitzgerald-was-an-optimist/",
          "publishedOn": "2021-08-03T16:40:33.000Z",
          "wordCount": 1671,
          "title": "Pluralistic: 03 Aug 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2422",
          "author": "Cory Doctorow",
          "description": "Today's links Machine learning sucks at covid: Every \"AI\" covid tool was useless. Podcasting \"Are We Having Fun Yet?\": The first three parts of my ongoing Medium series on queueing, aggregate demand management and theme parks. This day in history: 2020, 2016, 2011, 2006, 2001 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Machine learning sucks at covid (permalink) The worst part of machine learning snake-oil isn't that it's useless or harmful – it's that ML-based statistical conclusions have the veneer of mathematics, the empirical facewash that makes otherwise suspect conclusions seem neutral, factual and scientific. Think of \"predictive policing,\" in which police arrest data is fed to a statistical model that tells the police where …",
          "link": "https://pluralistic.net/2021/08/02/autoquack/",
          "publishedOn": "2021-08-02T16:57:12.000Z",
          "wordCount": 2287,
          "title": "Pluralistic: 02 Aug 2021",
          "enclosure": {
            "url": "https://archive.org/download/Cory_Doctorow_Podcast_398/Cory_Doctorow_Podcast_398_-_Are_We_Having_Fun_Yet.mp3",
            "length": "0",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://pluralistic.net/?p=2414",
          "author": "Cory Doctorow",
          "description": "Today's links Github pledges legal aid for interoperators: Youtube-dl's legacy. This day in history: 2001, 2006, 2011, 2016, 2020 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Github pledges legal aid for interoperators (permalink) Last October, the RIAA launched a bizarre campaign of legal bullying against youtube-dl, a free/open library that lets people save Youtube (and other) videos for a variety of purposes, including critical analysis, offline viewing, archiving and remixing. https://pluralistic.net/2020/10/24/1201-v-dl-youtube/#1201 The RIAA attacked youtube-dl under Section 1201 of the Digital Millennium Copyright Act (DMCA1201) a 1998 law that indiscriminately bans helping people remove DRM, even if no copyright infringement …",
          "link": "https://pluralistic.net/2021/08/01/balance-of-forces/",
          "publishedOn": "2021-08-01T15:08:26.000Z",
          "wordCount": 1936,
          "title": "Pluralistic: 01 Aug 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2411",
          "author": "Cory Doctorow",
          "description": "Today's links Games Workshop declares war on its customers (again): Terms of service banning fan art launch alongside a new transmedia subscription service. This day in history: 2006, 2011, 2016, 2020 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Games Workshop declares war on its customers (again) (permalink) There's a difference between a con-artist and a grifter. A con-artist is just a gabby mugger, and when they vanish with your money, you know you've been robbed. A grifter, on the other hand, is someone who can work the law to declare your stuff to be their stuff, which makes you a lawless cur because your pockets are stuffed full of their money and merely handing it over is the least you can do to make up for your sin. IP trolls…",
          "link": "https://pluralistic.net/2021/07/30/space-marines/",
          "publishedOn": "2021-07-30T21:01:29.000Z",
          "wordCount": 3391,
          "title": "Pluralistic: 30 Jul 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2407",
          "author": "Cory Doctorow",
          "description": "Today's links Bankruptcy and elite impunity: The Sacklers offer billions of reasons to overthrow the system. Stories from Black women's customer service hell: The women who answer the phone when you call Disney, Airbnb, Carnival and others. Tracking you with accelerometer signatures: Yet another latent unique identifier with horrifying consequences. Unauthorized cups: RFID-equipped disposable cups deny water to homeless people. This day in history: 2001, 2006, 2011, 2016, 2020 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Bankruptcy and elite impunity (permalink) I've been writing about the Sackler crime-family for years, as a new generation turned the family's benzo empire into a opioid powerhouse, exceeding the Rockefeller family fo…",
          "link": "https://pluralistic.net/2021/07/29/impunity-corrodes/",
          "publishedOn": "2021-07-29T19:21:27.000Z",
          "wordCount": 4526,
          "title": "Pluralistic: 29 Jul 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2403",
          "author": "Cory Doctorow",
          "description": "Today's links What would a live concert album sound like with all the songs taken out?: Gavin Edwards' \"Having Fun On Stage With Everybody.\" The infosec apocalypse is nigh: Ed Snowden on the NSO's malware. This day in history: 2001, 2006, 2011, 2016, 2020 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading What would a live concert album sound like with all the songs taken out? (permalink) I've known Gavin Edwards for decades, and watched him produce a string of weird and imaginative and wholly successful projects, from his books of \"mondegreens\" (misheard lyrics) to his definitive biography of Mr Rogers: https://memex.craphound.com/2019/10/29/kindness-and-wonder-mr-rogers-biography-is-a-study-in-empathy-and-a-deep-genuine-love-for-children…",
          "link": "https://pluralistic.net/2021/07/27/gas-on-the-fire/",
          "publishedOn": "2021-07-27T15:32:22.000Z",
          "wordCount": 2238,
          "title": "Pluralistic: 27 Jul 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2398",
          "author": "Cory Doctorow",
          "description": "Today's links Charter schools are money laundries: \"The hidden world of charter schools operated for financial gain.\" Disney parks and aggregate demand management: My ongoing series on Medium, for an age of supply shocks. Oregon's carbon offsets go up in smoke: The Bootleg Fire is more evidence that markets can't solve the climate emergency. Surge pricing violates antitrust law: Even the weaksauce version pushed by the econ establishment. This day in history: 2011, 2016, 2020 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Charter schools are money laundries (permalink) Critiques of charter schools usually focus on poor quality education (disproportionately affecting racialized and poor people) and dangerous ideology (the movement is fu…",
          "link": "https://pluralistic.net/2021/07/26/aggregate-demand/",
          "publishedOn": "2021-07-26T19:09:08.000Z",
          "wordCount": 4046,
          "title": "Pluralistic: 26 Jul 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2395",
          "author": "Cory Doctorow",
          "description": "Today's links Interop and the Public Interest Internet: To fight network effects, reduce switching costs. This day in history: 2016, 2020 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Interop and the Public Interest Internet (permalink) When we talk about the internet's problems and solutions, we tend to focus on Big Tech, the monopolizers who dominate our digital lives. That's only natural. But there's another internet, one that deserves our attention: The Public Interest Internet. https://www.eff.org/issues/public-interest-internet The Public Interest Internet is a \"wider, more diverse, more generous world. Often run by volunteers, frequently without any institutional affiliation, sometimes tiny, often local, but free for everyone o…",
          "link": "https://pluralistic.net/2021/07/16/pidgin/",
          "publishedOn": "2021-07-16T17:51:15.000Z",
          "wordCount": 1662,
          "title": "Pluralistic: 16 Jul 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2392",
          "author": "Cory Doctorow",
          "description": "Today's links Facebook's alternative facts: If you don't like your transparency portal's data, shut it down. This day in history: 2001, 2016, 2020 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Facebook's alternative facts (permalink) Facebook acquired a company called Crowdtangle in 2016; it makes a social media analytics tool that the press has used to monitor subject-matter trends on Facebook, especially in the runup to the 2020 elections. Facebook just gutted Crowtangle. https://www.nytimes.com/2021/07/14/technology/facebook-data.html Crowdtangle had operated as a semiautonomous unit within Facebook, primarily used by media companies to track the social media performance of their stories. A turning point came when the NY Times's Ke…",
          "link": "https://pluralistic.net/2021/07/15/three-wise-zucks-in-a-trenchcoat/",
          "publishedOn": "2021-07-15T16:27:17.000Z",
          "wordCount": 2405,
          "title": "Pluralistic: 15 Jul 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2389",
          "author": "Cory Doctorow",
          "description": "Today's links Facebook employees stalk users: Moral hazard vs the ACCESS Act. This day in history: 2001, 2016, 2020 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Facebook employees stalk users (permalink) In Sheera Frenkel and Cecilia Kang's \"An Ugly Truth: Inside Facebook's Battle for Domination,\" the authors recount the company's long history of insider threats in which employees (mostly men) used the company's tools to stalk people (mostly women). https://www.harpercollins.com/products/an-ugly-truth-sheera-frenkelcecilia-kang The stalking targets included both strangers and intimate partners – for example, an engineer used FB's tools to locate his partner after she fled their shared vacation hotel room in order to \"confront her.\" h…",
          "link": "https://pluralistic.net/2021/07/14/who-watches-the-zuckmen/",
          "publishedOn": "2021-07-14T17:50:45.000Z",
          "wordCount": 2215,
          "title": "Pluralistic: 14 Jul 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2385",
          "author": "Cory Doctorow",
          "description": "Today's links Podcasting \"Tech Monopolies and the Insufficient Necessity of Interoperability\": Corporate rivalries vs public power. The Sacklers will get to keep billions: What's a little mass-murder between friends? This day in history: 2006, 2011, 2016, 2020 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Podcasting \"Tech Monopolies and the Insufficient Necessity of Interoperability\" (permalink) This week on my podcast, I read my latest Locus Magazine column, \"Tech Monopolies and the Insufficient Necessity of Interoperability.\" It presents a theory of change to get us to a world of aggressive, trans-industry, global trustbusting. https://locusmag.com/2021/07/cory-doctorow-tech-monopolies-and-the-insufficient-necessity-of-interoperabil…",
          "link": "https://pluralistic.net/2021/07/12/monopolist-solidarity/",
          "publishedOn": "2021-07-12T15:58:04.000Z",
          "wordCount": 2951,
          "title": "Pluralistic: 12 Jul 2021",
          "enclosure": {
            "url": "https://archive.org/download/Cory_Doctorow_Podcast_397/Cory_Doctorow_Podcast_397_-_Tech_Monopolies_and_the_Insufficient_Necessity_of_Interoperability.mp3",
            "length": "0",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://pluralistic.net/?p=2380",
          "author": "Cory Doctorow",
          "description": "Today's links Biden's Right to Repair will include electronics, too: Part of a broad antimonopoly agenda. This day in history: 2001, 2006, 2011, 2016, 2020 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Biden's Right to Repair will include electronics, too (permalink) The Biden administration teased a sweeping antimonopoly executive order last week, including a Right to Repair provision that was to be aimed at agricultural equipment – a direct assault on the corporate power of repair archnemesis John Deere. https://pluralistic.net/2021/07/07/instrumentalism/#r2r But it turns out that the executive order goes far beyond tractors and other agricultural equipment – it also applies to consumer electronics, including mobile phones, and this…",
          "link": "https://pluralistic.net/2021/07/10/unnixing-the-fix/",
          "publishedOn": "2021-07-10T17:08:31.000Z",
          "wordCount": 1882,
          "title": "Pluralistic: 10 Jul 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2371",
          "author": "Cory Doctorow",
          "description": "Today's links Indonesia's gig work tech resistance: Tuyul apps and the IT of the Road. Owning a sports-team is a plute's get-out-of-tax-free card: Here's what to do about it. This day in history: 2006, 2011, 2016, 2020 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Indonesia's gig work tech resistance (permalink) Gojek is a $10B Indonesian \"super app\" that combines \"Postmates, Apple Pay, Venmo, and Uber\" serviced by an army of ojol – drivers – who are subjected to all the high-handed algorithmic horrors that gig workers everywhere suffer through. https://www.vice.com/en/article/7kvpng/delivery-drivers-are-using-grey-market-apps-to-make-their-jobs-suck-less But Indonesian ojol aren't helpless before their apps; a legion of toolsmiths pr…",
          "link": "https://pluralistic.net/2021/07/08/tuyul-apps/",
          "publishedOn": "2021-07-08T14:53:31.000Z",
          "wordCount": 2852,
          "title": "Pluralistic: 08 Jul 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2368",
          "author": "Cory Doctorow",
          "description": "Today's links Technological self-determination: Competition is a means, not an end. Biden delivers Right to Repair via executive order: End of the line for John Deere's asshole lobbyists. Comic book store files comic-book lawsuit: Third Planet Comics has already won its case…in my heart. This day in history: 2006, 2011, 2016, 2020 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Technological self-determination (permalink) My latest Locus Magazine column is \"Tech Monopolies and the Insufficient Necessity of Interoperability,\" an essay about the goal of competition and its handmaiden, interoperability, namely, \"technological self-determination.\" https://locusmag.com/2021/07/cory-doctorow-tech-monopolies-and-the-insufficient-necessity-of-i…",
          "link": "https://pluralistic.net/2021/07/07/instrumentalism/",
          "publishedOn": "2021-07-07T13:53:12.000Z",
          "wordCount": 2454,
          "title": "Pluralistic: 07 Jul 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2365",
          "author": "Cory Doctorow",
          "description": "Today's links Quantifying copyright reversion: The first-of-its-kind dataset of creators who took back their rights. This day in history: 2001, 2006, 2011, 2016, 2020 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Quantifying copyright reversion (permalink) At its outset, American copyright provided for 14 years of exclusivity, renewable for another 14 years by the author, but – crucially – not by the publisher. This was a shrewd move by the US Framers, because it meant the publisher had to convince the author to file paperwork. Most authors have very little bargaining leverage at the outset of their publishing deals, and even when the author's prior accomplishments afford them some bargaining power, a new book is, by definition, an un…",
          "link": "https://pluralistic.net/2021/07/06/backsies/",
          "publishedOn": "2021-07-06T14:52:36.000Z",
          "wordCount": 1879,
          "title": "Pluralistic: 06 Jul 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2359",
          "author": "Cory Doctorow",
          "description": "Today's links Conspiracy fantasy: The political significance and personal appeal of conspiratorialism. Podcasting \"Self Publishing\": My column on monopolism, publishing, and the fortunes of authors. This day in history: 2001, 2011, 2016, 2020 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Conspiracy fantasy (permalink) When we talk about conspiratorialism, we tend to focus (naturally) on the content of the conspiracy. Not only are those stories entertainingly outlandish – they're also the point of contact between conspiracists and the world. If your mom is shouting about \"Hollywood pedos,\" it's natural that you'll end up discussing the relationship of this belief to observable reality. But while the content of conspiratorial beliefs ge…",
          "link": "https://pluralistic.net/2021/07/05/ideomotor-response/",
          "publishedOn": "2021-07-05T16:17:04.000Z",
          "wordCount": 3997,
          "title": "Pluralistic: 05 Jul 2021",
          "enclosure": {
            "url": "https://archive.org/download/Cory_Doctorow_Podcast_396/Cory_Doctorow_Podcast_396_-_Self_Publishing.mp3",
            "length": "0",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://pluralistic.net/?p=2355",
          "author": "Cory Doctorow",
          "description": "Today's links The future is symmetrical: Broadband netizens vs asymmetrical mouse-potatoes. This day in history: 2006, 2016, 2020 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading The future is symmetrical (permalink) When Mitch Kapor articulated the principle that \"architecture is politics\" at the founding of EFF, he was charging technologists with the moral duty to contemplate the kinds of social interactions their technological decisions would facilitate – and prohibit. At question was nothing less than the character of the networked society. Would the vast, pluripotent, general purpose, interconnected network serve as a glorified video-on-demand service, the world's greatest pornography distribution system, a giant high-tech mall? Or …",
          "link": "https://pluralistic.net/2021/07/03/beautiful-symmetry/",
          "publishedOn": "2021-07-03T18:33:44.000Z",
          "wordCount": 2335,
          "title": "Pluralistic: 03 Jul 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2352",
          "author": "Cory Doctorow",
          "description": "Today's links Nominate for the EFF Pioneer Awards: Who will win this year's Barlow? Biden admin orders an end to surprise billing: But without legal reform, the next president could reverse it. I'm Sorry I Haven't a Clue is back: The funniest thing on the radio, anywhere in the world, now in its 75th series. This day in history: 2006, 2011, 2016, 2020 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Nominate for the EFF Pioneer Awards (permalink) Nominations are now open for the EFF's annual Pioneer Awards, AKA the Barlow Award, now it its 30th year! https://www.eff.org/nominations-open-2021-barlows The Barlow recognizes people, projects and groups who \"have contributed substantially to the health, growth, accessibility, or freedom of co…",
          "link": "https://pluralistic.net/2021/07/02/spoil-the-surprise/",
          "publishedOn": "2021-07-02T15:56:37.000Z",
          "wordCount": 2444,
          "title": "Pluralistic: 02 Jul 2021"
        }
      ]
    },
    {
      "title": "The Candybox Blog",
      "feedUrl": "http://www.nathalielawhead.com/candybox/feed",
      "siteUrl": "http://www.nathalielawhead.com/candybox",
      "articles": [
        {
          "id": "http://www.nathalielawhead.com/candybox/?p=5097",
          "author": "alienmelon",
          "description": "Over this weekend I finally launched the really big Electric Zine Maker update that I have been working on for the last few months. This is a notable update featuring a UI overhaul (it’s less intense now!), new templates, and a lot of fixes. I spent a lot of time making the UI friendlier. I couldn’t help myself so pop-up windows are cute pixel art. There’s animation to many elements, but I think it’s much more refined now. The main menu UI was always very “placeholder”, and many decisions in it had been for the sake of compromising for the...",
          "link": "http://www.nathalielawhead.com/candybox/a-retrospective-on-the-electric-zine-maker-making-tools-sharing-the-numbers-and-more-after-launching-the-really-big-update",
          "publishedOn": "2021-08-30T22:57:29.000Z",
          "wordCount": 4195,
          "title": "A retrospective on the Electric Zine Maker, making tools, sharing the $ numbers, and more (after launching the really big update…)"
        },
        {
          "id": "http://www.nathalielawhead.com/candybox/?p=5093",
          "author": "alienmelon",
          "description": "Here’s a small but meaningful announcement! Download link >> https://pizzapranks.itch.io/indiepocalypse-x-kus Over the last few months I was secretly working on a collaboration project for the “Indiepocalypse x kuš” mashup. The project teamed up a group of random indie devs (provided by Indiepocalypse) with random comic artists (provided by kuš). The results are stellar! Even thecatamites worked on a game for it. I’m honored to be part of this! The person I was teamed up with is Gvidas Pakarklis, who is an amazing illustrator and artist. You can see more of his work on Instagram. His work is very symbolic and...",
          "link": "http://www.nathalielawhead.com/candybox/indiepocalypse-x-kus-the-secret-collaboration-i-was-working-on-is-out-now",
          "publishedOn": "2021-08-17T20:26:47.000Z",
          "wordCount": 1267,
          "title": "Indiepocalypse x kuš! (The secret collaboration I was working on is out now!!)"
        },
        {
          "id": "http://www.nathalielawhead.com/candybox/?p=5080",
          "author": "alienmelon",
          "description": "It has been a hot minute since I wrote about tools. I’ve got a ton of emails to answer, too much to do, and a lot of work on the Electric Zine Maker that needs doing but… I’ll just make a moment to finally talk about tools and digital art again! These links aren’t going to share themselves. Before I begin, here is some recommended reading: Parasocial Nintendo Complex: 10 Years of Game Dev by Melos Han-Tani My Procreate Curl Brushes Are HERE!! I made over 50+ different coil, curl, kinky, and wavy texture brushes! I also made more outline...",
          "link": "http://www.nathalielawhead.com/candybox/tiny-tools-and-the-ephemeral-nature-of-digital-art",
          "publishedOn": "2021-08-09T23:00:40.000Z",
          "wordCount": 3380,
          "title": "Tiny tools and the ephemeral nature of digital art…"
        },
        {
          "id": "http://www.nathalielawhead.com/candybox/?p=5072",
          "author": "alienmelon",
          "description": "I just finished having a really long conversation with another friend that works in games and it inspired me to write this post. It’s given me a lot to think about. I’m still processing my experiences… As I write this, the game space is under another metoo “moment”. More of these horrible, but all too normal stories, this time coming out of Blizzard. I won’t be linking to any of these because I don’t have the stomach for it. We’ve had these “moments” come and go now for the last few years. Each time reminding this space of the abuse...",
          "link": "http://www.nathalielawhead.com/candybox/the-machine-that-eats-people",
          "publishedOn": "2021-07-24T00:11:20.000Z",
          "wordCount": 3586,
          "title": "The Machine That Eats People"
        }
      ]
    }
  ],
  "cliVersion": "1.10.2"
}