{
  "sources": [
    {
      "title": "Christian Heilmann",
      "feedUrl": "https://christianheilmann.com/feed/",
      "siteUrl": "https://christianheilmann.com",
      "articles": [
        {
          "id": "https://christianheilmann.com/?p=7124",
          "author": "Chris Heilmann",
          "description": "I just encountered a sneaky thing I had not seen, although it probably worked in 1999 already. A web site was showing a different title on the tab, depending on it being active or not. The whole trick is to use the blur and focus event handlers on the window to change the title. window.onblur […]",
          "link": "https://christianheilmann.com/2022/02/10/showing-different-titles-depending-if-the-tab-is-active-or-not/",
          "publishedOn": "2022-02-10T18:49:56.000Z",
          "wordCount": 355,
          "title": "Showing different titles depending if the tab is active or not"
        },
        {
          "id": "https://christianheilmann.com/?p=7114",
          "author": "Chris Heilmann",
          "description": "I’m part of a few organisations on GitHub and had one email address for notifications. This annoyed me as I didn’t want company notifications to my personal account as I couldn’t answer these. As it turns out, you can set up several email addresses in your GitHub account. In settings, go to Access > Emails […]",
          "link": "https://christianheilmann.com/2022/02/01/sending-email-notifications-from-github-organisations-to-different-emails/",
          "publishedOn": "2022-01-31T23:37:43.000Z",
          "wordCount": 253,
          "title": "Sending email notifications from GitHub organisations to different emails"
        },
        {
          "id": "https://christianheilmann.com/?p=7095",
          "author": "Chris Heilmann",
          "description": "When I start a new project these days I create the following launch.json file and put in in a .vscode folder on the the root of my project. This turns Visual Studio Code into an environment that gives me everything I need to build a web product without ever leaving it. If you want to […]",
          "link": "https://christianheilmann.com/2022/01/26/a-launch-json-setting-for-end-to-end-web-development/",
          "publishedOn": "2022-01-26T18:10:09.000Z",
          "wordCount": 851,
          "title": "A launch.json setting for end-to-end web development"
        },
        {
          "id": "https://christianheilmann.com/?p=7086",
          "author": "Chris Heilmann",
          "description": "It’s not pretty. This isn’t a dig at Skoop, he was just first on my timeline with a result when I did some accessibility testing. Screenreaders read out the squares as “black large square”, “green square” and “yellow square”. As a saving grace, they cleverly do group them, so four yellow squares are announces as […]",
          "link": "https://christianheilmann.com/2022/01/19/ever-wondered-what-a-wordle-social-media-update-sounds-to-screenreader-users/",
          "publishedOn": "2022-01-19T21:44:07.000Z",
          "wordCount": 275,
          "title": "Ever wondered what a Wordle social media update sounds to screenreader users?",
          "enclosure": {
            "url": "https://christianheilmann.com/wp-content/uploads/2022/01/wordle-screenreader.mp4",
            "length": "1342009",
            "type": "video/mp4"
          }
        },
        {
          "id": "https://christianheilmann.com/?p=7082",
          "author": "Chris Heilmann",
          "description": "Yesterday I was a guest on the JavaScript Master Podcast by Dariusz Kalbarczyk and we talked a bit more than an hour about my job as a Developer Tools PM, what annoys me the most about the toolintg situation and how the community can help. You can listen to the podcast on anchor.fm or Spotify […]",
          "link": "https://christianheilmann.com/2022/01/18/podcast-recording-development-tools-in-the-experts-eye-with-chris-heilmann/",
          "publishedOn": "2022-01-18T13:10:39.000Z",
          "wordCount": 646,
          "title": "Podcast recording: Development tools in the expert’s eye with Chris Heilmann"
        },
        {
          "id": "https://christianheilmann.com/?p=7077",
          "author": "Chris Heilmann",
          "description": "I just released my dice simulator app and in doing so learned about a few things about turning a GitHub Page into a PWA. To make this easier for subsequent projects, I put together a bare-bones template to turn any GitHub page into a PWA. Nothing in there is sophisticated and all it does is […]",
          "link": "https://christianheilmann.com/2022/01/13/turning-a-github-page-into-a-progressive-web-app/",
          "publishedOn": "2022-01-13T10:06:14.000Z",
          "wordCount": 1019,
          "title": "Turning a GitHub page into a Progressive Web App"
        },
        {
          "id": "https://christianheilmann.com/?p=7071",
          "author": "Chris Heilmann",
          "description": "A few days ago I was on vacation in a place that had terrible mobile connectivity and whilst it provided WiFi, nothing worked. I even brought my own cables and travel router, but to no avail. This was not only a good opportunity for some “digital detox”, but it also showed me once again that […]",
          "link": "https://christianheilmann.com/2022/01/11/offline-no-dice/",
          "publishedOn": "2022-01-11T21:30:12.000Z",
          "wordCount": 788,
          "title": "Offline? No dice!"
        },
        {
          "id": "https://christianheilmann.com/?p=7063",
          "author": "Chris Heilmann",
          "description": "After 25 years of working for, on and with the web, I am looking at the current state of it and I don’t like it. There is still a lot of beautiful, creative and amazing work out there, but on the whole, we lost an amazing opportunity. In its place we have a consumption machine […]",
          "link": "https://christianheilmann.com/2021/12/20/the-web-starts-on-page-four/",
          "publishedOn": "2021-12-20T18:06:05.000Z",
          "wordCount": 1726,
          "title": "The web starts on page four"
        }
      ]
    },
    {
      "title": "Hundred Rabbits",
      "feedUrl": "https://100r.co/links/rss.xml",
      "siteUrl": "https://100r.co",
      "articles": [
        {
          "id": "log.html#jan2022",
          "author": "Rekka Bellum",
          "description": "Hey everyone! This is the list of all the changes we've done to our projects and apps during the month of January. We'll also be reporting in our on position in the world, and on our future plans.\nSummary Of Changes\nLeft, re-wrote documentation, redesigned the UX for save-as/open-as.\nOrca, re-wrote documentation, and added the operators manual on launch.\nThousand Rooms, released 3 new languages: Polish, Hungarian and Serbian. Now offering book as an ePUB.\nUxn, re-wrote entire documentation, and started a project devlog.\nNasu, improved zoom tool, it is now possible to move between tiles(Masto) while zoomed.\nYufo, released a small game for the Virtual Pet Jam.\n100r, added new page: cast-iron cookware, and updated medical.\nNews\nOn January 28th Uxn turned 1 year old! We'd like to thank everyone who has contributed code, ideas, time and laughs to help this project grow into what it is now. It was a wonderful year for smol ordinators. See an image that Rekka made for uxn's birthday.\nWe finally released versions of the Uxn emulator for all major systems(Linux, OS X and Windows), with the option of a version bundled with a few starter roms. We simplified the guide too, to make it easier to install and use.\nOur lion's mane mushroom grew another full head, we harvested it and made some mushroom pakoras.\nIn other news, Devine was interviewed on Anonradio, listen to it here. Also, Compudanzas released an Introduction to Uxn Programming book, with a foreword by Devine.\nPino book club\nWe're reading The Complete Cosmicomics by Italo Calvino, and The Dawn of Everything: A New History of Humanity by David Graeber.\nContinue Reading",
          "link": "https://100r.co/site/log.html#jan2022",
          "publishedOn": "2022-01-31T00:00:00.000Z",
          "wordCount": 6482,
          "title": "Summary of changes for January"
        },
        {
          "id": "log.html#dec2021",
          "author": "Rekka Bellum",
          "description": "Hey everyone! This is the list of all the changes we've done to our projects and apps during the month of December. We'll also be reporting in our on position in the world, and on our future plans.\nSummary Of Changes\nGrimgrains, published a tofu from soy flour recipe, and reduced the amount of ingredients appearing on the main page so it loads faster.\nLeft, created inline image support, and implemented a search feature(Birdsite) inspired by the Canon Cat(1987)'s LEAP™ key.\nCat Clock, released our very own cat clock.\nTurye, released a font editor.\nTGA parser, released a tool to make it easier to bring images into the Uxn ecosystem.\nWunderland Rabbits, released a new image.\nNews\nIt is snowing, and we are cocooning. Our little woodstove is working hard. This month, we finally decided to release a paperback version of Busy Doing Nothing.\nIn our last update log, we mentioned that we were trying to grow Lion's Mane mushroom, and we are happy to report that it was a success! It grew beautifully. Rek was so excited about the mushroom that they decided to draw some this month, this series focuses on varieties that grow on Vancouver Island.\nIn other news, we had an interview with the founder of Sourcehut, read it here. Also, our good friend Alderwick make us a very cool gift(YouTube).\nPino book club\nWe're reading Fantômes: Issue 1, with work by 18 talented artists, put together by Lizbeth. It is a eerie, and gorgeous zine, we strongly recommend the Mike Wolf version.\nPino's location: 48° 42.230'N, 123° 36.900'W\nContinue Reading",
          "link": "https://100r.co/site/log.html#dec2021",
          "publishedOn": "2021-12-31T00:00:00.000Z",
          "wordCount": 6478,
          "title": "Summary of changes for December"
        }
      ]
    },
    {
      "title": "Blog on SaraSoueidan.com",
      "feedUrl": "https://www.sarasoueidan.com/blog/index.xml",
      "siteUrl": "https://sarasoueidan.com/blog/",
      "articles": []
    },
    {
      "title": "there.oughta.be/",
      "feedUrl": "https://there.oughta.be/feed.xml",
      "siteUrl": "https://there.oughta.be/",
      "articles": [
        {
          "id": "https://there.oughta.be/a/live-q-and-a/about-the-wifi-game-boy-cartridge",
          "author": null,
          "description": "There will be a Live Q&amp;A session about the Game Boy WiFi cartridge on Friday 9pm (CET). Ask anything! Click the image to see the video on youtube.com. I have never done this before and am quite curious on how it will turn out and how many will attend. See you on Friday!",
          "link": "https://there.oughta.be/a/live-q-and-a/about-the-wifi-game-boy-cartridge",
          "publishedOn": "2022-01-27T23:00:00.000Z",
          "wordCount": 101,
          "title": "There oughta be a Live Q&amp;A about the WiFi Game Boy Cartridge."
        },
        {
          "id": "https://there.oughta.be/gta5-for-the-game-boy",
          "author": null,
          "description": "When I presented my WiFi Game Boy cartridge a few weeks ago, I only had very few simple text-based demos. This post and especially the accompanying video now deliver more. In fact, I might have gone a bit too far, as I managed to stream full resolution video and even play games via WiFi. But see for yourself: Click the image to see the video on youtube.com. So, as usual, you have two alternatives to start here: Watch the video or read the article. If you are just curious and want to see what I did, definitely check out the video. If you want to understand exactly how it works and if you want to reproduce it or find tricks for your own projects, go for the article and the linked code. In any case, if you have not seen the previous article and/or video on the cartridge itself, you should start there.",
          "link": "https://there.oughta.be/gta5-for-the-game-boy",
          "publishedOn": "2022-01-12T23:00:00.000Z",
          "wordCount": 3347,
          "title": "There oughta be GTA5 for the Game Boy."
        }
      ]
    },
    {
      "title": "Grumpy Gamer",
      "feedUrl": "https://grumpygamer.com/rss",
      "siteUrl": "https://grumpygamer.com",
      "articles": [
        {
          "id": "https://grumpygamer.com/the_future",
          "author": null,
          "description": "Well, it's 2022 and everything is turning out exactly as I predicted back when I was 7. Self-driving cars, space stations, the internet.  Nailed it.\nFavorite TV show of 2021 was Only Murders in the Building.  \nFavorite game of 2021 was Loop Heroes. \nFavorite book of 2021 was Einstein's Fridge.\nFavorite rediscovered joy of 2021 was reading physical books.\nFavorite movie of 2021 was Dune.\nFavorite time waster of 2021 was watching physics videos on YouTube.\nLeast favorite movie of 2021 was anything with f**king superheroes.\nFavorite pandemic of 2021 was Covid-19 (three years running).\nSee you in an exciting 2022 where everyone will be nice and respectful and personal agendas are put aside for the greater good and we all come together and save the planet. \nEither that or a horrific dystopian post-apocalyptic world where we hunt each other for food.\n2022 could go either way.",
          "link": "https://grumpygamer.com/the_future",
          "publishedOn": "2022-01-01T02:01:21.000Z",
          "wordCount": 384,
          "title": "2021"
        },
        {
          "id": "https://grumpygamer.com/lego8",
          "author": null,
          "description": "That didn't take long to fix and rebuild. I don't know what is taking the city of Rome so long.\n\nStart to finish, it took just over a year. I blame Limited Run Games.",
          "link": "https://grumpygamer.com/lego8",
          "publishedOn": "2021-12-27T18:54:48.000Z",
          "wordCount": 108,
          "title": "Lego Report 8"
        },
        {
          "id": "https://grumpygamer.com/lego7",
          "author": null,
          "description": "Placing the last piece.\n\nAnd then disaster stuck while moving it.\n\nMost of the debris is still assembled large chucks, so it shouldn't take long to fix.  I'm sure this happened to the real coliseum.",
          "link": "https://grumpygamer.com/lego7",
          "publishedOn": "2021-12-27T02:09:08.000Z",
          "wordCount": 189,
          "title": "Lego Report 7"
        },
        {
          "id": "https://grumpygamer.com/12_days_of_crunch_time_yet_again",
          "author": null,
          "description": "Holiday repost!\nClayton and I did this back in Dec of 2004.  Interesting how much hasn't changed. I'd have more \"male\" spouses now, something about loot crates and IAP, kissing up to steamers, and maybe change the last verse to be more \"indie\", but its shockingly accurate years later.\nThe Twelve Days of Crunch Time\nA poem by Gilbert and Kauzlaric\nOn the twelfth day of crunch time,\nMy project gave to me...\n\nTwelve cents in royalties,\n\nEleven kiss-ass previews,\n\nTen nerdy testers,\n\nNine patent lawsuits,\n\nEight unplanned for features,\n\nSeven frames a second,\n\nSix angry spouses,\n\nFive focus groups!\n\nFour unstable hacks,\n\nThree days without sleep,\n\nTwo surly artists,\n\nand a crappy publishing deal.",
          "link": "https://grumpygamer.com/12_days_of_crunch_time_yet_again",
          "publishedOn": "2021-12-25T17:56:05.000Z",
          "wordCount": 207,
          "title": "The Twelve Days of Crunch Time Again"
        },
        {
          "id": "https://grumpygamer.com/lego6",
          "author": null,
          "description": "We should be done in time for the upcoming gladiator '22 season.  Tickets are still available. I hear Ferocianus Maximus is going to do well this year.",
          "link": "https://grumpygamer.com/lego6",
          "publishedOn": "2021-12-22T22:03:50.000Z",
          "wordCount": 95,
          "title": "Lego Report 6"
        }
      ]
    },
    {
      "title": "Emily Short's Interactive Storytelling",
      "feedUrl": "https://emshort.blog/feed/",
      "siteUrl": "https://emshort.blog",
      "articles": [
        {
          "id": "http://emshort.blog/?p=42583",
          "author": "Emily Short",
          "description": "Events February 5 is the next meeting of the SF Bay IF Meetup. February 20 is the next meeting of the Seattle IF Meetup, and will be held via Discord, so people are welcome to attend remotely. It will feature a guest appearance from Daniel Ravipinto, one of the authors of the classic parser IF … Continue reading \"End of January Link Assortment\"",
          "link": "https://emshort.blog/2022/01/31/end-of-january-link-assortment-6/",
          "publishedOn": "2022-01-31T23:59:00.000Z",
          "wordCount": 1678,
          "title": "End of January Link Assortment"
        },
        {
          "id": "http://emshort.blog/?p=42577",
          "author": "Emily Short",
          "description": "Events Feb 5 is the next meeting of the SF Bay IF Meetup. If you wish to enter Spring Thing this year with a new work of interactive fiction, you have until March 1 to submit your intent to enter, and March 31 to complete your game. Releases chiaroscuro is a short, low-fantasy IF novella … Continue reading \"Mid-January Link Assortment\"",
          "link": "https://emshort.blog/2022/01/15/mid-january-link-assortment-6/",
          "publishedOn": "2022-01-15T17:30:00.000Z",
          "wordCount": 1434,
          "title": "Mid-January Link Assortment"
        },
        {
          "id": "http://emshort.blog/?p=42242",
          "author": "Emily Short",
          "description": "Events Running for a week starting January 1 on itch is the Historically Accurate Game Jam. This isn’t specifically an IF competition, and games of all types are welcome, as long as they’re written in a week and address the chosen time period or event of the jam. If you’ve had a craving to contribute … Continue reading \"End of December Link Assortment\"",
          "link": "https://emshort.blog/2021/12/31/end-of-december-link-assortment-6/",
          "publishedOn": "2021-12-31T17:30:00.000Z",
          "wordCount": 1805,
          "title": "End of December Link Assortment"
        }
      ]
    },
    {
      "title": "xkcd.com",
      "feedUrl": "https://xkcd.com/atom.xml",
      "siteUrl": "https://xkcd.com/",
      "articles": [
        {
          "id": "https://xkcd.com/2580/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/rest_and_fluids.png\" title=\"Remember not to take it easy. Put a hot washcloth on your forehead, remain standing, and breathe dry air while taking lots of histamines. You need to give your body a chance to get sick again.\" alt=\"Remember not to take it easy. Put a hot washcloth on your forehead, remain standing, and breathe dry air while taking lots of histamines. You need to give your body a chance to get sick again.\" />",
          "link": "https://xkcd.com/2580/",
          "publishedOn": "2022-02-11T00:00:00.000Z",
          "wordCount": 199,
          "title": "Rest and Fluids"
        },
        {
          "id": "https://xkcd.com/2579/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/tractor_beam.png\" title=\"Did you base the saucer shape on pop culture depictions of aliens, or was that stuff based on your ships? Does the rotational symmetry help with ... hey, where are you going?\" alt=\"Did you base the saucer shape on pop culture depictions of aliens, or was that stuff based on your ships? Does the rotational symmetry help with ... hey, where are you going?\" />",
          "link": "https://xkcd.com/2579/",
          "publishedOn": "2022-02-09T00:00:00.000Z",
          "wordCount": 197,
          "title": "Tractor Beam"
        },
        {
          "id": "https://xkcd.com/2578/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/sword_pull.png\" title=\"Merlin really shouldn't leave his dirt bike lying around.\" alt=\"Merlin really shouldn't leave his dirt bike lying around.\" />",
          "link": "https://xkcd.com/2578/",
          "publishedOn": "2022-02-07T00:00:00.000Z",
          "wordCount": 197,
          "title": "Sword Pull"
        },
        {
          "id": "https://xkcd.com/2577/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/sea_chase.png\" title=\"There are two rules on this ship: Never gaze back into the projection abyss, and never touch the red button labeled DYMAXION.\" alt=\"There are two rules on this ship: Never gaze back into the projection abyss, and never touch the red button labeled DYMAXION.\" />",
          "link": "https://xkcd.com/2577/",
          "publishedOn": "2022-02-04T00:00:00.000Z",
          "wordCount": 197,
          "title": "Sea Chase"
        },
        {
          "id": "https://xkcd.com/2576/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/control_group.png\" title=\"Placeble 228 x/6\n⬜⬜⬜⬜⬜\n⬜⬜⬜⬜⬜\n⬜⬜⬜⬜⬜\n⬜⬜⬜⬜⬜\n⬜⬜⬜⬜⬜\n⬜⬜⬜⬜⬜\" alt=\"Placeble 228 x/6\n⬜⬜⬜⬜⬜\n⬜⬜⬜⬜⬜\n⬜⬜⬜⬜⬜\n⬜⬜⬜⬜⬜\n⬜⬜⬜⬜⬜\n⬜⬜⬜⬜⬜\" />",
          "link": "https://xkcd.com/2576/",
          "publishedOn": "2022-02-02T00:00:00.000Z",
          "wordCount": 197,
          "title": "Control Group"
        },
        {
          "id": "https://xkcd.com/2575/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/what_if_2.png\" title=\"CLARIFICATION: By 9/13, I mean September 13th, not the 9th day of Jancember, the cursed 13th month that exists between December and January in the transdimensional temporal plane.\" alt=\"CLARIFICATION: By 9/13, I mean September 13th, not the 9th day of Jancember, the cursed 13th month that exists between December and January in the transdimensional temporal plane.\" />",
          "link": "https://xkcd.com/2575/",
          "publishedOn": "2022-01-31T00:00:00.000Z",
          "wordCount": 199,
          "title": "What If? 2"
        },
        {
          "id": "https://xkcd.com/2574/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/autoresponder.png\" title=\"I ADMIRE HOW YOU SET BOUNDARIES AND I HOPE YOUR COLLEAGUES RESPECT THEM! PLEASE SPARE MY LIFE!\" alt=\"I ADMIRE HOW YOU SET BOUNDARIES AND I HOPE YOUR COLLEAGUES RESPECT THEM! PLEASE SPARE MY LIFE!\" />",
          "link": "https://xkcd.com/2574/",
          "publishedOn": "2022-01-28T00:00:00.000Z",
          "wordCount": 189,
          "title": "Autoresponder"
        },
        {
          "id": "https://xkcd.com/2573/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/alien_mission.png\" title=\"Fine, we can go search the Himalayas for the Yeti ONE more time, but keep a safe altitude over the Pacific and PLEASE watch where you're going. We can't afford another Amelia Earhart incident.\" alt=\"Fine, we can go search the Himalayas for the Yeti ONE more time, but keep a safe altitude over the Pacific and PLEASE watch where you're going. We can't afford another Amelia Earhart incident.\" />",
          "link": "https://xkcd.com/2573/",
          "publishedOn": "2022-01-26T00:00:00.000Z",
          "wordCount": 192,
          "title": "Alien Mission"
        },
        {
          "id": "https://xkcd.com/2572/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/alien_observers.png\" title=\"ALERT: Human 910-25J-1Q38 has created a Youtube channel. Increase erratic jerkiness of flying by 30% until safely out of range.\" alt=\"ALERT: Human 910-25J-1Q38 has created a Youtube channel. Increase erratic jerkiness of flying by 30% until safely out of range.\" />",
          "link": "https://xkcd.com/2572/",
          "publishedOn": "2022-01-24T00:00:00.000Z",
          "wordCount": 192,
          "title": "Alien Observers"
        },
        {
          "id": "https://xkcd.com/2571/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/hydraulic_analogy.png\" title=\"Current (water) running through the water (wires) causes it to boil, increasing the pressure (voltage), but resisting (impeding) the flow of hydroelectricity (water currents). This is the basis for Ohm's law.\" alt=\"Current (water) running through the water (wires) causes it to boil, increasing the pressure (voltage), but resisting (impeding) the flow of hydroelectricity (water currents). This is the basis for Ohm's law.\" />",
          "link": "https://xkcd.com/2571/",
          "publishedOn": "2022-01-21T00:00:00.000Z",
          "wordCount": 192,
          "title": "Hydraulic Analogy"
        },
        {
          "id": "https://xkcd.com/2570/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/captain_picard_tea_order.png\" title=\"We can ask the Earl for his order once he's fully extruded from the dispenser.\" alt=\"We can ask the Earl for his order once he's fully extruded from the dispenser.\" />",
          "link": "https://xkcd.com/2570/",
          "publishedOn": "2022-01-19T00:00:00.000Z",
          "wordCount": 196,
          "title": "Captain Picard Tea Order"
        },
        {
          "id": "https://xkcd.com/2569/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/hypothesis_generation.png\" title=\"Frazzled scientists are requesting that everyone please stop generating hypotheses for a little bit while they work through the backlog.\" alt=\"Frazzled scientists are requesting that everyone please stop generating hypotheses for a little bit while they work through the backlog.\" />",
          "link": "https://xkcd.com/2569/",
          "publishedOn": "2022-01-17T00:00:00.000Z",
          "wordCount": 192,
          "title": "Hypothesis Generation"
        },
        {
          "id": "https://xkcd.com/2568/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/spinthariscope.png\" title=\"Other high scorers are melt-in-your-hand aluminum-destroying gallium and tritium-powered glowsticks. Lawn darts are toward the other end.\" alt=\"Other high scorers are melt-in-your-hand aluminum-destroying gallium and tritium-powered glowsticks. Lawn darts are toward the other end.\" />",
          "link": "https://xkcd.com/2568/",
          "publishedOn": "2022-01-14T00:00:00.000Z",
          "wordCount": 190,
          "title": "Spinthariscope"
        },
        {
          "id": "https://xkcd.com/2567/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/language_development.png\" title=\"The worst is the Terrible Twos, when they're always throwing things and shrieking, &quot;forsooth, to bed thou shalt not take me, cur!&quot;\" alt=\"The worst is the Terrible Twos, when they're always throwing things and shrieking, &quot;forsooth, to bed thou shalt not take me, cur!&quot;\" />",
          "link": "https://xkcd.com/2567/",
          "publishedOn": "2022-01-12T00:00:00.000Z",
          "wordCount": 192,
          "title": "Language Development"
        },
        {
          "id": "https://xkcd.com/2566/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/decorative_constants.png\" title=\"Arguably, the '1/2' in the drag equation is purely decorative, since drag coefficients are already unitless and could just as easily be half as big. Some derivations give more justification for the extra 1/2 than others, but one textbook just calls it 'a traditional tribute to Euler and Bernoulli.'\" alt=\"Arguably, the '1/2' in the drag equation is purely decorative, since drag coefficients are already unitless and could just as easily be half as big. Some derivations give more justification for the extra 1/2 than others, but one textbook just calls it 'a traditional tribute to Euler and Bernoulli.'\" />",
          "link": "https://xkcd.com/2566/",
          "publishedOn": "2022-01-10T00:00:00.000Z",
          "wordCount": 192,
          "title": "Decorative Constants"
        },
        {
          "id": "https://xkcd.com/2565/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/latency.png\" title=\"Each SCAPDFATIAT point increases the chance that the process will involve the phrase 'by the next business day.'\" alt=\"Each SCAPDFATIAT point increases the chance that the process will involve the phrase 'by the next business day.'\" />",
          "link": "https://xkcd.com/2565/",
          "publishedOn": "2022-01-07T00:00:00.000Z",
          "wordCount": 190,
          "title": "Latency"
        },
        {
          "id": "https://xkcd.com/2564/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/sunshield.png\" title=\"RIP the surface of Mars\" alt=\"RIP the surface of Mars\" />",
          "link": "https://xkcd.com/2564/",
          "publishedOn": "2022-01-05T00:00:00.000Z",
          "wordCount": 201,
          "title": "Sunshield"
        },
        {
          "id": "https://xkcd.com/2563/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/throat_and_nasal_passages.png\" title=\"I always felt like what the 'you are now aware of your tongue' thing neeeded in order to be truly enjoyable was an element of mortal peril.\" alt=\"I always felt like what the 'you are now aware of your tongue' thing neeeded in order to be truly enjoyable was an element of mortal peril.\" />",
          "link": "https://xkcd.com/2563/",
          "publishedOn": "2022-01-03T00:00:00.000Z",
          "wordCount": 207,
          "title": "Throat and Nasal Passages"
        },
        {
          "id": "https://xkcd.com/2562/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/formatting_meeting.png\" title=\"Neither group uses iso 8601 because the big-endian enthusiasts were all at the meeting 20 years ago.\" alt=\"Neither group uses iso 8601 because the big-endian enthusiasts were all at the meeting 20 years ago.\" />",
          "link": "https://xkcd.com/2562/",
          "publishedOn": "2021-12-31T00:00:00.000Z",
          "wordCount": 203,
          "title": "Formatting Meeting"
        },
        {
          "id": "https://xkcd.com/2561/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/moonfall.png\" title=\"Novel ideas and cool explosions are both good, but what I really want from a movie is novel ideas ABOUT cool explosions.\" alt=\"Novel ideas and cool explosions are both good, but what I really want from a movie is novel ideas ABOUT cool explosions.\" />",
          "link": "https://xkcd.com/2561/",
          "publishedOn": "2021-12-29T00:00:00.000Z",
          "wordCount": 201,
          "title": "Moonfall"
        },
        {
          "id": "https://xkcd.com/2560/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/confounding_variables.png\" title=\"You can find a perfect correlation if you just control for the residual.\" alt=\"You can find a perfect correlation if you just control for the residual.\" />",
          "link": "https://xkcd.com/2560/",
          "publishedOn": "2021-12-27T00:00:00.000Z",
          "wordCount": 203,
          "title": "Confounding Variables"
        },
        {
          "id": "https://xkcd.com/2559/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/december_25th_launch.png\" title=\"Update: Santa has been destroyed by the range safety officer.\" alt=\"Update: Santa has been destroyed by the range safety officer.\" />",
          "link": "https://xkcd.com/2559/",
          "publishedOn": "2021-12-24T00:00:00.000Z",
          "wordCount": 205,
          "title": "December 25th Launch"
        },
        {
          "id": "https://xkcd.com/2558/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/rapid_test_results.png\" title=\"A solid red area with two white lines means that you have been infected with the anti-coronavirus, COVID+19, which will cure anyone you have close contact with.\" alt=\"A solid red area with two white lines means that you have been infected with the anti-coronavirus, COVID+19, which will cure anyone you have close contact with.\" />",
          "link": "https://xkcd.com/2558/",
          "publishedOn": "2021-12-22T00:00:00.000Z",
          "wordCount": 205,
          "title": "Rapid Test Results"
        },
        {
          "id": "https://xkcd.com/2557/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/immunity.png\" title=\"This plan may sound appealing to people who know a little about the immune system, but the drawbacks are clear to people who know a lot about the immune system and also to people who don't know anything about it.\" alt=\"This plan may sound appealing to people who know a little about the immune system, but the drawbacks are clear to people who know a lot about the immune system and also to people who don't know anything about it.\" />",
          "link": "https://xkcd.com/2557/",
          "publishedOn": "2021-12-20T00:00:00.000Z",
          "wordCount": 201,
          "title": "Immunity"
        }
      ]
    },
    {
      "title": "remy sharp's b:log",
      "feedUrl": "https://remysharp.com/feed.xml",
      "siteUrl": "https://remysharp.com",
      "articles": [
        {
          "id": "my-hardware-adventure-with-a-gameboy-pocket",
          "author": null,
          "description": "I bought this Gameboy Pocket off eBay in the hope that I could bring it back to life...\n\nI'd seen this before and suspected that the game couldn't be loaded due to corruption during boot (on the GB side). I was wrong, but I definitely enjoyed the challenge!\n\nOpening up the Gameboy up and took a peek, and yep, found game pak loading doberry had been messed with. Bit of a duff job on whoever tried to repair it before me - and it even looks like they spotted there was a short and tried to slice through it with a knife:\n\nPins A2 and A1 were definitely connected! Some flux and solder later and it looks more like this:\n\nAnd now the Gameboy boots with a nice clean Nintendo logo. Except… it doesn't go past that point at all - and in fact the screen looks like it's doing some weird flash dance, goi…",
          "link": "https://remysharp.com/2022/02/05/my-hardware-adventure-with-a-gameboy-pocket",
          "publishedOn": "2022-02-05T00:00:00.000Z",
          "wordCount": 592,
          "title": "My hardware adventure with a Gameboy Pocket [blog]"
        },
        {
          "id": "trim",
          "author": null,
          "description": "At the start of this year, after over 2½ years of growing my hair, I cut it all off, right to the scalp and donated it to charity, specifically so Little Princess Trust, a charity who create wigs for little girls with cancer. Whilst Julie also raised over £650 which pays for the creation.\nI did post the progress on Twitter, but I don't trust that site to be around in the next decade or two, so I'm posting it here too, since this site will be around as long as I am.",
          "link": "https://remysharp.com/2022/01/29/trim",
          "publishedOn": "2022-01-29T00:00:00.000Z",
          "wordCount": 418,
          "title": "Trim [blog]"
        },
        {
          "id": "2022-01-18-47fd232c",
          "author": null,
          "description": "A simple mono font, but also comes with it's own easy to use visual editor where you can work on an multi-layered 5x11 grid to customise the font to your liking - and download it as an .OTF file.\nSource: brutalita.com",
          "link": "https://remysharp.com/links/2022-01-18-47fd232c",
          "publishedOn": "2022-01-18T10:00:06.000Z",
          "wordCount": 193,
          "title": "Brutalita Sans - font and editor [link]"
        },
        {
          "id": "klara-and-the-sun",
          "author": null,
          "description": "Klara and the Sun",
          "link": "https://remysharp.com/books/2022/klara-and-the-sun",
          "publishedOn": "2022-01-14T00:00:00.000Z",
          "wordCount": 157,
          "title": "Klara and the Sun [book]"
        },
        {
          "id": "books-i-read-in-2021",
          "author": null,
          "description": "As my year in reading goes, I've certainly read less books, but I've not spent less time reading. It's just some books take me longer than others. For example, I read Call of the Wild, an 80(ish) page book in 4 weeks and then I read a 400 page book in 4 days… so it's really swings and roundabouts.\nI recorded 21 books on my Kindle this year, but actually one of them was read aloud to the kids (Which I do still count) but another one was all of 19 pages… which, I think really doesn't count (it was Home: Habitat, Range, Niche, Territory by Martha Wells). So… 20 books then.\nThis post is mostly data driven (from my own web site's data) to give me a sense of the quality of the books I've read, otherwise individual reviews are all linked in this post or available on my books page.",
          "link": "https://remysharp.com/2022/01/01/books-i-read-in-2021",
          "publishedOn": "2022-01-01T00:00:00.000Z",
          "wordCount": 845,
          "title": "Books I read in 2021 [blog]"
        },
        {
          "id": "my-2021",
          "author": null,
          "description": "On a frequency of once every 365 days, based on the theme of my previous me-me-me posts and a general stamp I like to leave myself to remind Future Remy what the hell went on, here is my 2021.",
          "link": "https://remysharp.com/2021/12/31/my-2021",
          "publishedOn": "2021-12-31T08:00:00.000Z",
          "wordCount": 968,
          "title": "My 2021 [blog]"
        },
        {
          "id": "iron-widow-iron-widow-1",
          "author": null,
          "description": "Iron Widow (Iron Widow, #1)",
          "link": "https://remysharp.com/books/2021/iron-widow-iron-widow-1",
          "publishedOn": "2021-12-31T00:00:00.000Z",
          "wordCount": 160,
          "title": "Iron Widow (Iron Widow, #1) [book]"
        },
        {
          "id": "a-psalm-for-the-wild-built-monk-and-robot-1",
          "author": null,
          "description": "Lovely but I found the language almost too distracting.\nOnly right at the end of the book did I consider that maybe I really wasn't the right audience for the story - as it seemed to smack of \"millennium type problems\". Using air quotes in my description because I'm fairly sure this is a patronising statement I'm making!\nThe Dex character feels discontent with their achievements and is struggling to find fulfilling meaning. Their work has meaning to others but they're left feeling empty. Obviously it's an impossible measure as life trondles forward and achievements change with time.\nFor me it was only really when Dex meets the Robot (whose name I've already forgotten) when the book became more engaging. It was like the Dex character could be challenged and some real depth was offered (for better or worse for Dex's personality).\nBut what I did struggle with was the language and the odd shoehorning of gender pronouns. Dex is neither \"he\" or \"she\", so Chamber's settles with using the \"they\" pronoun. This led to my own confusion regularly thinking the lines I was reading was referring to Dex and another character that was in the scene.\nThe sore-thumb moment is when Dex asks, interestingly, what pronoun the Robot uses, and the Robot responds with \"it\" and it refers to itself as an object. Dex replies with (something like) they are the same, and their pronoun is \"they\". This seemed like a potentially interesting exchange between the Robot and Dex about the subject of how one refers to oneself and how they identify, but it doesn't happen. It just has that exchange, and then the story returns to what they were doing and carries on. It felt jarring and like Chamber's wanted to discuss this topic, but instead shoe horned it in.\nI do also suspect that my trouble with the language is a me-thing and probably with practice it won't cause me as much (or any) confusion, but for now, and this book, it definitely affected how I enjoyed the story.",
          "link": "https://remysharp.com/books/2021/a-psalm-for-the-wild-built-monk-and-robot-1",
          "publishedOn": "2021-12-29T00:00:00.000Z",
          "wordCount": 509,
          "title": "A Psalm for the Wild-Built (Monk & Robot, #1) [book]"
        },
        {
          "id": "hercule-poirots-christmas",
          "author": null,
          "description": "I totally failed to guess the killer!\nPoirot was staple TV viewing when I was a teenage so the image of the character is burned well into my consciousness (thank you David Suchet) - so reading an Agatha Christie book tends to come with very easy imagination and even accents for characters.\nThe story is well built, told in a way that makes me think I should have been able to deduce the killer myself (and something I've always wondered about murder mystery stories) and does a good job of flipping my expectations on its head!\nSolid stuff.",
          "link": "https://remysharp.com/books/2021/hercule-poirots-christmas",
          "publishedOn": "2021-12-24T00:00:00.000Z",
          "wordCount": 253,
          "title": "Hercule Poirot's Christmas [book]"
        }
      ]
    },
    {
      "title": "Writing - rachelbythebay",
      "feedUrl": "https://rachelbythebay.com/w/atom.xml",
      "siteUrl": "https://rachelbythebay.com/w/",
      "articles": [
        {
          "id": "https://rachelbythebay.com/w/2022/02/14/feedback/",
          "author": null,
          "description": "Yep, it's time for another round of reader feedback.\n\n\"process infection\" story:\n\nhttps://lwn.net/Articles/883547/):\n\n\nIf you do privileged execution of specific operations via IPC you get \nthe guarantee that whatever is done, is done from a well-defined, \npristine execution environment, without leaking context implicitly. The \nIPC message is the *full* vulnerable surface, and that's as minimal as \nit can get. And that's great.\n\n\n\n\nOh wow, thank you for mentioning that, unnamed reader!  I definitely \nread that post on LWN at some point in the past couple of days when the \npkexec thing started going around.  It must have really worked its way \ninto my head, and then eventually stirred up the memory of everything \ngetting \"nicely infected\" at $OLD_JOB.\n\n\nEvery time I talk about trying to par…",
          "link": "https://rachelbythebay.com/w/2022/02/14/feedback/",
          "publishedOn": "2022-02-14T23:56:36.000Z",
          "wordCount": 1731,
          "title": "Feedback: environments, old BBSes, Honda's 2022 bug",
          "imageUrl": null
        },
        {
          "id": "https://rachelbythebay.com/w/2022/02/09/nice/",
          "author": null,
          "description": "I once worked at a place that had an interesting little problem stemming \nfrom the way they managed machines and some of the fun side-effects \nprocesses can have on each other.  This is back in the pre-systemd days \nof running services, such that things tended to be started or restarted \nby someone or something that itself ran as root.  That is, if you \nstarted something, it might inherit one or more things from your \nenvironment.  Likewise, if you ran something with an unusual \nenvironment, it might bestow those \"gifts\" onto anything it happened to \ntouch.\n\n\nAfter locking themselves out of machines too many times, people \ngenerally learned that after you mess with a glibc upgrade, you restart \nthe sshd listener on port 22.  Of course, they also had to learn to not \nwhack EVERY sshd at the…",
          "link": "https://rachelbythebay.com/w/2022/02/09/nice/",
          "publishedOn": "2022-02-10T19:24:29.000Z",
          "wordCount": 951,
          "title": "A nice story about Unix processes \"infecting\" each other"
        },
        {
          "id": "https://rachelbythebay.com/w/2022/01/26/swcbbs/",
          "author": null,
          "description": "Nearly 30 years ago, I was given this picture.  I wanted to present it \nin a post all by itself to give it a chance to \"sink in\" before I went \nand used it in an analogy.  First, I'll just show the image and explain \nwhat you're looking at here.\n\n\n\n\nI do remember the description from the back: this is a picture of *part \nof* something that was called the Software Creations BBS.  It was a \nmulti-line bulletin board system where you could dial up and send \nmessages to people, upload and download files, and (presumably) play \nonline games (\"doors\") and anything else they cared to offer.\n\n64 machines in a little space.  I have to assume \nthey are at least \n286s (ATs, more or \nless), but it's impossible to tell from just this picture.  They could \nhave been 386s or even 486s by that point, but …",
          "link": "https://rachelbythebay.com/w/2022/01/26/swcbbs/",
          "publishedOn": "2022-01-28T05:01:25.000Z",
          "wordCount": 694,
          "title": "An old photo of a very large BBS"
        },
        {
          "id": "https://rachelbythebay.com/w/2022/01/27/scale/",
          "author": null,
          "description": "Okay, so yesterday I \nposted\na picture of an old multi-line bulletin board system which had \napparently taken over an entire bedroom with dozens of computers.  I \nmentioned that I intended to come back to the topic to throw in my own \ntwo cents, and so here we go.\n\n\nOr, were you someone who found it horrific and wished there was a \nsimpler way?  Did you wonder if it would be possible to pack all of that \ninto one or maybe two boxes, instead?  Did you want a way to negate all \nof that complexity while still providing the same level of service?\n\n\nNow, things are different.  I look at that and just sigh at the lost \nopportunities.  The actual amount of work being done on behalf of any of \nthe users who are connected is tiny.  If we ignore the fact that the \nactual BBS software and related acc…",
          "link": "https://rachelbythebay.com/w/2022/01/27/scale/",
          "publishedOn": "2022-01-28T05:00:38.000Z",
          "wordCount": 846,
          "title": "One machine can go pretty far if you build things properly"
        },
        {
          "id": "https://rachelbythebay.com/w/2022/01/01/baddate/",
          "author": null,
          "description": "I guess I've turned into a collector of numbers that break things \nsometimes.  Here's another one I just heard about, and it's directly \nrelated to what just happened with the calendar.\n\n\nThe last value for last year is December 31, 2021 at 23:59, and in this \nformat it becomes 2112312359.  That just fits into a signed 32 bit \nnumber (which tops out at 2147483647).\n\n\nSo, if you're using Microsoft Exchange and stopped getting your mail in \nthe past couple of hours, this is why!\n\nReally!  No joke!\n\nHappy 2022, everyone.",
          "link": "https://rachelbythebay.com/w/2022/01/01/baddate/",
          "publishedOn": "2022-01-01T19:36:01.000Z",
          "wordCount": 160,
          "title": "YYMMDDHHMM just overflowed a signed 32 bit int"
        },
        {
          "id": "https://rachelbythebay.com/w/2021/12/24/mkdir/",
          "author": null,
          "description": "Several years back, I was doing my thing in a corporate environment, \nworking on a project with some friends.  By virtue of being in a very \nlarge company, we had quite the assortment of libraries which could be \nbrought in to do stuff.  Given that we had a \"would be nice\" item on our \nfeature list that involved doing something with the filesystem, I went \nlooking for a matching feature, and it turned into a security dumpster \nfire.  Here's what happened.\n\n\nWhen you're in that situation, you can't just mkdir() the final path.  \nIt won't work.  You have to start from the top and work your way down.  \nThe ones which already exist will probably fail with -EEXIST, so \nsometimes it makes more sense to look at what's there, work your way \ndown, and then start the mkdir calls when you find that p…",
          "link": "https://rachelbythebay.com/w/2021/12/24/mkdir/",
          "publishedOn": "2021-12-25T19:49:20.000Z",
          "wordCount": 961,
          "title": "Fix the unit test and open a giant hole everywhere"
        },
        {
          "id": "https://rachelbythebay.com/w/2020/11/26/magic/",
          "author": null,
          "description": "Hello, world!  A couple of days ago, I noticed someone remarking on a \nline from an older post of mine that had been making the rounds.  In it, \nI say something about adding a number to \"my list of magic numbers\".  \nThat person wanted to see that list.\n\n\nAnd so, I have put together this list of everything I can think of at \nthe moment, along with a whole bunch of commentary that should be able \nto send you on dozens of romps through Wikipedia.  Hopefully this will \nboth satisfy the request for \"the list\" and provide a lot of amusement \non a day which normally is lacking in content.\n\n\nBe safe out there, and enjoy.\n\n\n\"HTTP\" is 0x48545450 (1213486160) or 0x50545448 (1347703880).  If it \nshows up in your error logs, you're probably calling out to a poor web \nserver instead of someone who actua…",
          "link": "https://rachelbythebay.com/w/2020/11/26/magic/",
          "publishedOn": "2021-12-20T02:56:14.000Z",
          "wordCount": 3043,
          "title": "My list of magic numbers for your turkey day enjoyment"
        },
        {
          "id": "https://rachelbythebay.com/w/2021/12/18/log/",
          "author": null,
          "description": "Logging stuff is in the news this week.  Specifically, people with Java \nand log4j somewhere in their lives are having a miserable time.  I \nfigured I'd re-tell a story about terrible things done by way of a bunch \nof feature-rich libraries and dubious interconnections.  I've mentioned \nthis in passing before, but this time I've tried to be much more \nspecific about how it works.\n\n\nPart 1: the flags.\n\n\n\nDEFINE_bool(enable_foo, false, \"Enable the foo feature\");\n \n...\n \nvoid my_func() {\n  if (FLAGS_enable_foo) {\n    do_something();\n  }\n}\n\n\n\n\nDECLARE_bool(enable_foo);\n \n...\n \nvoid other_func() {\n  // Turns out we need foo enabled to do our stuff.\n  FLAGS_enable_foo = true;\n  // ...\n}\n\n\n\n\nint main(int argc, char** argv) {\n  InitCompany(argc, argv);  // populates FLAGS_ of all kinds\n  // ...\n}\n…",
          "link": "https://rachelbythebay.com/w/2021/12/18/log/",
          "publishedOn": "2021-12-19T01:05:39.000Z",
          "wordCount": 1330,
          "title": "Log libraries and the tendency to open holes in things"
        }
      ]
    },
    {
      "title": "LOW-TECH MAGAZINE",
      "feedUrl": "https://feeds2.feedburner.com/typepad/krisdedecker/lowtechmagazineenglish",
      "siteUrl": "https://www.lowtechmagazine.com/",
      "articles": [
        {
          "id": "https://www.lowtechmagazine.com/2022/01/the-revenge-of-the-hot-water-bottle.html",
          "author": null,
          "description": "Imagine a personal heating system that works indoors as well as outdoors, can be taken anywhere, requires little energy, and is independent of any infrastructure. It exists – and is hundreds of years old. The hot water bottle could save a great deal of energy and money without sacrificing thermal comfort. Hot water bottles work both indoors and outdoors. Illustration: Marie Verdeil. A hot water bottle is a sealable container filled with hot water, often enclosed in a textile cover, which is directly placed against a part of the body for thermal comfort. The hot water bottle is still a common household item in some places – such as the UK and Japan – but it is largely forgotten or...",
          "link": "https://www.lowtechmagazine.com/2022/01/the-revenge-of-the-hot-water-bottle.html",
          "publishedOn": "2022-01-21T09:50:13.000Z",
          "wordCount": 4553,
          "title": "The Revenge of the Hot Water Bottle"
        }
      ]
    },
    {
      "title": "esoteric.codes",
      "feedUrl": "https://esoteric.codes/rss",
      "siteUrl": "https://esoteric.codes",
      "articles": []
    },
    {
      "title": "Lea Verou",
      "feedUrl": "https://feeds.feedburner.com/leaverou",
      "siteUrl": "https://lea.verou.me",
      "articles": []
    },
    {
      "title": "TEXT-MODE",
      "feedUrl": "https://text-mode.tumblr.com/rss",
      "siteUrl": "https://text-mode.tumblr.com/",
      "articles": []
    },
    {
      "title": "The Mozilla Blog",
      "feedUrl": "https://blog.mozilla.org/en/feed/",
      "siteUrl": "https://blog.mozilla.org/en/",
      "articles": [
        {
          "id": "https://blog.mozilla.org/?p=68461",
          "author": "Rebecca Smith",
          "description": "Who hasn’t taken a quiz online to figure out what TV character you are most like, what city should you live in or what 90s song most represents you? These quizzes seem innocent enough. You put in the name of your high school best friend, you select the kind of pet you had growing up […]\nThe post Pop Quiz: What are 5 questions to ask yourself before taking that online quiz? appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/mozilla/online-quizzes-data-collection-privacy-tips/",
          "publishedOn": "2022-02-14T16:56:23.000Z",
          "wordCount": 1482,
          "title": "Pop Quiz: What are 5 questions to ask yourself before taking that online quiz?",
          "imageUrl": "https://blog.mozilla.org/wp-content/blogs.dir/278/files/2022/02/header_privacy_protect-identity-1079x719.png"
        },
        {
          "id": "https://blog.mozilla.org/?p=68457",
          "author": "Martin Thomson",
          "description": "Advertising provides critical support for the Web. We’ve been looking to apply privacy preserving advertising technology to the attribution problem, so that advertisers can get answers to important questions without harming privacy. Attribution is how advertisers know if their advertising campaigns are working. Attribution generates metrics that allow advertisers to understand how their advertising campaigns […]\nThe post Privacy Preserving Attribution for Advertising appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/mozilla/privacy-preserving-attribution-for-advertising/",
          "publishedOn": "2022-02-08T17:00:00.000Z",
          "wordCount": 1097,
          "title": "Privacy Preserving Attribution for Advertising"
        },
        {
          "id": "https://blog.mozilla.org/?p=68430",
          "author": "Kristina Bravo",
          "description": "If omicron canceled your winter plans, watching the Beijing games may be the next best thing. Can’t snowboard? See star athletes shred. Closed ski resort? Leave the poles to the pros. And yes, it feels like we just put out the flames on the torch — less than six months ago to be exact. But […]\nThe post Here’s how to watch the games with Firefox because we all need a winter distraction appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/products/firefox/how-to-watch-winter-games-multiple-videos-firefox/",
          "publishedOn": "2022-02-04T18:17:50.000Z",
          "wordCount": 1331,
          "title": "Here’s how to watch the games with Firefox because we all need a winter distraction"
        },
        {
          "id": "https://blog.mozilla.org/?p=68362",
          "author": "Rebecca Smith",
          "description": "Here at Mozilla, we are the first to admit the internet isn’t perfect, but we are also quick to point out that the internet is pretty darn magical. The internet opens up doors and opportunities, allows for people to connect with others, and lets everyone find where they belong — their corners of the internet. […]\nThe post The New York Times editorial director of games on creating her ideal corner of the internet appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/internet-culture/everdeen-mason-nytimes-director-of-games-internet-interview/",
          "publishedOn": "2022-02-04T17:44:08.000Z",
          "wordCount": 1610,
          "title": "The New York Times editorial director of games on creating her ideal corner of the internet"
        },
        {
          "id": "https://blog.mozilla.org/?p=68415",
          "author": "Mozilla",
          "description": "Mozilla’s mission is to make sure the Internet remains open and accessible to all. Four years ago, we launched Firefox Reality, a browser for mixed reality, and our exploration in browsing in new and emerging realities. We’ve been at the forefront of developing new technologies, like WebVR and WebAR, and in some instances, Mozilla continues […]\nThe post Update on Firefox Reality appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/mozilla/news/update-on-firefox-reality/",
          "publishedOn": "2022-02-03T14:03:11.000Z",
          "wordCount": 1074,
          "title": "Update on Firefox Reality"
        },
        {
          "id": "https://blog.mozilla.org/?p=68376",
          "author": "Mozilla",
          "description": "At Mozilla, online privacy has always been one of our top priorities. Recently we announced Total Cookie Protection on Firefox Focus to combat cross-site tracking, and last year we introduced Firefox Relay, a privacy-first product that hides your real email address to help protect your identity. We are always looking for ways to offer privacy […]\nThe post Keep your multiple online lives private with Multi-Account Containers Add-on on Mozilla VPN appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/products/mozilla-vpn/multi-account-containers-add-on-on-mozilla-vpn/",
          "publishedOn": "2022-02-01T17:00:39.000Z",
          "wordCount": 1463,
          "title": "Keep your multiple online lives private with Multi-Account Containers Add-on on Mozilla VPN"
        },
        {
          "id": "https://blog.mozilla.org/?p=68365",
          "author": "Mozilla",
          "description": "Shaw becomes first Canadian ISP to Commit to Data Retention and Transparency Requirements That Protect Customer Privacy Today, Mozilla, the maker of Firefox, and Shaw Communications Inc. have announced that Shaw is the first Internet Service Provider (ISP) in Canada to provide Firefox users with encrypted Domain Name System (DNS) services through Mozilla’s Trusted Recursive […]\nThe post Shaw Joins Firefox’s Trusted Recursive Resolver Program appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/mozilla/news/shaw-firefox-trusted-recursive-resolver-program-doh/",
          "publishedOn": "2022-02-01T11:00:00.000Z",
          "wordCount": 1115,
          "title": "Shaw Joins Firefox’s Trusted Recursive Resolver Program"
        },
        {
          "id": "https://blog.mozilla.org/?p=68375",
          "author": "Jenn Taylor Hodges",
          "description": "Today, the Ninth Circuit court upheld California’s net neutrality law, affirming that California residents can continue to benefit from the fundamental safeguards of equal treatment and open access to the internet. This decision clears the way for states to enforce their own net neutrality laws, ensuring that consumers can freely access ideas and services without […]\nThe post In California, an Important Victory for Net Neutrality appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/mozilla/in-california-an-important-victory-for-net-neutrality/",
          "publishedOn": "2022-01-28T23:05:32.000Z",
          "wordCount": 1022,
          "title": "In California, an Important Victory for Net Neutrality"
        },
        {
          "id": "https://blog.mozilla.org/?p=68371",
          "author": "Mozilla",
          "description": "Explore options to have a less creepy and more carefree online life Happy International Data Privacy Day! While January 28 marks a day to raise awareness and promote best practices for privacy and data protection around the world, we at Mozilla do this work year-round so our users can celebrate today — and every day […]\nThe post Celebrating Data Privacy Day appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/mozilla/celebrating-data-privacy-day/",
          "publishedOn": "2022-01-28T17:27:44.000Z",
          "wordCount": 1734,
          "title": "Celebrating Data Privacy Day"
        },
        {
          "id": "https://blog.mozilla.org/?p=68304",
          "author": "Elise Blanchard",
          "description": "Why we need to revisit the origin of blue hyperlink While musing over my recently published article, Why are hyperlinks blue, I was left feeling a bit blue myself. Yes, it could have been the fact that I was evacuated and Hurricane Ida was destroying my home, I’ll admit. Besides that, I was also bothered […]\nThe post Revisiting why hyperlinks are blue appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/internet-culture/why-are-hyperlinks-blue-revisited/",
          "publishedOn": "2022-01-11T20:46:23.000Z",
          "wordCount": 2595,
          "title": "Revisiting why hyperlinks are blue"
        },
        {
          "id": "https://blog.mozilla.org/?p=68204",
          "author": "Mozilla",
          "description": "Have you ever signed up for a contest to win a big screen TV or a vacation to an exotic location? Or have you joined a big retailer loyalty program so you can save money? If you answered yes to either of these questions you may be exchanging your name, home address, email address, phone […]\nThe post New Year, New Privacy Protection for Firefox Focus on Android appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/mozilla/new-privacy-protection-for-firefox-focus-on-android/",
          "publishedOn": "2022-01-11T14:16:13.000Z",
          "wordCount": 1287,
          "title": "New Year, New Privacy Protection for Firefox Focus on Android"
        },
        {
          "id": "https://blog.mozilla.org/?p=68219",
          "author": "Lindsey Shepard",
          "description": "For most, the New Year marks a time to reflect, reset and re-prioritize. While learning a new language, creating a budget or starting up a new hobby have become staples of our New Years’ Resolutions, as our lives increasingly shift online, it’s important we also use this opportunity to reassess our digital habits. Whether you […]\nThe post Digital Checklist: How to Start 2022 Right appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/uncategorized/digital-checklist-how-to-start-2022-right/",
          "publishedOn": "2022-01-10T18:00:53.000Z",
          "wordCount": 2012,
          "title": "Digital Checklist: How to Start 2022 Right"
        },
        {
          "id": "https://blog.mozilla.org/?p=68200",
          "author": "Mozilla",
          "description": "Browser maker Mozilla today announced a partnership with The Markup, the non-profit newsroom that investigates how technology is reshaping society, on a research project to provide insights into and data about a space that’s opaque to policymakers, researchers and users themselves. By joining Mozilla and The Markup’s “Facebook Pixel Hunt” in Firefox, people can help […]\nThe post Mozilla partners with The Markup to launch Rally study into Facebook’s tracking and data collection practices appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/mozilla/news/mozilla-themarkup-partner-rally-facebook-tracking-data-collection/",
          "publishedOn": "2022-01-10T11:00:00.000Z",
          "wordCount": 1383,
          "title": "Mozilla partners with The Markup to launch Rally study into Facebook’s tracking and data collection practices"
        }
      ]
    },
    {
      "title": "Julia Evans",
      "feedUrl": "https://jvns.ca/atom.xml",
      "siteUrl": "http://jvns.ca/atom.xml",
      "articles": [
        {
          "id": "https://jvns.ca/blog/2022/02/14/some-dns-terminology/",
          "author": null,
          "description": "I’m working on a zine about DNS right now, so I’ve been thinking about DNS\nterminology a lot more than a normal person. Here’s something slightly\nconfusing I’ve noticed about DNS terminology!\nTwo of the most common DNS server terms (“nameserver” and “DNS resolver”)\nhave different meanings depending on the situation.\nNow this isn’t a problem if you already understand how DNS works – I can\neasily figure out what type of “nameserver” is being discussed based on\ncontext.\nBut it can be a problem if you’re trying to learn how DNS works and you don’t\nrealize that those words might refer to different things depending on the\ncontext – it’s confusing! So I’m going to explain the different possible\nmeanings and how to figure out which meaning is intended.\nthe 2 meanings of “nameserver”\nThere are 2 ty…",
          "link": "https://jvns.ca/blog/2022/02/14/some-dns-terminology/",
          "publishedOn": "2022-02-14T12:31:34.000Z",
          "wordCount": 1066,
          "title": "The multiple meanings of \"nameserver\" and \"DNS resolver\"",
          "imageUrl": null
        },
        {
          "id": "https://jvns.ca/blog/2022/02/01/a-dns-resolver-in-80-lines-of-go/",
          "author": null,
          "description": "Hello! I wrote a comic last week called “life of a DNS query” that explains how\nDNS resolvers work.\nIn this post, I want to explain how DNS resolvers work in a different way –\nwith a short Go program that does the same thing described in the comic.\nThe main function (resolve) is actually just 20 lines, including comments.\nI usually find it easier to understand things work when they come in the form\nof programs that I can run and modify and poke at, so hopefully this program\nwill be helpful to some of you.\nThe program is here: https://github.com/jvns/tiny-resolver/blob/main/resolve.go\nwhat’s a DNS resolver?\nWhen your browser needs to make a DNS query, it asks a DNS resolvers. When\nthey start, DNS resolvers don’t know any DNS records (except the IP addresses\nof the root nameservers). But the…",
          "link": "https://jvns.ca/blog/2022/02/01/a-dns-resolver-in-80-lines-of-go/",
          "publishedOn": "2022-02-01T09:15:14.000Z",
          "wordCount": 2612,
          "title": "A toy DNS resolver"
        },
        {
          "id": "https://jvns.ca/blog/2022/01/29/reasons-for-servers-to-support-ipv6/",
          "author": null,
          "description": "I’ve been having a hard time understanding IPv6. On one hand, the basics initially seem pretty\nstraightforward (there aren’t enough IPv4 addresses for all the devices on the\ninternet, so people invented IPv6! There are enough IPv6 addresses for\neveryone!)\nBut when I try to actually understand it, I run into a lot of questions. One\nquestion is: twitter.com does not support IPv6. Presumably it can’t be causing\nthem THAT many issues to not support it. So why do websites support IPv6?\nI asked people on Twitter why their servers support IPv6\nand I got a lot of great answers, which I’ll summarize here. These all come\nwith the disclaimer that I have basically 0 experience with IPv6 so I can’t evaluate these reasons very well.\nFirst though, I want to explain why it’s possible for twitter.com to no…",
          "link": "https://jvns.ca/blog/2022/01/29/reasons-for-servers-to-support-ipv6/",
          "publishedOn": "2022-01-29T07:44:38.000Z",
          "wordCount": 1832,
          "title": "Reasons for servers to support IPv6"
        },
        {
          "id": "https://jvns.ca/blog/2022/01/24/hosting-my-static-sites-with-nginx/",
          "author": null,
          "description": "Hello! Recently I’ve been thinking about putting my static sites on servers\nthat I run myself instead of using managed services like Netlify or GitHub\nPages.\nOriginally I thought that running my own servers would require a lot of\nmaintenance and be a huge pain, but I was chatting with Wesley about what kind\nof maintainance their servers require, and\nthey convinced me that it might not be that bad.\nSo I decided to try out moving all my static sites to a $5/month server to see\nwhat it was like.\nEverything in here is pretty standard but I wanted to write down what I did\nanyway because there are a surprising number of decisions and I like to see\nwhat choices other people make.\nthe constraint: only static sites\nTo keep things simple, I decided that this server would only run nginx and\nonly serv…",
          "link": "https://jvns.ca/blog/2022/01/24/hosting-my-static-sites-with-nginx/",
          "publishedOn": "2022-01-24T07:59:19.000Z",
          "wordCount": 1666,
          "title": "Hosting my static sites with nginx"
        },
        {
          "id": "https://jvns.ca/blog/2022/01/15/some-ways-dns-can-break/",
          "author": null,
          "description": "When I first learned about it, DNS didn’t seem like it should be THAT\ncomplicated. Like, there are DNS records, they’re stored on a server, what’s\nthe big deal?\nBut with DNS, reading about how it works in a textbook doesn’t prepare you for\nthe sheer volume of different ways DNS can break your system in practice. It’s\nnot just caching problems!\nSo I asked people on Twitter for\nexample of DNS problems they’ve run into, especially DNS problems that didn’t\ninitially appear to be DNS problems. (the popular “it’s always DNS” meme)\nI’m not going to discuss how to solve or avoid any of these problems in this\npost, but I’ve linked to webpages discussing the problem where I could find\nthem.\nproblem: slow network requests\nYour network requests are a little bit slower than expected, and it’s actually\n…",
          "link": "https://jvns.ca/blog/2022/01/15/some-ways-dns-can-break/",
          "publishedOn": "2022-01-15T12:25:37.000Z",
          "wordCount": 1508,
          "title": "Some ways DNS can break"
        },
        {
          "id": "https://jvns.ca/blog/2022/01/11/how-to-find-a-domain-s-authoritative-nameserver/",
          "author": null,
          "description": "Here’s a very quick “how to” post on how to find your domain’s authoritative\nnameserver.\nI’m writing this because if you made a DNS update and it didn’t work, there are 2 options:\nYour authoritative nameserver doesn’t have the correct record\nYour authoritative nameserver does have the correct record, but an old record is cached and you need to wait for the cache to expire\nTo be able to tell which one is happening (do you need to make a change, or do\nyou just need to wait?), you need to be able to find your domain’s\nauthoritative nameserver and query it to see what records it has.\nBut when I looked up “how to find a domain’s authoritative nameserver” to see\nwhat advice was out there, I found a lot of different methods being mentioned,\nsome of which can give you the wrong answer.\nSo let’s wa…",
          "link": "https://jvns.ca/blog/2022/01/11/how-to-find-a-domain-s-authoritative-nameserver/",
          "publishedOn": "2022-01-11T08:30:16.000Z",
          "wordCount": 1299,
          "title": "How to find a domain's authoritative nameservers"
        },
        {
          "id": "https://jvns.ca/blog/2022/01/05/why-might-you-run-your-own-dns-server-/",
          "author": null,
          "description": "One of the things that makes DNS difficult to understand is that it’s\ndecentralized. There are thousands (maybe hundreds of thousands? I don’t know!) of authoritative nameservers, and at least\n10 million resolvers.\nAnd they’re running lots of different software! All these different servers\nrunning software means that there’s a lot of inconsistency in how DNS works,\nwhich can cause all kinds of frustrating problems.\nBut instead of talking about the problems, I’m interested in figuring out –\nwhy is it a good thing that DNS is decentralized?\nwhy is it good that DNS is decentralized?\nOne reason is scalability – the decentralized design of DNS makes it\neasier to scale and more resilient to failures. I find it really amazing that\nDNS is still scaling well even though it’s almost 40 years old. Th…",
          "link": "https://jvns.ca/blog/2022/01/05/why-might-you-run-your-own-dns-server-/",
          "publishedOn": "2022-01-05T06:42:51.000Z",
          "wordCount": 1858,
          "title": "Why might you run your own DNS server?"
        },
        {
          "id": "https://jvns.ca/blog/2021/12/31/2021--year-in-review/",
          "author": null,
          "description": "It’s the end of the year again! This was my second full year working for myself\non wizard zines.\nHere are some thoughts about what I’m working towards, a bunch of things I made\nthis year, and a few ideas and questions about 2022.\nmade some progress on a “mission statement”\nI think the two hardest things about working for myself are working alone and\nhaving to decide what to do.\nThis year I spent some time trying to figure out what I’m doing with wizard\nzines. This is hard for me because I work in a pretty intuitive way – I have\nsome feelings about what’s important, and even though following my feelings\nusually turns out well, I can’t always explain what I’m trying to do.\nHere are some thoughts about what I’m trying to do:\nI’m only interested in explaining “old” established technologies (HT…",
          "link": "https://jvns.ca/blog/2021/12/31/2021--year-in-review/",
          "publishedOn": "2021-12-31T09:27:53.000Z",
          "wordCount": 1790,
          "title": "2021: Year in review"
        }
      ]
    },
    {
      "title": "Josh Comeau's blog",
      "feedUrl": "https://www.joshwcomeau.com/rss.xml",
      "siteUrl": "https://www.joshwcomeau.com/",
      "articles": [
        {
          "id": "https://www.joshwcomeau.com/css/stacking-contexts/",
          "author": "Josh W. Comeau",
          "description": "The z-index property can be a tricky little bugger. Sometimes, no matter how much you crank up the number, the element never rises to the top! In this article, we explore stacking contexts, and see how they can thwart our efforts to use z-index. We'll also learn how to use this mechanism to our advantage.",
          "link": "https://www.joshwcomeau.com/css/stacking-contexts/",
          "publishedOn": "2022-01-27T09:49:38.000Z",
          "wordCount": 2680,
          "title": "What The Heck, z-index??"
        },
        {
          "id": "https://www.joshwcomeau.com/css/css-variables-for-react-devs/",
          "author": "Josh W. Comeau",
          "description": "CSS Variables are *really* cool, and they're incredibly powerful when it comes to React! This tutorial shows how we can use them with React to create dynamic themes. We'll see how to get the most out of CSS-in-JS tools like styled-components, and how our mental frame around media queries has been wrong all along.",
          "link": "https://www.joshwcomeau.com/css/css-variables-for-react-devs/",
          "publishedOn": "2022-01-27T09:49:38.000Z",
          "wordCount": 2537,
          "title": "CSS Variables for React Devs"
        },
        {
          "id": "https://www.joshwcomeau.com/css/make-beautiful-gradients/",
          "author": "Josh W. Comeau",
          "description": "Have you ever noticed that gradients tend to look a little gray and washed-out in the middle? This happens because of a mathematical quirk with RGB colors. Fortunately, we can work around this quirk, and create beautiful, lush, saturated gradients.",
          "link": "https://www.joshwcomeau.com/css/make-beautiful-gradients/",
          "publishedOn": "2022-01-11T14:00:00.000Z",
          "wordCount": 1426,
          "title": "Make Beautiful Gradients"
        },
        {
          "id": "https://www.joshwcomeau.com/animation/3d-button/",
          "author": "Josh W. Comeau",
          "description": "Every action we take on the web starts with a button click, and yet most buttons are ho-hum and uninspired. In this tutorial, we'll build an animated 3D button with HTML and CSS that sparks joy.",
          "link": "https://www.joshwcomeau.com/animation/3d-button/",
          "publishedOn": "2022-01-01T13:00:00.000Z",
          "wordCount": 2345,
          "title": "Building a Magical 3D Button"
        },
        {
          "id": "https://www.joshwcomeau.com/react/rainbow-button/",
          "author": "Josh W. Comeau",
          "description": "If you've ever tried to animate a gradient, you've been met with a harsh reality—it isn't possible. At least, it wasn't! In this tutorial, we'll leverage bleeding-edge browser features to animate ANY CSS property, including background gradients, using CSS Houdini, CSS variables, and React.",
          "link": "https://www.joshwcomeau.com/react/rainbow-button/",
          "publishedOn": "2022-01-01T13:00:00.000Z",
          "wordCount": 2276,
          "title": "Magical Rainbow Gradients"
        },
        {
          "id": "https://www.joshwcomeau.com/react/folding-the-dom/",
          "author": "Josh W. Comeau",
          "description": "In this post, we'll explore a technique we can use to \"fold\" a DOM node, like folding a letter in real-life. On that journey, we'll learn a lot about 3D transforms and CSS animation techniques!",
          "link": "https://www.joshwcomeau.com/react/folding-the-dom/",
          "publishedOn": "2022-01-01T13:00:00.000Z",
          "wordCount": 1583,
          "title": "Folding the DOM"
        }
      ]
    },
    {
      "title": "A List Apart: The Full Feed",
      "feedUrl": "https://alistapart.com/main/feed/",
      "siteUrl": "https://alistapart.com",
      "articles": []
    },
    {
      "title": "Pluralistic: Daily links from Cory Doctorow",
      "feedUrl": "https://pluralistic.net/feed/",
      "siteUrl": "https://pluralistic.net",
      "articles": [
        {
          "id": "https://pluralistic.net/?p=3143",
          "author": "Cory Doctorow",
          "description": "Today's links Podcasting Part II of \"The Internet Heist\": Big Content wants to plug your A-Hole! Comprehensive synthesis of the technological, ecological and political critique of blockchainism: It's all about the externalities. Eating invasive species: How to structure an invasivorism that doesn't hunger for more invaders. This day in history: 2002, 2007, 2012, 2017, 2021 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Podcasting Part II of \"The Internet Heist\" (permalink) This week on my podcast, I read the second part of \"The Internet Heist,\" a series of three articles about the weirdest, most far-reaching, most bonkers battle of the copyright wars of the early 2000s. https://onezero.medium.com/the-internet-heist-part-ii-cb2add31a4fb…",
          "link": "https://pluralistic.net/2022/02/14/externalities/",
          "publishedOn": "2022-02-14T18:49:09.000Z",
          "wordCount": 4684,
          "title": "Pluralistic: 13 Feb 2022",
          "enclosure": {
            "url": "https://archive.org/download/Cory_Doctorow_Podcast_414/Cory_Doctorow_Podcast_414_-_The_Internet_Heist_Part_II.mp3",
            "length": "0",
            "type": "audio/mpeg"
          },
          "imageUrl": null
        },
        {
          "id": "https://pluralistic.net/?p=3134",
          "author": "Cory Doctorow",
          "description": "Today's links The Big Lie that keeps the Uber bezzle alive: A credulous press continues to report massive losses as profitability. This day in history: 2017, 2021 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading The Big Lie that keeps the Uber bezzle alive (permalink) Uber is (still) a bezzle (\"the magic interval when a confidence trickster knows he has the money he has appropriated but the victim does not yet understand that he has lost it\"). And every bezzle – every bezzle – ends. Uber entered the market with an absurd proposition, which they papered over with an idiotic narrative…which the world ate up with a spoon. The absurd proposition: Uber could use apps to reinvent taxis, and turn a low-margin business into a high-margin busines…",
          "link": "https://pluralistic.net/2022/02/11/bezzlers-gonna-bezzle/",
          "publishedOn": "2022-02-11T19:02:50.000Z",
          "wordCount": 3737,
          "title": "Pluralistic: 11 Feb 2022"
        },
        {
          "id": "https://pluralistic.net/?p=3130",
          "author": "Cory Doctorow",
          "description": "Today's links Welcome to the Palmerverse: Ada Palmer's Renaissance-informed science fictional futurism. SEC vs private equity ripoffs: Personnel really are policy. Neuromancer today: Eileen Gunn on the enduring significance and wonder of William Gibson. Gators and Amazon tag-team small sellers: Amazon's bad conduct is good for (a certain kind of) business. This day in history: 2012, 2017, 2021 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Welcome to the Palmerverse (permalink) Today in Wired, Gregory Barber profiles my friend, colleague and collaborator Ada Palmer, an extraordinary writer, librettist, historian, scholar, activist and performer: https://www.wired.com/story/ada-palmer-sci-fi-future-weird-hand-progress/ Palmer has just w…",
          "link": "https://pluralistic.net/2022/02/10/monopoly-begets-monopoly/",
          "publishedOn": "2022-02-10T20:53:37.000Z",
          "wordCount": 3619,
          "title": "Pluralistic: 10 Feb 2022"
        },
        {
          "id": "https://pluralistic.net/?p=3126",
          "author": "Cory Doctorow",
          "description": "Today's links Litigation finance pits greed against greed: There was a late-stage captialism that swallowed a fly… Occupy the SEC on bank mergers: The Herfindahl-Hirschman Index considered harmful. This day in history: 2012, 2017, 2021 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Litigation finance pits greed against greed (permalink) Early in the 19th century, political philosophers like Jeremy Bentham began to rail against champerty, whereby \"unscrupulous nobles and royal officials would lend their names to bolster the credibility of doubtful and fraudulent claims in return for a share of the property recovered.\" https://en.wikipedia.org/wiki/Champerty_and_maintenance#History On its face, the practice of inviting investors to back …",
          "link": "https://pluralistic.net/2022/02/09/grievance-factory/",
          "publishedOn": "2022-02-09T19:17:40.000Z",
          "wordCount": 2845,
          "title": "Pluralistic: 09 Feb 2022"
        },
        {
          "id": "https://pluralistic.net/?p=3120",
          "author": "Cory Doctorow",
          "description": "Today's links Pixels of You: A illustrated tale of love and photos. Wall Street's landlord business is turning every rental into a slum: And they're using public money to do it. UK Tories want a national database of porn-viewing habits: Oh fuck not this bullshit again. This day in history: 2002, 2012, 2017, 2021 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Pixels of You (permalink) Pixels of You is a new young adult sf graphic novel, written by Ananth Hirsh and Yuko Ota and illustrated by Jenn Doyle, published today by Abrams. It's a sweet, smart tale of art, bitterness, enmity and camaraderie. https://www.abramsbooks.com/product/pixels-of-you_9781419749575/ Pixels' two protagonists are a pair of young women who have both won a covet…",
          "link": "https://pluralistic.net/2022/02/08/wall-street-landlords/",
          "publishedOn": "2022-02-08T17:26:45.000Z",
          "wordCount": 3093,
          "title": "Pluralistic: 08 Feb 2022"
        },
        {
          "id": "https://pluralistic.net/?p=3115",
          "author": "Cory Doctorow",
          "description": "Today's links Podcasting part one of \"The Internet Heist\": My origin story, fighting the Broadcast Flag. This day in history: 2012, 2017, 2021 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Podcasting part one of \"The Internet Heist\" (permalink) This week on my podcast, I read the first part of \"The Internet Heist,\" a three-part series I wrote for Medium on the \"Broadcast Flag,\" which was invented 20 years ago, on my first day on the job at EFF. It's basically my origin-story. https://onezero.medium.com/the-internet-heist-part-i-3395769891b0 The Broadcast Flag was an incredibly gnarly, high-stakes digital technology issue. It combined no fewer than three esoteric fields – spectrum allocation, computer science, and copyright – and threa…",
          "link": "https://pluralistic.net/2022/02/07/broadcast-flag/",
          "publishedOn": "2022-02-07T16:41:17.000Z",
          "wordCount": 1851,
          "title": "Pluralistic: 07 Feb 2022",
          "enclosure": {
            "url": "https://archive.org/download/Cory_Doctorow_Podcast_413/Cory_Doctorow_Podcast_413_-_The_Internet_Heist_Part_I.mp3",
            "length": "0",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://pluralistic.net/?p=3111",
          "author": "Cory Doctorow",
          "description": "Today's links Explaining UK Fair Dealing with Simpsons clips: An update to the classic \"Fair(y) Use.\" Woody Guthrie, Songs and Art * Words and Wisdom: 332 pages of inspiration, joy and fascinating tales of a true American hero. This day in history: 2002, 2007, 2012, 2017, 2021 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Explaining UK Fair Dealing with Simpsons clips (permalink) It's been 15 years since Bucknell U film prof Eric Faden made \"A Fair(y) Tale,\" a short film that explains fair use by stringing together short, fair-use-qualifying clips from Disney movies. It remains an amazing accomplishment! https://www.youtube.com/watch?v=BeKFAM892k4 Fair(y) Tale took 9 months to piece together as Faden painstakingly searched the corpus …",
          "link": "https://pluralistic.net/2022/02/06/this-land-is-your-land/",
          "publishedOn": "2022-02-06T15:28:07.000Z",
          "wordCount": 1972,
          "title": "Pluralistic: 06 Feb 2022"
        },
        {
          "id": "https://pluralistic.net/?p=3104",
          "author": "Cory Doctorow",
          "description": "Today's links How to design an anti-monopoly interop system: On the colossal bad faith of Subaru and Kia. This day in history: 2002, 2007, 2021 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading How to design an anti-monopoly interop system (permalink) A historical accident made Massachusetts a lab for studying how tech can serve monopolies, and the moves, countermoves and counter-countermoves show how businesses, tinkerers, governments and the public can liberate themselves from seemingly all-powerful monopolists. It all starts with Right to Repair. Companies love to monopolize the repair of their products. If the only place to get your broken stuff fixed is at its manufacturer's authorized depots, the manufacturer can move all kinds of v…",
          "link": "https://pluralistic.net/2022/02/05/time-for-some-game-theory/",
          "publishedOn": "2022-02-05T18:47:31.000Z",
          "wordCount": 3914,
          "title": "Pluralistic: 05 Feb 2022"
        },
        {
          "id": "https://pluralistic.net/?p=3095",
          "author": "Cory Doctorow",
          "description": "Today's links A covid vaccine for your airways: The promising science of nasal spray vaccines. Rail monopolies destroyed the American supply chain: Heads they win, tails we lose. This day in history: 2012, 2017, 2021 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading A covid vaccine for your airways (permalink) The covid vaccine picture is awfully confusing. The current vaccines are doing a great job of preventing serious illness (at least, for people who are boosted), but they're not nearly so effective at preventing infection and transmission. What's more, the new variants are more contagious and less likely to cause severe infection, but they also appear to confer less immunity against re-infection: https://www.bloomberg.com/news/articl…",
          "link": "https://pluralistic.net/2022/02/04/up-your-nose/",
          "publishedOn": "2022-02-04T18:55:43.000Z",
          "wordCount": 2554,
          "title": "Pluralistic: 04 Feb 2022"
        },
        {
          "id": "https://pluralistic.net/?p=3090",
          "author": "Cory Doctorow",
          "description": "Today's links Money is power: A political economy parable (with a side of environmental racism). When crypto-exchanges go broke, you'll lose it all: The fatal flaw in the \"neither fish nor fowl\" gambit (there is such a thing as society). This day in history: 2017 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Money is power (permalink) \"Political economy\" may sound like an obscure technical matter, but it's a really very simple (and incredibly important) idea: That the economy is inevitably political, and there is no way to depoliticize economic theory. That is, every aspect of economics – taxation, antitrust, contract and labor law, etc – is fundamentally political. There is no objective perch on which an economist can stand and decid…",
          "link": "https://pluralistic.net/2022/02/03/liquidation-preference/",
          "publishedOn": "2022-02-03T20:23:37.000Z",
          "wordCount": 3418,
          "title": "Pluralistic: 03 Feb 2022"
        },
        {
          "id": "https://pluralistic.net/?p=3080",
          "author": "Cory Doctorow",
          "description": "Today's links To fight inflation, fight monopolies: Cartels raise prices using supply chain and \"generous\" benefits as cover for price-gouging. How noncompetes shackle workers to dead-end jobs: \"You can't work for anyone who competes with Amazon for the next 18 months.\" Agricultural right to repair law is a no-brainer: Farmer-tinkerer solidarity. This day in history: 2002, 2007, 2012, 2017, 2021 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading To fight inflation, fight monopolies (permalink) The majority of the public blames inflation on price-gouging. That's not surprising, because the CEOs of monopolistic companies keep boasting about their record profits even as they raise prices. If a company raises prices and margins, then we don't …",
          "link": "https://pluralistic.net/2022/02/02/its-the-economy-stupid/",
          "publishedOn": "2022-02-02T18:25:02.000Z",
          "wordCount": 3047,
          "title": "Pluralistic: 02 Feb 2022"
        },
        {
          "id": "https://pluralistic.net/?p=3070",
          "author": "Cory Doctorow",
          "description": "Today's links The Mafia hires good accountants: Honest cheaters enable the mob. This day in history: 2007, 2012, 2017, 2021 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading The Mafia hires good accountants (permalink) High-profile leaks like the Pandora Papers and financial collapses like Carillion have shone a spotlight on the role that \"the professions\" play in enabling international finance crimes, which include both money-laundering and the underlying (ghastly, violent) crimes that produce the money to be laundered. For example, the Sackler family knowingly and deliberately created the opioid epidemic that has killed more than 800,000 Americans so far, and then used the best, most respectable, highest price bankruptcy lawyers in the …",
          "link": "https://pluralistic.net/2022/02/01/collaborators-not-fools/",
          "publishedOn": "2022-02-01T15:37:52.000Z",
          "wordCount": 1705,
          "title": "Pluralistic: Feb 01 2022"
        },
        {
          "id": "https://pluralistic.net/?p=3061",
          "author": "Cory Doctorow",
          "description": "Today's links Grappling with Big Wrestling: Vince McMahon has a monopoly on violence. Podcasting about the copyleft trolls who tried to shake me down: Pixsy and the depravity of speculative invoicing. This day in history: 2002, 2012, 2017, 2021 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Grappling with Big Wrestling (permalink) If you're a Very Online person, it's easy to think that tech is a uniquely monopolized industry. How could you not – anyone over the age of 30 has had a front row seat for the transformation of the wild and wooly early web into \"a group of five websites, each consisting of screenshots of text from the other four.\" https://twitter.com/tveastman/status/1069674780826071040 There's a chorus of captured economists…",
          "link": "https://pluralistic.net/2022/01/31/heel-turn/",
          "publishedOn": "2022-01-31T19:22:36.000Z",
          "wordCount": 2808,
          "title": "Pluralistic: 31 Jan 2022",
          "enclosure": {
            "url": "https://archive.org/download/Cory_Doctorow_Podcast_412/Cory_Doctorow_Podcast_412_-_A_Bug_in_Early_Creative_Commons_Licenses.mp3",
            "length": "0",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://pluralistic.net/?p=3055",
          "author": "Cory Doctorow",
          "description": "Today's links The battle for Ring Zero: The esoteric argument I have been having with myself since 2002. This day in history: 2002, 2017, 2021 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading The battle for Ring Zero (permalink) In Bruce Sterling's Locus review of my novel Walkaway, he describes the book as \"advancing and demolishing potential political arguments that have never been made by anybody but [me].\" That is a fair cop. I spend a lot of time worrying about esoteric risks that no one else seems to care about. https://locusmag.com/2017/06/bruce-sterling-reviews-cory-doctorow/ For example: for twenty years now, I have been worrying about the shifting political, technical and social frameworks that govern our fundamental relationsh…",
          "link": "https://pluralistic.net/2022/01/30/ring-minus-one/",
          "publishedOn": "2022-01-30T20:10:24.000Z",
          "wordCount": 3672,
          "title": "Pluralistic: 30 Jan 2022"
        },
        {
          "id": "https://pluralistic.net/?p=3049",
          "author": "Cory Doctorow",
          "description": "Today's links No, payday lenders aren't nice guys: Won't someone think of the poor usurers? The Right to Repair: A stupendous new book on a very urgent subject. This day in history: 2002, 2017, 2021 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading No, payday lenders aren't nice guys (permalink) \"It is difficult to get a man to understand something when his salary depends upon his not understanding it.\" That quote from Upton Sinclair reveals the ideological underpinnings of consequential errors by economists that lead to material, negative consequences for poor people. Here's one of those errors. A pair of economists, one associated with the the far-right Scalia Center at George Mason University, performed a deeply flawed analysis of payd…",
          "link": "https://pluralistic.net/2022/01/29/planned-obsolescence/",
          "publishedOn": "2022-01-29T17:40:32.000Z",
          "wordCount": 2056,
          "title": "Pluralistic: 29 Jan 2022"
        },
        {
          "id": "https://pluralistic.net/?p=3044",
          "author": "Cory Doctorow",
          "description": "Today's links California's chance for universal health care: It would save taxpayers trillions. This day in history: 2002, 2007, 2012, 2017, 2021 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading California's chance for universal health care (permalink) \"American exceptionalism\" usually refers to Americans letting themselves off the hook for the sins they condemn in others (mass incarceration, death penalty, voter suppression, book burning, etc). But there's another kind of implicit exceptionalism, practiced by elites in service to the status quo: the belief that Americans are exceptionally stupid Nowhere is this negative exceptionalism more obvious than in American health-care debates, where the cost of providing universal healthcare is …",
          "link": "https://pluralistic.net/2022/01/28/american-exceptionalism/",
          "publishedOn": "2022-01-28T18:22:58.000Z",
          "wordCount": 2024,
          "title": "Pluralistic: 28 Jan 2022"
        },
        {
          "id": "https://pluralistic.net/?p=3038",
          "author": "Cory Doctorow",
          "description": "Today's links As stocks tumble, wealthy speculators bid up house prices: The long-run effect of Obama's choice to bail out lenders, not borrowers. Cops' imaginary fears send addicts to real jail: The deadly myth of the fentanyl contact high. This day in history: 2002, 2007, 2012, 2017, 2021 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading As stocks tumble, wealthy speculators bid up house prices (permalink) The Obama administration's most consequential decision was to address the Great Financial Crisis by bailing out the finance sector, rather than borrowers. It was an unforced error, directed by Goldman-Sachs bankers elevated to the ranks of finance regulators, and we are still living with its consequences. The choice to enact quantitat…",
          "link": "https://pluralistic.net/2022/01/27/extraordinary-popular-delusions/",
          "publishedOn": "2022-01-27T18:02:12.000Z",
          "wordCount": 2709,
          "title": "Pluralistic: 27 Jan 2022"
        },
        {
          "id": "https://pluralistic.net/?p=3007",
          "author": "Cory Doctorow",
          "description": "Today's links Personnel are policy: The Dems may do something to materially improve voters' lives. Maybe. Podcasting \"Science fiction is a Luddite Literature\": My last pre-op podcast. This day in history: 2002, 2007, 2012, 2017, 2021 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Personnel are policy (permalink) It's hard not to freak out, watching Biden get punked by Joe Manchin over Build Back Better. Manchin's transparent ruse – splitting the infrastructure bill from BBB – was obviously a prelude to a betrayal. Thanks to Dem leadership's foolish error, the party that holds the House, the Senate and the Oval Office will go into the mid-terms and the next presidential election having failed to deliver on the vast majority of their cam…",
          "link": "https://pluralistic.net/2022/01/10/see-you-in-the-funny-papers/",
          "publishedOn": "2022-01-10T16:16:36.000Z",
          "wordCount": 2022,
          "title": "Pluralistic: 10 Jan 2022",
          "enclosure": {
            "url": "https://ia801504.us.archive.org/27/items/Cory_Doctorow_Podcast_411/Cory_Doctorow_Podcast_411_-_Science_Fiction_is_a_Luddite_literature.mp3",
            "length": "21667840",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://pluralistic.net/?p=2998",
          "author": "Cory Doctorow",
          "description": "Today's links Jackpot watch: How the klept operates in the UK. This day in history: 2007, 2012, 2017, 2021 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Jackpot watch (permalink) In his 2014 novel The Peripheral, William Gibson plunges us into a far-future London, radically depopulated, quietly authoritarian, and under the iron thumb of \"the Klept\" – a fusion of the British chumocracy with post-Soviet Eurasian kleptoracy. https://memex.craphound.com/2014/10/28/the-peripheral-william-gibson-vs-william-gibson/ The origins of this society – its depopulation, its neo-aristocracy, its captivity to inscrutable AIs called \"the Aunties\" are lost to history. They all took place during a time called \"The Jackpot,\" an interregnum where huge swat…",
          "link": "https://pluralistic.net/2022/01/07/the-klept/",
          "publishedOn": "2022-01-07T17:01:31.000Z",
          "wordCount": 2685,
          "title": "Pluralistic: 07 Jan 2022"
        },
        {
          "id": "https://pluralistic.net/?p=2991",
          "author": "Cory Doctorow",
          "description": "Today's links Hospital beds are a monopoly: The casket to hospital bed monopoly pipeline. This day in history: 2007, 2017, 2021 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Hospital beds are a monopoly (permalink) The great James Boyle tells an important parable about the coining of the term \"ecology.\" Before the term came into wide use, the \"ecology movement\" as we know it was just a bunch of fragmented, seemingly disconnected issues. https://thepublicdomain.org/thepublicdomain1.pdf Like, if you're worried about owls and I'm worried about the ozone layer, it's not immediately apparent that we're fighting the same fight. It's not intuitive to link the fate of charismatic nocturnal avians to the gaseous composition of the upper atmosp…",
          "link": "https://pluralistic.net/2022/01/05/hillrom/",
          "publishedOn": "2022-01-05T16:21:05.000Z",
          "wordCount": 2705,
          "title": "Pluralistic: 05 Jan 2022"
        },
        {
          "id": "https://pluralistic.net/?p=2985",
          "author": "Cory Doctorow",
          "description": "Today's links Science fiction is a Luddite literature: My latest column for Locus Magazine. Neal Stephenson's 'Termination Shock': Geoengineering and the end of the world. Stellar images of quack exercise machines: A memento mori for anyone flexing in lycra on a Peleton. This day in history: 2002, 2007, 2012, 2017 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Science fiction is a Luddite literature (permalink) My latest column for Locus Magazine is \"Science Fiction is a Luddite Literature,\" and it's my contribution to the burgeoning movement to rehabilitate the reputation of the Luddite uprisings, overturning the libel that Luddites were motivated by a fear of technology: https://locusmag.com/2022/01/cory-doctorow-science-fiction-is-a…",
          "link": "https://pluralistic.net/2022/01/04/general-ludd/",
          "publishedOn": "2022-01-04T17:07:38.000Z",
          "wordCount": 3168,
          "title": "Pluralistic: 04 Jan 2022"
        },
        {
          "id": "https://pluralistic.net/?p=2973",
          "author": "Cory Doctorow",
          "description": "Today's links Happy Public Domain Day: The public domain continues to roar back after decades in a coma. 2021 Daddy-Daughter podcast: The latest in a lengthy series. This day in history: 2002, 2007 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Happy Public Domain Day (permalink) On January 1, 2019 something extraordinary happened. For the first time since 1998, the American public domain got bigger. What happened in 1998? Congress – led by Rep Sonny Bono – extended the copyright on all works by 20 years. Works that had already been in the public domain went back into copyright. Works that were in copyright got an extra 20 years. The public domain…froze. This was a wanton, destructive act. The vast majority of works that the Sonny Bono…",
          "link": "https://pluralistic.net/2022/01/03/party-like-its-1926/",
          "publishedOn": "2022-01-03T16:28:58.000Z",
          "wordCount": 2534,
          "title": "Pluralistic: 03 Jan 2022",
          "enclosure": {
            "url": "https://archive.org/download/Cory_Doctorow_Podcast_410/Cory_Doctorow_Podcast_410_-_Daddy-Daughter_Podcast_2021_Edition.mp3",
            "length": "0",
            "type": "audio/mpeg"
          }
        }
      ]
    },
    {
      "title": "The Candybox Blog",
      "feedUrl": "http://www.nathalielawhead.com/candybox/feed",
      "siteUrl": "http://www.nathalielawhead.com/candybox",
      "articles": [
        {
          "id": "http://www.nathalielawhead.com/candybox/?p=5275",
          "author": "alienmelon",
          "description": "I’m going to try something new for this blog and that will be roundups of recommended reading. Here is the first! There’s a lot that I usually don’t get to share on my social media because that space is heavily game’s focused… so I thought of saving informative things I read, or quality resource, and then regularly sharing them on my blog. I’m also going to try to focus on sharing things relating to marginalized groups in Europe, as they relate to my own family’s history or (complicated) identity (Eastern Europe and the Balkans). I don’t get to talk about...",
          "link": "http://www.nathalielawhead.com/candybox/recommended-reading-roundup-1",
          "publishedOn": "2022-02-07T00:15:16.000Z",
          "wordCount": 2046,
          "title": "Recommended Reading Roundup #1"
        },
        {
          "id": "http://www.nathalielawhead.com/candybox/?p=5260",
          "author": "alienmelon",
          "description": "So here’s a dream come true for my work, and I’m dedicating an entire blog post to this very cool news… My work is on Rhizome again! Artist Profile: Nathalie Lawhead By Ryan Kuo https://rhizome.org/editorial/2022/feb/01/artist-profile-nathalie-lawhead/ Everything is going to be OK Rhizome Artbase https://artbase.rhizome.org/wiki/Q12199 “Everything is going to be OK” was recently included in the Rhizome Artbase. They put out a call for submissions for their executable poetry project. It seemed perfect. “Everything is going to be OK” very much fits that description because it features so much poetry. Then Ryan Kuo asked if I wanted to collaborate on an...",
          "link": "http://www.nathalielawhead.com/candybox/exciting-news-im-on-rhizome-artbase-and-artist-profile",
          "publishedOn": "2022-02-01T20:30:29.000Z",
          "wordCount": 1263,
          "title": "Exciting news: I’m on Rhizome!! (Artbase and Artist Profile)"
        },
        {
          "id": "http://www.nathalielawhead.com/candybox/?p=5249",
          "author": "alienmelon",
          "description": "I have been heavily invested in learning Unreal and Blender. I announced that I wanted to make a 3D game, so this is my trajectory for the foreseeable future. I’ve been keeping a development update thread on Twitter. It’s fun to track it! update: i finished modeling a bunch of trees (enough for variety) and finally got the procedural forest running.it's so cool and spooky!! i was right too. the god rays + trees are intense. the light effect is amazing too. i love this.can't wait to get some good fog into this… https://t.co/E6OeK0h3Wz pic.twitter.com/DjqcVh9vcv — Nathalie Lawhead (@alienmelon) January...",
          "link": "http://www.nathalielawhead.com/candybox/revisiting-bluesuburbia-in-unreal-an-update-on-what-ive-been-up-to",
          "publishedOn": "2022-01-28T00:25:12.000Z",
          "wordCount": 3504,
          "title": "Revisiting BlueSuburbia in Unreal (an update on what I’ve been up to)"
        },
        {
          "id": "http://www.nathalielawhead.com/candybox/?p=5236",
          "author": "alienmelon",
          "description": "Yesterday GameJolt emailed a lot of people saying that their game was removed because the site’s new policy bans any game that “depicts, solicits, promotes, normalizes, or glorifies sexual acts, sexual solicitation, and sexual violence“. I got an email too for F2OGGY (Only one survives!). This seemed like an obvious error to me because this game has 0 depiction of anything sexual. The game Curtain also received this notice… Source: https://twitter.com/ldreamfeel/status/1478065400286007304 Curtain is a brilliant and critically acclaimed work of art that interrogates abuse. It’s far from a porn game. “CURTAIN is an interactive first-person narrative about Kaci & Ally,...",
          "link": "http://www.nathalielawhead.com/candybox/on-gamejolts-new-policy-why-stigmatizing-sex-in-games-is-harmful-to-the-medium-and-never-works",
          "publishedOn": "2022-01-04T22:53:16.000Z",
          "wordCount": 3706,
          "title": "On GameJolt’s new policy: why stigmatizing “sex” in games is harmful to the medium and never works…"
        },
        {
          "id": "http://www.nathalielawhead.com/candybox/?p=5229",
          "author": "alienmelon",
          "description": "~ This post is my epic roundup of recommendations for 202x! ~ When we talk about games, especially the indie game space, most of the games we suggest are ones with lots of critical acclaim, playtime, and that demand plenty of involvement. Playing a game these days feels like as much of a financial investment as it becomes a life investment. I find myself drawn more and more to spelunking itch.io for tiny hidden gems… getting lost while diving into all the developer pages filled with all these odd little works. Browsing itch or GameJolt has become almost as rewarding...",
          "link": "http://www.nathalielawhead.com/candybox/tiny-indiegames-and-the-joy-of-very-small-things",
          "publishedOn": "2021-12-30T01:53:05.000Z",
          "wordCount": 4744,
          "title": "Tiny indiegames and the joy of Very Small Things"
        },
        {
          "id": "http://www.nathalielawhead.com/candybox/?p=5209",
          "author": "alienmelon",
          "description": "I’ve been wanting to do another post talking about indie games, analyzing game design, and showcasing good examples from the indie space but… I’m struggling a lot with being afraid of unintentionally platforming an abuser. I know saying that out loud sounds irrational, maybe. It’s been hard finding love for a space that I feel like happily decided people like me are a justifiable loss if it means making snarky Twitter Takes about what they’re going through… or just benefiting from indifference. I don’t know anymore… I don’t want to rant. I want to talk about game design. It’s hard...",
          "link": "http://www.nathalielawhead.com/candybox/red-dead-redemption-2-as-a-commentary-on-the-game-industry-my-love-hate-relationship-with-it",
          "publishedOn": "2021-12-21T03:59:32.000Z",
          "wordCount": 5215,
          "title": "Red Dead Redemption 2 as a commentary on The Game Industry (my love–hate relationship with it)",
          "enclosure": {
            "url": "http://nathalielawhead.com/noodles/rdr2-screenshots/cleaningtheair.mp4",
            "length": "27823182",
            "type": "video/mp4"
          }
        }
      ]
    }
  ],
  "cliVersion": "1.14.4"
}