{
  "sources": [
    {
      "title": "Christian Heilmann",
      "feedUrl": "https://christianheilmann.com/feed/",
      "siteUrl": "https://christianheilmann.com",
      "articles": [
        {
          "id": "https://christianheilmann.com/?p=7063",
          "author": "Chris Heilmann",
          "description": "After 25 years of working for, on and with the web, I am looking at the current state of it and I don’t like it. There is still a lot of beautiful, creative and amazing work out there, but on the whole, we lost an amazing opportunity. In its place we have a consumption machine […]",
          "link": "https://christianheilmann.com/2021/12/20/the-web-starts-on-page-four/",
          "publishedOn": "2021-12-20T18:06:05.000Z",
          "wordCount": 1726,
          "title": "The web starts on page four"
        },
        {
          "id": "https://christianheilmann.com/?p=7045",
          "author": "Chris Heilmann",
          "description": "Testing for accessibility is an incredibly important part of your development process. Products that don’t block out users because of easy to avoid issues have more success. And the longer you wait with fixing accessibility problems, the harder it gets. That’s why it is annoying when it is hard to find out about accessibility problems. […]",
          "link": "https://christianheilmann.com/2021/11/18/lets-not-send-developers-to-the-accessibility-tree-tool/",
          "publishedOn": "2021-11-18T17:14:58.000Z",
          "wordCount": 801,
          "title": "Let’s not send developers to the accessibility tree tool"
        },
        {
          "id": "https://christianheilmann.com/?p=7038",
          "author": "Chris Heilmann",
          "description": "Interfaces on the web have to be accessible independent of input device. In addition to using the right HTML to make it possible to activate functionality with mouse, keyboard, voice activation or any of the possible ways it is also important to have a visual indicator which element is currently active. This is why we […]",
          "link": "https://christianheilmann.com/2021/11/07/quick-browser-developer-tools-tip-define-and-test-interaction-states-in-css-using-state-simulation/",
          "publishedOn": "2021-11-07T15:58:36.000Z",
          "wordCount": 389,
          "title": "Quick browser Developer Tools tip: define and test interaction states in CSS using state simulation"
        }
      ]
    },
    {
      "title": "Hundred Rabbits",
      "feedUrl": "https://100r.co/links/rss.xml",
      "siteUrl": "https://100r.co",
      "articles": [
        {
          "id": "log.html#dec2021",
          "author": "Rekka Bellum",
          "description": "Hey everyone! This is the list of all the changes we've done to our projects and apps during the month of December. We'll also be reporting in our on position in the world, and on our future plans.\nSummary Of Changes\nGrimgrains, published a tofu from soy flour recipe, and reduced the amount of ingredients appearing on the main page so it loads faster.\nLeft, created inline image support, and implemented a search feature(Birdsite) inspired by the Canon Cat(1987)'s LEAP™ key.\nCat Clock, released our very own cat clock.\nTurye, released a font editor.\nTGA parser, released a tool to make it easier to bring images into the Uxn ecosystem.\nWunderland Rabbits, released a new image.\nNews\nIt is snowing, and we are cocooning. Our little woodstove is working hard. This month, we finally decided to release a paperback version of Busy Doing Nothing.\nIn our last update log, we mentioned that we were trying to grow Lion's Mane mushroom, and we are happy to report that it was a success! It grew beautifully. Rek was so excited about the mushroom that they decided to draw some this month, this series focuses on varieties that grow on Vancouver Island.\nIn other news, we had an interview with the founder of Sourcehut, read it here. Also, our good friend Alderwick make us a very cool gift(YouTube).\nPino book club\nWe're reading Fantômes: Issue 1, with work by 18 talented artists, put together by Lizbeth. It is a eerie, and gorgeous zine, we strongly recommend the Mike Wolf version.\nPino's location: 48° 42.230'N, 123° 36.900'W\nContinue Reading",
          "link": "https://100r.co/site/log.html#dec2021",
          "publishedOn": "2021-12-31T00:00:00.000Z",
          "wordCount": 6478,
          "title": "Summary of changes for December"
        },
        {
          "id": "log.html#nov2021",
          "author": "Rekka Bellum",
          "description": "Hey everyone! This is the list of all the changes we've done to our projects and apps during the month of November. We'll also be reporting in our on position in the world, and on our future plans.\nSummary Of Changes\nDonsol, designed a donsol turnip.\nUxn, wrote a file browser rom(Mastodon), improved on uxn utilities (clock, calculator(both YouTube)).\nNasu, added nametable to preview items on the spritesheet, and added option to flip a sprite horizontally or vertically in the blend view.\n100r, added an information section on {drownspire}, the studio we had prior to hundredrabbits.\nOquonie, started tests to port the game to Uxntal(Birdsite).\nLeft, fixed bugs and improved speed.\nNews\nThis month, there was an intro to Uxn Programming(YouTube) workshop by Compudanzas, an event by Babycastles Academy. Give it a watch!\nNovember was a very rainy month in Victoria, a perfect time for experiments in the galley. We are growing Lion's Mane mushrooms currently (a first for us), and we are continuing to lacto-ferment vegetables like kohlrabi, turnips, daikon, cauliflower and red onion. To learn how to do it, see our guide to lactofermentation.\nPino book club\nWe're reading The Summer Book by Tove Jansson (it's such a lovely book).\nPino's location: 48° 42.230'N, 123° 36.900'W\nContinue Reading",
          "link": "https://100r.co/site/log.html#nov2021",
          "publishedOn": "2021-12-01T00:00:00.000Z",
          "wordCount": 6253,
          "title": "Summary of changes for November"
        }
      ]
    },
    {
      "title": "Blog on SaraSoueidan.com",
      "feedUrl": "https://www.sarasoueidan.com/blog/index.xml",
      "siteUrl": "https://sarasoueidan.com/blog/",
      "articles": []
    },
    {
      "title": "there.oughta.be/",
      "feedUrl": "https://there.oughta.be/feed.xml",
      "siteUrl": "https://there.oughta.be/",
      "articles": [
        {
          "id": "https://there.oughta.be/a/wifi-game-boy-cartridge",
          "author": null,
          "description": "It took a while, but I finally managed to create my own Game Boy cartridge. With WiFi! At this point, it can only demo a simple telnet-style communication and access Wikipedia articles, but I am confident that I will showcase more in the future. For now, the interesting and surprisingly tricky part is how the thing works at all. Click the image to see the video on youtube.com. If you just want to see the cartridge in action or want to get into all the details, I highly recommend to watch the video first as it goes through the difficulties and their respective solutions. In contrast, this article here is less visual in its explanations and mostly documents the device in detail, so unless you are already familiar with the parallel memory interface of the Game Boy, you might want to start with the overview from the video.",
          "link": "https://there.oughta.be/a/wifi-game-boy-cartridge",
          "publishedOn": "2021-12-15T23:00:00.000Z",
          "wordCount": 5880,
          "title": "There oughta be a WiFi Game Boy cartridge."
        }
      ]
    },
    {
      "title": "Grumpy Gamer",
      "feedUrl": "https://grumpygamer.com/rss",
      "siteUrl": "https://grumpygamer.com",
      "articles": [
        {
          "id": "https://grumpygamer.com/the_future",
          "author": null,
          "description": "Well, it's 2022 and everything is turning out exactly as I predicted back when I was 7. Self-driving cars, space stations, the internet.  Nailed it.\nFavorite TV show of 2021 was Only Murders in the Building.  \nFavorite game of 2021 was Loop Heroes. \nFavorite book of 2021 was Einstein's Fridge.\nFavorite rediscovered joy of 2021 was reading physical books.\nFavorite movie of 2021 was Dune.\nFavorite time waster of 2021 was watching physics videos on YouTube.\nLeast favorite movie of 2021 was anything with f**king superheroes.\nFavorite pandemic of 2021 was Covid-19 (three years running).\nSee you in an exciting 2022 where everyone will be nice and respectful and personal agendas are put aside for the greater good and we all come together and save the planet. \nEither that or a horrific dystopian post-apocalyptic world where we hunt each other for food.\n2022 could go either way.",
          "link": "https://grumpygamer.com/the_future",
          "publishedOn": "2022-01-01T02:01:21.000Z",
          "wordCount": 384,
          "title": "2021"
        },
        {
          "id": "https://grumpygamer.com/lego8",
          "author": null,
          "description": "That didn't take long to fix and rebuild. I don't know what is taking the city of Rome so long.\n\nStart to finish, it took just over a year. I blame Limited Run Games.",
          "link": "https://grumpygamer.com/lego8",
          "publishedOn": "2021-12-27T18:54:48.000Z",
          "wordCount": 108,
          "title": "Lego Report 8"
        },
        {
          "id": "https://grumpygamer.com/lego7",
          "author": null,
          "description": "Placing the last piece.\n\nAnd then disaster stuck while moving it.\n\nMost of the debris is still assembled large chucks, so it shouldn't take long to fix.  I'm sure this happened to the real coliseum.",
          "link": "https://grumpygamer.com/lego7",
          "publishedOn": "2021-12-27T02:09:08.000Z",
          "wordCount": 189,
          "title": "Lego Report 7"
        },
        {
          "id": "https://grumpygamer.com/12_days_of_crunch_time_yet_again",
          "author": null,
          "description": "Holiday repost!\nClayton and I did this back in Dec of 2004.  Interesting how much hasn't changed. I'd have more \"male\" spouses now, something about loot crates and IAP, kissing up to steamers, and maybe change the last verse to be more \"indie\", but its shockingly accurate years later.\nThe Twelve Days of Crunch Time\nA poem by Gilbert and Kauzlaric\nOn the twelfth day of crunch time,\nMy project gave to me...\n\nTwelve cents in royalties,\n\nEleven kiss-ass previews,\n\nTen nerdy testers,\n\nNine patent lawsuits,\n\nEight unplanned for features,\n\nSeven frames a second,\n\nSix angry spouses,\n\nFive focus groups!\n\nFour unstable hacks,\n\nThree days without sleep,\n\nTwo surly artists,\n\nand a crappy publishing deal.",
          "link": "https://grumpygamer.com/12_days_of_crunch_time_yet_again",
          "publishedOn": "2021-12-25T17:56:05.000Z",
          "wordCount": 207,
          "title": "The Twelve Days of Crunch Time Again"
        },
        {
          "id": "https://grumpygamer.com/lego6",
          "author": null,
          "description": "We should be done in time for the upcoming gladiator '22 season.  Tickets are still available. I hear Ferocianus Maximus is going to do well this year.",
          "link": "https://grumpygamer.com/lego6",
          "publishedOn": "2021-12-22T22:03:50.000Z",
          "wordCount": 95,
          "title": "Lego Report 6"
        },
        {
          "id": "https://grumpygamer.com/lego5",
          "author": null,
          "description": "After 7000 signatures, some progress.  I am getting help.",
          "link": "https://grumpygamer.com/lego5",
          "publishedOn": "2021-12-12T21:35:16.000Z",
          "wordCount": 77,
          "title": "Lego Report 5"
        },
        {
          "id": "https://grumpygamer.com/lrg_signing",
          "author": null,
          "description": "Last month I finally got done signing over 7000 cards for the Limited Run Games physical release of Monkey Island.\nThey asked if I would hand sign cards to go in the boxes.  Sure, how many can that be?  500?  800?\nNope.\nThey had over 7000 preorders and I signed every one of those cards.  If you bought one of the LRG Monkey Island boxes you won't get a Certificate of Authenticity with a crappy machine printed signature. \nI signed them all. \nI even left a few special messages on the backs.",
          "link": "https://grumpygamer.com/lrg_signing",
          "publishedOn": "2021-11-19T00:00:00.000Z",
          "wordCount": 420,
          "title": "7000 Signatures later..."
        },
        {
          "id": "https://grumpygamer.com/make_your_own_game_engine",
          "author": null,
          "description": "At first I was going to just copy/paste his article and call it my own then I realized that is kind of a dick move.\nHow to make your own game engine (and why) by Tyler Glaiel\nWell worth a read.\nIn my 35+ year career in games I've never used an off the shelf game engine.  Starting with SCUMM I've always build my own.  I love the power and the freedom.  It's hard work and probably cost me more but I love making game engines and writing compilers.  It's a skill you slowly acquire and after the 5th one it's not a daunting task anymore.\nI ran into a programmer at an indie meet-up and she told me this story about how another programmer at her company brought up building their own game engine.  Someone responded with \"What! Are you Ron Gilbert!\"\nI wear that as a badge of honor.  😀",
          "link": "https://grumpygamer.com/make_your_own_game_engine",
          "publishedOn": "2021-11-12T00:00:00.000Z",
          "wordCount": 299,
          "title": "How to make your own game engine"
        },
        {
          "id": "https://grumpygamer.com/dystopia",
          "author": null,
          "description": "Yes, I'm tired of dystopia fiction. A sentiment I probably didn't need to repeat because it's in the title, but I really am.  Nothing points this out more to me than Star Trek.\nIn a Star Trek vs. Star Wars internet argument I am firmly in the Star Trek camp and this is with eight years of working at The Death Star Lucasfilm (I kid, working at Lucasfilm was magical but I'm still a Star Trek person).\nStar Trek used be be about hope.  Even in the dark days of the 1960's cold war you could see hope for our future in Star Trek. They mange to comment on our then messed up world while being optimistic about the future. It's a lesson current Star Trek could learn from.\nNext Generation followed in that tradition. There was conflict but also hope in what the future could be.\nVoyager was still about …",
          "link": "https://grumpygamer.com/dystopia",
          "publishedOn": "2021-11-11T00:00:00.000Z",
          "wordCount": 2807,
          "title": "I'm tired of dystopia fiction"
        },
        {
          "id": "https://grumpygamer.com/twitter_part2",
          "author": null,
          "description": "I've decided to go back on Twitter but with a few changes:\nI unfollowed everyone. \nI will only post once (or maybe twice) a week.\nI only check twitter once every 1 or 2 days.\nI will only post positive things and mostly about game dev.\nI will not add rubbish to the Twitter dumpster fire.\nI used to follow 200+ people and now I follow 0. I apologize if I unfollowed you. It doesn't mean I love you any less. I might follow people at some point, but only friendly positive people.\nI left Twitter because it was doing serious mental damage to me. \nMaybe, just maybe this will help make twitter a better place.",
          "link": "https://grumpygamer.com/twitter_part2",
          "publishedOn": "2021-11-10T00:00:00.000Z",
          "wordCount": 1102,
          "title": "Twitter"
        }
      ]
    },
    {
      "title": "Emily Short's Interactive Storytelling",
      "feedUrl": "https://emshort.blog/feed/",
      "siteUrl": "https://emshort.blog",
      "articles": [
        {
          "id": "http://emshort.blog/?p=42242",
          "author": "Emily Short",
          "description": "Events Running for a week starting January 1 on itch is the Historically Accurate Game Jam. This isn’t specifically an IF competition, and games of all types are welcome, as long as they’re written in a week and address the chosen time period or event of the jam. If you’ve had a craving to contribute … Continue reading \"End of December Link Assortment\"",
          "link": "https://emshort.blog/2021/12/31/end-of-december-link-assortment-6/",
          "publishedOn": "2021-12-31T17:30:00.000Z",
          "wordCount": 1805,
          "title": "End of December Link Assortment"
        },
        {
          "id": "http://emshort.blog/?p=42239",
          "author": "Emily Short",
          "description": "Events January 1 is currently scheduled as the next meetup of the SF Bay Interactive Fiction Meetup, but given that that is New Year’s Day, it’s possible that that will change. Running for a week starting January 1 on itch is the Historically Accurate Game Jam. This isn’t specifically an IF competition, and games of … Continue reading \"Mid-December Link Assortment\"",
          "link": "https://emshort.blog/2021/12/15/mid-december-link-assortment-6/",
          "publishedOn": "2021-12-15T17:30:00.000Z",
          "wordCount": 1530,
          "title": "Mid-December Link Assortment"
        },
        {
          "id": "http://emshort.blog/?p=42237",
          "author": "Emily Short",
          "description": "Events December 4 is the next meetup of the San Francisco Bay Area IF Group. December 12 is the next meetup of the Seattle/Tacoma IF Group, meeting online via Discord. The Ectocomp competition for spooky and Halloween-y games is now over, but the entries can still be played. Or, if you’re looking for something to … Continue reading \"End of November Link Assortment\"",
          "link": "https://emshort.blog/2021/11/30/end-of-november-link-assortment-6/",
          "publishedOn": "2021-11-30T17:30:00.000Z",
          "wordCount": 1665,
          "title": "End of November Link Assortment"
        },
        {
          "id": "http://emshort.blog/?p=42234",
          "author": "Emily Short",
          "description": "Events IF Comp judging ends today — you may have a few hours left to register your opinions, if you wish — and results will be available soon. Today also marks the beginning of fos1’s jam for TADS games, which will run through early 2022. This is intended to invite more authors to try out … Continue reading \"Mid-November Link Assortment\"",
          "link": "https://emshort.blog/2021/11/15/mid-november-link-assortment-6/",
          "publishedOn": "2021-11-15T17:30:00.000Z",
          "wordCount": 1545,
          "title": "Mid-November Link Assortment"
        }
      ]
    },
    {
      "title": "xkcd.com",
      "feedUrl": "https://xkcd.com/atom.xml",
      "siteUrl": "https://xkcd.com/",
      "articles": [
        {
          "id": "https://xkcd.com/2564/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/sunshield.png\" title=\"RIP the surface of Mars\" alt=\"RIP the surface of Mars\" />",
          "link": "https://xkcd.com/2564/",
          "publishedOn": "2022-01-05T00:00:00.000Z",
          "wordCount": 201,
          "title": "Sunshield"
        },
        {
          "id": "https://xkcd.com/2563/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/throat_and_nasal_passages.png\" title=\"I always felt like what the 'you are now aware of your tongue' thing neeeded in order to be truly enjoyable was an element of mortal peril.\" alt=\"I always felt like what the 'you are now aware of your tongue' thing neeeded in order to be truly enjoyable was an element of mortal peril.\" />",
          "link": "https://xkcd.com/2563/",
          "publishedOn": "2022-01-03T00:00:00.000Z",
          "wordCount": 207,
          "title": "Throat and Nasal Passages"
        },
        {
          "id": "https://xkcd.com/2562/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/formatting_meeting.png\" title=\"Neither group uses iso 8601 because the big-endian enthusiasts were all at the meeting 20 years ago.\" alt=\"Neither group uses iso 8601 because the big-endian enthusiasts were all at the meeting 20 years ago.\" />",
          "link": "https://xkcd.com/2562/",
          "publishedOn": "2021-12-31T00:00:00.000Z",
          "wordCount": 203,
          "title": "Formatting Meeting"
        },
        {
          "id": "https://xkcd.com/2561/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/moonfall.png\" title=\"Novel ideas and cool explosions are both good, but what I really want from a movie is novel ideas ABOUT cool explosions.\" alt=\"Novel ideas and cool explosions are both good, but what I really want from a movie is novel ideas ABOUT cool explosions.\" />",
          "link": "https://xkcd.com/2561/",
          "publishedOn": "2021-12-29T00:00:00.000Z",
          "wordCount": 201,
          "title": "Moonfall"
        },
        {
          "id": "https://xkcd.com/2560/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/confounding_variables.png\" title=\"You can find a perfect correlation if you just control for the residual.\" alt=\"You can find a perfect correlation if you just control for the residual.\" />",
          "link": "https://xkcd.com/2560/",
          "publishedOn": "2021-12-27T00:00:00.000Z",
          "wordCount": 203,
          "title": "Confounding Variables"
        },
        {
          "id": "https://xkcd.com/2559/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/december_25th_launch.png\" title=\"Update: Santa has been destroyed by the range safety officer.\" alt=\"Update: Santa has been destroyed by the range safety officer.\" />",
          "link": "https://xkcd.com/2559/",
          "publishedOn": "2021-12-24T00:00:00.000Z",
          "wordCount": 205,
          "title": "December 25th Launch"
        },
        {
          "id": "https://xkcd.com/2558/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/rapid_test_results.png\" title=\"A solid red area with two white lines means that you have been infected with the anti-coronavirus, COVID+19, which will cure anyone you have close contact with.\" alt=\"A solid red area with two white lines means that you have been infected with the anti-coronavirus, COVID+19, which will cure anyone you have close contact with.\" />",
          "link": "https://xkcd.com/2558/",
          "publishedOn": "2021-12-22T00:00:00.000Z",
          "wordCount": 205,
          "title": "Rapid Test Results"
        },
        {
          "id": "https://xkcd.com/2557/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/immunity.png\" title=\"This plan may sound appealing to people who know a little about the immune system, but the drawbacks are clear to people who know a lot about the immune system and also to people who don't know anything about it.\" alt=\"This plan may sound appealing to people who know a little about the immune system, but the drawbacks are clear to people who know a lot about the immune system and also to people who don't know anything about it.\" />",
          "link": "https://xkcd.com/2557/",
          "publishedOn": "2021-12-20T00:00:00.000Z",
          "wordCount": 201,
          "title": "Immunity"
        },
        {
          "id": "https://xkcd.com/2556/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/turing_complete.png\" title=\"Thanks to the ForcedEntry exploit, your company's entire tech stack can now be hosted out of a PDF you texted to someone.\" alt=\"Thanks to the ForcedEntry exploit, your company's entire tech stack can now be hosted out of a PDF you texted to someone.\" />",
          "link": "https://xkcd.com/2556/",
          "publishedOn": "2021-12-17T00:00:00.000Z",
          "wordCount": 185,
          "title": "Turing Complete"
        },
        {
          "id": "https://xkcd.com/2555/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/notifications.png\" title=\"It's 10:34 PM for this user. They really need to get going, they have a thing early tomorrow. Are you sure you want to notify?\" alt=\"It's 10:34 PM for this user. They really need to get going, they have a thing early tomorrow. Are you sure you want to notify?\" />",
          "link": "https://xkcd.com/2555/",
          "publishedOn": "2021-12-15T00:00:00.000Z",
          "wordCount": 183,
          "title": "Notifications"
        },
        {
          "id": "https://xkcd.com/2554/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/gift_exchange.png\" title=\"In addition to having all their budgets in a spreadsheet with consistent formatting, they just love expressing preferences on a well-calibrated numerical scale.\" alt=\"In addition to having all their budgets in a spreadsheet with consistent formatting, they just love expressing preferences on a well-calibrated numerical scale.\" />",
          "link": "https://xkcd.com/2554/",
          "publishedOn": "2021-12-13T00:00:00.000Z",
          "wordCount": 185,
          "title": "Gift Exchange"
        },
        {
          "id": "https://xkcd.com/2553/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/incident_report.png\" title=\"Increasing-precision timestamps are the Jaws theme of incident reports.\" alt=\"Increasing-precision timestamps are the Jaws theme of incident reports.\" />",
          "link": "https://xkcd.com/2553/",
          "publishedOn": "2021-12-10T00:00:00.000Z",
          "wordCount": 185,
          "title": "Incident Report"
        },
        {
          "id": "https://xkcd.com/2552/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/the_last_molecule.png\" title=\"Biology is really struggling; they're barely at 93% and they keep finding more ants.\" alt=\"Biology is really struggling; they're barely at 93% and they keep finding more ants.\" />",
          "link": "https://xkcd.com/2552/",
          "publishedOn": "2021-12-08T00:00:00.000Z",
          "wordCount": 187,
          "title": "The Last Molecule"
        },
        {
          "id": "https://xkcd.com/2551/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/debunking.png\" title=\"Mark Zuckerberg has only neutral feelings toward Peppa Pig, who he understands is a fictional character, and he blames the coronavirus pandemic on other factors.\" alt=\"Mark Zuckerberg has only neutral feelings toward Peppa Pig, who he understands is a fictional character, and he blames the coronavirus pandemic on other factors.\" />",
          "link": "https://xkcd.com/2551/",
          "publishedOn": "2021-12-06T00:00:00.000Z",
          "wordCount": 183,
          "title": "Debunking"
        },
        {
          "id": "https://xkcd.com/2550/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/webb.png\" title=\"Each one contains a chocolate shaped like a famous spacecraft and, for the later numbers, a pamphlet on managing anxiety.\" alt=\"Each one contains a chocolate shaped like a famous spacecraft and, for the later numbers, a pamphlet on managing anxiety.\" />",
          "link": "https://xkcd.com/2550/",
          "publishedOn": "2021-12-03T00:00:00.000Z",
          "wordCount": 183,
          "title": "Webb"
        },
        {
          "id": "https://xkcd.com/2549/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/edge_cake.png\" title=\"Every time IERS adds or removes a leap second, they send me a birthday cake out of superstition.\" alt=\"Every time IERS adds or removes a leap second, they send me a birthday cake out of superstition.\" />",
          "link": "https://xkcd.com/2549/",
          "publishedOn": "2021-12-01T00:00:00.000Z",
          "wordCount": 185,
          "title": "Edge Cake"
        },
        {
          "id": "https://xkcd.com/2548/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/awful_people.png\" title=\"Hm, this burger place has a couple of good reviews, but LakeSlayer7 says he got food poisoning there and everyone should try this other place down by the lake instead.\" alt=\"Hm, this burger place has a couple of good reviews, but LakeSlayer7 says he got food poisoning there and everyone should try this other place down by the lake instead.\" />",
          "link": "https://xkcd.com/2548/",
          "publishedOn": "2021-11-29T00:00:00.000Z",
          "wordCount": 185,
          "title": "Awful People"
        },
        {
          "id": "https://xkcd.com/2547/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/siren.png\" title=\"Directions from CITY OF TROY to ITHACA / Total time: 10y 54d 14h 25m / Warning: Route crosses an international border / route includes capture by the goddess Calypso / route includes a ferry\" alt=\"Directions from CITY OF TROY to ITHACA / Total time: 10y 54d 14h 25m / Warning: Route crosses an international border / route includes capture by the goddess Calypso / route includes a ferry\" />",
          "link": "https://xkcd.com/2547/",
          "publishedOn": "2021-11-26T00:00:00.000Z",
          "wordCount": 183,
          "title": "Siren"
        },
        {
          "id": "https://xkcd.com/2546/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/fiction_vs_nonfiction.png\" title=\"The real challenge is how to file Boba Fett's biography of Doris Kearns Goodwin.\" alt=\"The real challenge is how to file Boba Fett's biography of Doris Kearns Goodwin.\" />",
          "link": "https://xkcd.com/2546/",
          "publishedOn": "2021-11-24T00:00:00.000Z",
          "wordCount": 187,
          "title": "Fiction vs Nonfiction"
        },
        {
          "id": "https://xkcd.com/2545/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/bayes_theorem.png\" title=\"P((B|A)|(A|B)) represents the probability that you'll mix up the order of the terms when using Bayesian notation.\" alt=\"P((B|A)|(A|B)) represents the probability that you'll mix up the order of the terms when using Bayesian notation.\" />",
          "link": "https://xkcd.com/2545/",
          "publishedOn": "2021-11-22T00:00:00.000Z",
          "wordCount": 185,
          "title": "Bayes' Theorem"
        },
        {
          "id": "https://xkcd.com/2544/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/heart_stopping_texts.png\" title=\"Was this your car? [looping 'image loading' animation]\" alt=\"Was this your car? [looping 'image loading' animation]\" />",
          "link": "https://xkcd.com/2544/",
          "publishedOn": "2021-11-19T00:00:00.000Z",
          "wordCount": 185,
          "title": "Heart-Stopping Texts"
        },
        {
          "id": "https://xkcd.com/2543/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/never_told_anyone.png\" title=\"Even if you said you were an employee of the website, if you asked for my password, I'd tell you.\" alt=\"Even if you said you were an employee of the website, if you asked for my password, I'd tell you.\" />",
          "link": "https://xkcd.com/2543/",
          "publishedOn": "2021-11-17T00:00:00.000Z",
          "wordCount": 187,
          "title": "Never Told Anyone"
        },
        {
          "id": "https://xkcd.com/2542/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/daylight_calendar.png\" title=\"Could be worse. In some towns north of here, it's already December, and the 21st will last for nearly a week.\" alt=\"Could be worse. In some towns north of here, it's already December, and the 21st will last for nearly a week.\" />",
          "link": "https://xkcd.com/2542/",
          "publishedOn": "2021-11-15T00:00:00.000Z",
          "wordCount": 185,
          "title": "Daylight Calendar"
        },
        {
          "id": "https://xkcd.com/2541/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/occam.png\" title=\"Oh no, Murphy just picked up the razor.\" alt=\"Oh no, Murphy just picked up the razor.\" />",
          "link": "https://xkcd.com/2541/",
          "publishedOn": "2021-11-12T00:00:00.000Z",
          "wordCount": 183,
          "title": "Occam"
        },
        {
          "id": "https://xkcd.com/2540/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/ttsltswbd.png\" title=\"Tomorrow's sessions will be entirely devoted to sewing machine rotary hooks.\" alt=\"Tomorrow's sessions will be entirely devoted to sewing machine rotary hooks.\" />",
          "link": "https://xkcd.com/2540/",
          "publishedOn": "2021-11-10T00:00:00.000Z",
          "wordCount": 183,
          "title": "TTSLTSWBD"
        },
        {
          "id": "https://xkcd.com/2539/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/flinch.png\" title=\"Premed: &quot;Does this count for a physics credit? Can we shorten the string so I can get it done faster? And can we do one where it hits me in the face? I gotta do a thing for first aid training right after.&quot;\" alt=\"Premed: &quot;Does this count for a physics credit? Can we shorten the string so I can get it done faster? And can we do one where it hits me in the face? I gotta do a thing for first aid training right after.&quot;\" />",
          "link": "https://xkcd.com/2539/",
          "publishedOn": "2021-11-08T00:00:00.000Z",
          "wordCount": 183,
          "title": "Flinch"
        }
      ]
    },
    {
      "title": "remy sharp's b:log",
      "feedUrl": "https://remysharp.com/feed.xml",
      "siteUrl": "https://remysharp.com",
      "articles": [
        {
          "id": "books-i-read-in-2021",
          "author": null,
          "description": "As my year in reading goes, I've certainly read less books, but I've not spent less time reading. It's just some books take me longer than others. For example, I read Call of the Wild, an 80(ish) page book in 4 weeks and then I read a 400 page book in 4 days… so it's really swings and roundabouts.\nI recorded 21 books on my Kindle this year, but actually one of them was read aloud to the kids (Which I do still count) but another one was all of 19 pages… which, I think really doesn't count (it was Home: Habitat, Range, Niche, Territory by Martha Wells). So… 20 books then.\nThis post is mostly data driven (from my own web site's data) to give me a sense of the quality of the books I've read, otherwise individual reviews are all linked in this post or available on my books page.",
          "link": "https://remysharp.com/2022/01/01/books-i-read-in-2021",
          "publishedOn": "2022-01-01T00:00:00.000Z",
          "wordCount": 845,
          "title": "Books I read in 2021 [blog]"
        },
        {
          "id": "my-2021",
          "author": null,
          "description": "On a frequency of once every 365 days, based on the theme of my previous me-me-me posts and a general stamp I like to leave myself to remind Future Remy what the hell went on, here is my 2021.",
          "link": "https://remysharp.com/2021/12/31/my-2021",
          "publishedOn": "2021-12-31T08:00:00.000Z",
          "wordCount": 968,
          "title": "My 2021 [blog]"
        },
        {
          "id": "iron-widow-iron-widow-1",
          "author": null,
          "description": "Iron Widow (Iron Widow, #1)",
          "link": "https://remysharp.com/books/2021/iron-widow-iron-widow-1",
          "publishedOn": "2021-12-31T00:00:00.000Z",
          "wordCount": 160,
          "title": "Iron Widow (Iron Widow, #1) [book]"
        },
        {
          "id": "a-psalm-for-the-wild-built-monk-and-robot-1",
          "author": null,
          "description": "Lovely but I found the language almost too distracting.\nOnly right at the end of the book did I consider that maybe I really wasn't the right audience for the story - as it seemed to smack of \"millennium type problems\". Using air quotes in my description because I'm fairly sure this is a patronising statement I'm making!\nThe Dex character feels discontent with their achievements and is struggling to find fulfilling meaning. Their work has meaning to others but they're left feeling empty. Obviously it's an impossible measure as life trondles forward and achievements change with time.\nFor me it was only really when Dex meets the Robot (whose name I've already forgotten) when the book became more engaging. It was like the Dex character could be challenged and some real depth was offered (for better or worse for Dex's personality).\nBut what I did struggle with was the language and the odd shoehorning of gender pronouns. Dex is neither \"he\" or \"she\", so Chamber's settles with using the \"they\" pronoun. This led to my own confusion regularly thinking the lines I was reading was referring to Dex and another character that was in the scene.\nThe sore-thumb moment is when Dex asks, interestingly, what pronoun the Robot uses, and the Robot responds with \"it\" and it refers to itself as an object. Dex replies with (something like) they are the same, and their pronoun is \"they\". This seemed like a potentially interesting exchange between the Robot and Dex about the subject of how one refers to oneself and how they identify, but it doesn't happen. It just has that exchange, and then the story returns to what they were doing and carries on. It felt jarring and like Chamber's wanted to discuss this topic, but instead shoe horned it in.\nI do also suspect that my trouble with the language is a me-thing and probably with practice it won't cause me as much (or any) confusion, but for now, and this book, it definitely affected how I enjoyed the story.",
          "link": "https://remysharp.com/books/2021/a-psalm-for-the-wild-built-monk-and-robot-1",
          "publishedOn": "2021-12-29T00:00:00.000Z",
          "wordCount": 509,
          "title": "A Psalm for the Wild-Built (Monk & Robot, #1) [book]"
        },
        {
          "id": "hercule-poirots-christmas",
          "author": null,
          "description": "I totally failed to guess the killer!\nPoirot was staple TV viewing when I was a teenage so the image of the character is burned well into my consciousness (thank you David Suchet) - so reading an Agatha Christie book tends to come with very easy imagination and even accents for characters.\nThe story is well built, told in a way that makes me think I should have been able to deduce the killer myself (and something I've always wondered about murder mystery stories) and does a good job of flipping my expectations on its head!\nSolid stuff.",
          "link": "https://remysharp.com/books/2021/hercule-poirots-christmas",
          "publishedOn": "2021-12-24T00:00:00.000Z",
          "wordCount": 253,
          "title": "Hercule Poirot's Christmas [book]"
        },
        {
          "id": "how-i-relearnt-to-read",
          "author": null,
          "description": "During the month of November this year, I read Wise Man's Fear - the longest book I've ever read, in my life at 1,000 pages.\nYounger Remy would have never believed that I could read a book this length. It was simple something that was impossible. For me, my Kindle changed reading for me and opened the door to the world of literature.",
          "link": "https://remysharp.com/2021/12/14/how-i-relearnt-to-read",
          "publishedOn": "2021-12-14T00:00:00.000Z",
          "wordCount": 877,
          "title": "How I (re)learnt to read [blog]"
        },
        {
          "id": "away-with-the-penguins",
          "author": null,
          "description": "Took a while to warm to the characters, but worth it in the end.The story follows an exceptionally grumpy old lady, very much a stereotypical old person who doesn't trust anyone and exists almost just for themselves.We also meet her grandson who is equally useless in his own ways. These two characters together made it rather difficult to want to keep reading their story, but I'm glad I did persevere.Although the story is a little cliche, around four fifths the way through the book, it does a pretty good job to win me over to the main characters and I want to see them happy by the end of the story.Probably a little bit too long, but worth it for the payoff at the end.",
          "link": "https://remysharp.com/books/2021/away-with-the-penguins",
          "publishedOn": "2021-12-12T00:00:00.000Z",
          "wordCount": 281,
          "title": "Away with the Penguins [book]"
        },
        {
          "id": "the-wise-mans-fear-the-kingkiller-chronicle-2",
          "author": null,
          "description": "A wonderful journey into Rothfuss' world.\nAs part two of a three part series covering three days (one book per day), the tone and story continues brilliantly onwards from book one (which I read mid-2019).\nThe characters, their quirks and more importantly to me, the beautiful prose of the book came right back to life.\nThe book clocks in at a 1,000 pages, and though by my standard that's a (very) long book, quite often I found myself happy that I was still inside the tale and that I still had a long way to go before it would end (and I knew that the current decade wait for book three could well draw longer so I wasn't so eager to finish the book!).\nFor me, the enjoyment was in the storytelling and being whisked away into the world completely. I honestly did find the amount of sex in the book kind of over the top. I can buy that Kvothe is a legend character and one part of that is perhaps he has a reputation with women, but I'm not wholely sure I needed the many-month-long shagathon story when Kvothe is away with the faeries…\nStill, even with this, I found myself wanting to stay in the world for as long as I could.\nThe very ending, like the last few pages of The Name of the Wind did surprise me a left me a little confused, but I like to think that one day The Doors of Stone will answer some of those questions…",
          "link": "https://remysharp.com/books/2021/the-wise-mans-fear-the-kingkiller-chronicle-2",
          "publishedOn": "2021-11-29T00:00:00.000Z",
          "wordCount": 420,
          "title": "The Wise Man's Fear (The Kingkiller Chronicle, #2) [book]"
        },
        {
          "id": "why-i-write-and-when-i-dont",
          "author": null,
          "description": "I've been publishing on my blog since 2006 - something I'm personally proud of. My blog is the personal little space I've carved for myself on the web. Whilst I'm here in the real world, my blog will exist in the digital world, and every single post URL will work (404s are for the weak! 😏).\nBack in 2015 I set myself an goal to publish at least two posts a month, for the most part I've managed. I've always been a fan of \"easy goals\" - something that's achievable without it causing stress - so doing some writing twice a month definitely hit that sweet spot.\nThis particular blog has been active since 2006, but I had also toyed with more diary-like sites during the early-2000s but the URLs are so obscure not only has the web forgotten, but they're wiped clean from my own memory.\nWhen I starte…",
          "link": "https://remysharp.com/2021/11/21/why-i-write-and-when-i-dont",
          "publishedOn": "2021-11-21T00:00:00.000Z",
          "wordCount": 1655,
          "title": "Why I write and why I won't [blog]"
        },
        {
          "id": "2021-11-11-0ad5612e",
          "author": null,
          "description": "I think this might be one of the first balanced or non-invested reads of what \"Web3\" means and Sloan's opening notes really resonate:\n\nIt’s for kids. I mean that in a good way! I think Web3 has resonated powerfully with young people because it feels like something genuinely new, and it feels like it can be theirs. Who could argue with those feelings? Not me.\n\nThe notes go on and I come away with the same general sense that I've had so far of the crowd cheering on for Web3: it's about making money. Which is fine, the world runs on capitalism for the most part, it's just not entirely for me.\nAnd I think that's the rub, the stories I know of the creation and the spread of the web (and indeed the internet) came from those wanting to share and do good. The stories I've read were never about making money but instead creating a place for others.\nI will concede that I don't tend to read the \"got rich by selling X web start up\" - but it's that start in the web that's what drives me, and what I love about the web. It's what I love about the Open Web.\nWeb Zero if you will. It was about sharing, community, learning and finding a place in the world.\nSource: society.robinsloan.com",
          "link": "https://remysharp.com/links/2021-11-11-0ad5612e",
          "publishedOn": "2021-11-11T19:39:57.000Z",
          "wordCount": 376,
          "title": "Notes on Web3 by Robin Sloan [link]"
        }
      ]
    },
    {
      "title": "Writing - rachelbythebay",
      "feedUrl": "https://rachelbythebay.com/w/atom.xml",
      "siteUrl": "https://rachelbythebay.com/w/",
      "articles": [
        {
          "id": "https://rachelbythebay.com/w/2022/01/01/baddate/",
          "author": null,
          "description": "I guess I've turned into a collector of numbers that break things \nsometimes.  Here's another one I just heard about, and it's directly \nrelated to what just happened with the calendar.\n\n\nThe last value for last year is December 31, 2021 at 23:59, and in this \nformat it becomes 2112312359.  That just fits into a signed 32 bit \nnumber (which tops out at 2147483647).\n\n\nSo, if you're using Microsoft Exchange and stopped getting your mail in \nthe past couple of hours, this is why!\n\nReally!  No joke!\n\nHappy 2022, everyone.",
          "link": "https://rachelbythebay.com/w/2022/01/01/baddate/",
          "publishedOn": "2022-01-01T19:36:01.000Z",
          "wordCount": 160,
          "title": "YYMMDDHHMM just overflowed a signed 32 bit int"
        },
        {
          "id": "https://rachelbythebay.com/w/2021/12/24/mkdir/",
          "author": null,
          "description": "Several years back, I was doing my thing in a corporate environment, \nworking on a project with some friends.  By virtue of being in a very \nlarge company, we had quite the assortment of libraries which could be \nbrought in to do stuff.  Given that we had a \"would be nice\" item on our \nfeature list that involved doing something with the filesystem, I went \nlooking for a matching feature, and it turned into a security dumpster \nfire.  Here's what happened.\n\n\nWhen you're in that situation, you can't just mkdir() the final path.  \nIt won't work.  You have to start from the top and work your way down.  \nThe ones which already exist will probably fail with -EEXIST, so \nsometimes it makes more sense to look at what's there, work your way \ndown, and then start the mkdir calls when you find that p…",
          "link": "https://rachelbythebay.com/w/2021/12/24/mkdir/",
          "publishedOn": "2021-12-25T19:49:20.000Z",
          "wordCount": 961,
          "title": "Fix the unit test and open a giant hole everywhere"
        },
        {
          "id": "https://rachelbythebay.com/w/2021/12/18/log/",
          "author": null,
          "description": "Logging stuff is in the news this week.  Specifically, people with Java \nand log4j somewhere in their lives are having a miserable time.  I \nfigured I'd re-tell a story about terrible things done by way of a bunch \nof feature-rich libraries and dubious interconnections.  I've mentioned \nthis in passing before, but this time I've tried to be much more \nspecific about how it works.\n\n\nPart 1: the flags.\n\n\n\nDEFINE_bool(enable_foo, false, \"Enable the foo feature\");\n \n...\n \nvoid my_func() {\n  if (FLAGS_enable_foo) {\n    do_something();\n  }\n}\n\n\n\n\nDECLARE_bool(enable_foo);\n \n...\n \nvoid other_func() {\n  // Turns out we need foo enabled to do our stuff.\n  FLAGS_enable_foo = true;\n  // ...\n}\n\n\n\n\nint main(int argc, char** argv) {\n  InitCompany(argc, argv);  // populates FLAGS_ of all kinds\n  // ...\n}\n…",
          "link": "https://rachelbythebay.com/w/2021/12/18/log/",
          "publishedOn": "2021-12-19T01:05:39.000Z",
          "wordCount": 1330,
          "title": "Log libraries and the tendency to open holes in things"
        },
        {
          "id": "https://rachelbythebay.com/w/2020/11/26/magic/",
          "author": null,
          "description": "Hello, world!  A couple of days ago, I noticed someone remarking on a \nline from an older post of mine that had been making the rounds.  In it, \nI say something about adding a number to \"my list of magic numbers\".  \nThat person wanted to see that list.\n\n\nAnd so, I have put together this list of everything I can think of at \nthe moment, along with a whole bunch of commentary that should be able \nto send you on dozens of romps through Wikipedia.  Hopefully this will \nboth satisfy the request for \"the list\" and provide a lot of amusement \non a day which normally is lacking in content.\n\n\nBe safe out there, and enjoy.\n\n\n\"HTTP\" is 0x48545450 (1213486160) or 0x50545448 (1347703880).  If it \nshows up in your error logs, you're probably calling out to a poor web \nserver instead of someone who actua…",
          "link": "https://rachelbythebay.com/w/2020/11/26/magic/",
          "publishedOn": "2021-12-03T06:19:07.000Z",
          "wordCount": 3043,
          "title": "My list of magic numbers for your turkey day enjoyment"
        },
        {
          "id": "https://rachelbythebay.com/w/2021/12/02/build/",
          "author": null,
          "description": "I've told some stories about what happens when you end up at a company \nthat builds nothing and instead rents everything from some vendor.  \nGiven that, it's only fair that I describe something bad that can \nhappen at a company which is known for building stuff.\n\n\nThe trouble is that sometimes these companies will hire someone who's \nknown for doing X... and *only* X.  They're a builder, all right, as \nlong as you want them to build X.  Perhaps they have been building X at \nsome other company, and now your company has hired them to come and do \nthat same job over here instead.\n\n\nThere's also the possibility that the prestige of having this person \nworking at the company is what they're actually cultivating, and \nmanagement wants to make this person happy by letting them work on their \npet project, even if the pet project itself is not doing anything \npositive.\n\nactually belongs in \nproduction.  In one outcome, it's brilliantly executed and things grow.  \nBut, this is about the downsides, and in that scenario, it's a stinking \npile of garbage and needs to be thrown out, but it gets forced in, \nanyway.\n\n\nIf this project is being pushed for political reasons, then it should \nnot come as a surprise that when it finally does ship to production,\nit causes outages and generally fails to deliver on its promises.  It's \nactually worse than just leaving things the way they had been before any \nof this stuff showed up.\n\n\nJust imagine what companies would look like if their hiring processes \nfiltered out this kind of charlatan instead of looking for whether they \ncould do some dumb coding card trick in a 45 minute interview block.\nI think they'd look very different, and a whole bunch of people would \nhave to find another industry to prey upon.",
          "link": "https://rachelbythebay.com/w/2021/12/02/build/",
          "publishedOn": "2021-12-03T03:33:11.000Z",
          "wordCount": 606,
          "title": "One way a builder culture can fail"
        },
        {
          "id": "https://rachelbythebay.com/w/2021/11/08/hardware/",
          "author": null,
          "description": "In writing about my dumb little \"mailserv\" project this past weekend, I \npurposely avoided mentioning some of the parameters lest they distract \nfrom the message I was trying to convey.  My attempted message was \nsomething along the lines of \"everyone starts somewhere, ignorance is \nthe default state until changed, and look at some of the shit I have \ninflicted upon the world as proof\".\n\n\nIn the case of the mailserv project, that is, the thing that did what \nwe'd call \"greylisting\" today, it ran on an auxiliary box that itself \nonly existed because of yet another terrible hack involving a second T1 \nand the systemic inability to run BGP properly.  I've talked about the \nfiner points of that before, and it's not really on topic here.  But, \nkeep in mind that it meant from 1997 forward, I had a machine running \nSquid just so we could push some web traffic out this secondary \n(fractional) T1 to take the load off the main circuit.\n\n\nIt was relatively cheap shit, and it had no special \"server\" features.\n\n\n\n\n\nThat's a Pentium 150 with 128 megabytes of memory, a (PATA!) IDE hard \ndrive with just 1.6 GB of space, a 10 Mbps Ethernet card, plus a video \ncard, CD-ROM drive and Sound Blaster that meant nothing, because it was \na server.  (The SB16, incidentally, proves this was intended to be a \nclassroom box running Kid Pix for some elementary school students.)\n\n\nAll of this in 128 MB of memory and a gig and a half of disk space.\n\n\nInstrumenting things to find slow points and trying to do something \nabout it made for a bunch of little changes over the year or two that \nthis spam filtering service existed.  Everything was driven by actual \nneeds and a distinct lack of system resources.  It kept up with the load \nand stopped a great many things that otherwise would have annoyed my \nusers.\n\nThis is just an example of what we did with what was available then.",
          "link": "https://rachelbythebay.com/w/2021/11/08/hardware/",
          "publishedOn": "2021-11-08T09:51:09.000Z",
          "wordCount": 693,
          "title": "The hardware behind my old mail filtering server"
        },
        {
          "id": "https://rachelbythebay.com/w/2021/11/07/select/",
          "author": null,
          "description": "There's something to be said for writing a \npost\nlate on a Saturday night.  For some reason, it tends to bring out \nTHE ONE\nmore than any other time of the week.  I wonder why that is.\n\n\nI mean, you're not wrong... but how's the rest of that quote go?\n\n\nRecall that it turned into a situation where the individual components \nof the query (ip, helo, from, to) were now in their own tables, so they \nall had a number now - the \"id\" column.  I figured, okay, I need to \nobtain those little suckers before I can build a query with them, so \nlet's query!\n\n\nSo, yep, I fired off four queries to get four numbers, then built up a \nquery, then fired that off as a fifth to get my results.\n\n\nDid I mention that I obviously didn't know the first thing about JOIN \nback then?  It took several more years for that to happen organically.\n\nGo on, bag on me for being ignorant.  I know what that really means.",
          "link": "https://rachelbythebay.com/w/2021/11/07/select/",
          "publishedOn": "2021-11-07T19:27:57.000Z",
          "wordCount": 357,
          "title": "But wait, there's more"
        },
        {
          "id": "https://rachelbythebay.com/w/2021/11/06/sql/",
          "author": null,
          "description": "The first time you encounter something, you're probably going to make \nsome mistakes.  There's a post going around tonight about how someone \nforgot to put an index on some database thing and wound up doing full \ntable scans (or something like that).  The rub is that instead of just \nbeing slow, it also cost a fair amount of money because this crazy \nvendor system charged by the row or somesuch.  So, by scanning \nthe whole table, they touched all of those rows, and oh hey, massive \namounts of money just set ablaze!\n\n\nThis system was something that was intended to slow down or stop a lot \nof the \"open proxy\" spam that was going around at the time - late 2002.  \nIt was apparent that these spammer scum would grab an open proxy and \nthen would connect outward to your mail exchanger and would t…",
          "link": "https://rachelbythebay.com/w/2021/11/06/sql/",
          "publishedOn": "2021-11-07T19:27:06.000Z",
          "wordCount": 1199,
          "title": "A terrible schema from a clueless programmer"
        }
      ]
    },
    {
      "title": "LOW-TECH MAGAZINE",
      "feedUrl": "https://feeds2.feedburner.com/typepad/krisdedecker/lowtechmagazineenglish",
      "siteUrl": "https://www.lowtechmagazine.com/",
      "articles": [
        {
          "id": "https://www.lowtechmagazine.com/2021/12/printed-website-third-volume.html",
          "author": null,
          "description": "Low-tech Magazine Volume III The newest Low-tech Magazine book collects 18 articles published between 2018 and 2021. At 368 pages it’s a thin book compared to earlier volumes. When we started the book series, the challenge was to unlock an archive of almost 12 years. It made sense to pack this content into as few volumes as possible. However, looking ahead, we will publish more often, once every one to three years, depending on the number of articles written. From now on, the articles will be arranged chronologically, from oldest to newest, and no longer the other way around. This volume contains 184 images in black and white. Low-tech Magazine: The Comments We also launched a book which collects almost...",
          "link": "https://www.lowtechmagazine.com/2021/12/printed-website-third-volume.html",
          "publishedOn": "2021-12-02T22:17:04.000Z",
          "wordCount": 990,
          "title": "The Printed Website: Volume III & The Comments"
        }
      ]
    },
    {
      "title": "esoteric.codes",
      "feedUrl": "https://esoteric.codes/rss",
      "siteUrl": "https://esoteric.codes",
      "articles": []
    },
    {
      "title": "Lea Verou",
      "feedUrl": "https://feeds.feedburner.com/leaverou",
      "siteUrl": "https://lea.verou.me",
      "articles": [
        {
          "id": "https://lea.verou.me/?p=3392",
          "author": "Lea Verou",
          "description": "This week has been Yak Shaving Galore. It went a bit like this: I’ve been working on a web component that I need for the project I’m working on. More on that later, but let’s call it <x-foo> for now. Of course that needs to be developed as a separate reusable library and released as […]",
          "link": "https://lea.verou.me/2021/11/on-yak-shaving-and-md-block-an-html-element-for-markdown/",
          "publishedOn": "2021-11-26T16:08:17.000Z",
          "wordCount": 625,
          "title": "On Yak Shaving and <md-block>, a new HTML element for Markdown"
        }
      ]
    },
    {
      "title": "TEXT-MODE",
      "feedUrl": "https://text-mode.tumblr.com/rss",
      "siteUrl": "https://text-mode.tumblr.com/",
      "articles": []
    },
    {
      "title": "The Mozilla Blog",
      "feedUrl": "https://blog.mozilla.org/en/feed/",
      "siteUrl": "https://blog.mozilla.org/en/",
      "articles": [
        {
          "id": "https://blog.mozilla.org/?p=68166",
          "author": "Sarah Vasquez",
          "description": "Your favorite go-to resource to discover, save, and spend time with interesting reads, has gone to Texas. This December, Pocket has teamed up with Texas Monthly, bringing Pocket users weekly deep dives on every episode of America’s Girls, Texas Monthly’s fascinating new podcast about how the Dallas Cowboys Cheerleaders became international icons.  From the scandals […]\nThe post Pocket & Texas Monthly Take You Inside The World of the Dallas Cowboys Cheerleaders With New Partnership appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/products/pocket/pocket-texas-monthly-take-you-inside-the-world-of-the-dallas-cowboys-cheerleaders-with-new-partnership/",
          "publishedOn": "2021-12-16T23:15:21.000Z",
          "wordCount": 2104,
          "title": "Pocket & Texas Monthly Take You Inside The World of the Dallas Cowboys Cheerleaders With New Partnership"
        },
        {
          "id": "https://blog.mozilla.org/?p=68152",
          "author": "Rebecca Smith",
          "description": "While Mozilla can’t make your impossible-to-shop-for dad any easier to shop for, we can help make the process of holiday shopping more enjoyable. \nThe post My best holiday shopping tip? Mozilla appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/mozilla/my-best-holiday-shopping-tip-mozilla/",
          "publishedOn": "2021-12-09T22:30:00.000Z",
          "wordCount": 1537,
          "title": "My best holiday shopping tip? Mozilla"
        },
        {
          "id": "https://blog.mozilla.org/?p=68141",
          "author": "Jenifer Boscacci",
          "description": "All this year, we’ve been experimenting with features to help you discover articles and voices that are relevant to your interests, and better organize your lists so you can easily find the stories that fit your mood or your time available. We saw lots of users engaging with positive and meaningful content, which demonstrated to […]\nThe post Year in Review: How we’re curating the web with you and our top Pocket features appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/products/year-in-review-how-were-curating-the-web-with-you-and-our-top-pocket-features/",
          "publishedOn": "2021-12-09T14:06:09.000Z",
          "wordCount": 1653,
          "title": "Year in Review: How we’re curating the web with you and our top Pocket features"
        },
        {
          "id": "https://blog.mozilla.org/?p=68139",
          "author": "Mitchell Baker",
          "description": "I am pleased to share that Kristen Trubey has joined Mozilla as our Chief People Officer. Kristen initially came to Mozilla in August in an interim capacity but she quickly settled in and made an immediate impact. Her expertise, experience and focus to create connections between company culture, employee experience, and business results proved to […]\nThe post Kristen Trubey, Mozilla’s New Chief People Officer appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/mozilla/leadership/kristen-trubey-mozillas-new-chief-people-officer/",
          "publishedOn": "2021-12-09T00:38:41.000Z",
          "wordCount": 984,
          "title": "Kristen Trubey, Mozilla’s New Chief People Officer"
        },
        {
          "id": "https://blog.mozilla.org/?p=68030",
          "author": "Rebecca Smith",
          "description": "While we can’t predict what the history books will say about 2021, we can analyze what defined this year for us. We do just that in Pocket’s Best of 2021 — the most-saved, -read and -shared articles by Pocket readers, spanning culture, science, tech and more. \nThe post Pocket’s state-by-state guide to the most popular articles in 2021 appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/products/pocket/pocket-top-stories-by-state-best-of-2021/",
          "publishedOn": "2021-12-01T14:43:33.000Z",
          "wordCount": 2520,
          "title": "Pocket’s state-by-state guide to the most popular articles in 2021",
          "enclosure": {
            "url": "https://blog.mozilla.org/wp-content/blogs.dir/278/files/2021/12/Best-of-Pocket-2021_15s_Social-Video_16x9.mp4",
            "length": "12540335",
            "type": "video/mp4"
          }
        },
        {
          "id": "https://blog.mozilla.org/?p=68032",
          "author": "Rebecca Smith",
          "description": "We aren’t the only ones putting out Top 10 content lists or Year in Reviews, but we’d argue these lists are different from the rest — a cut above. Pocket readers are a discerning bunch: they gravitate to fascinating long reads that deeply immerse readers in a story or subject; explainers that demystify complex or […]\nThe post Celebrating Pocket’s Best of 2021 appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/products/pocket/pocket-best-of-2021/",
          "publishedOn": "2021-12-01T14:30:00.000Z",
          "wordCount": 1077,
          "title": "Celebrating Pocket’s Best of 2021"
        },
        {
          "id": "https://blog.mozilla.org/?p=68007",
          "author": "Mozilla",
          "description": "Today, Firefox Relay, a privacy-first and free product that hides your real email address to help protect your identity, is available with a new paid Premium service offering. The release comes just in time for the holiday season to help spare your inbox from being inundated with emails from e-commerce sites, especially those sites where […]\nThe post Introducing Firefox Relay Premium, allowing more aliases to protect your identity from spammers appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/mozilla/firefox-relay-and-premium-service/",
          "publishedOn": "2021-11-16T14:00:33.000Z",
          "wordCount": 1531,
          "title": "Introducing Firefox Relay Premium, allowing more aliases to protect your identity from spammers"
        },
        {
          "id": "https://blog.mozilla.org/?p=67996",
          "author": "Rebecca Smith",
          "description": "Here at Mozilla, we are the first to admit the internet isn’t perfect, but we are also quick to point out that the internet is pretty darn magical. The internet opens up doors and opportunities, allows for people to connect with others, and lets everyone find where they belong — their corners of the internet. […]\nThe post A Firefox mobile product manager on her favorite corners of the internet appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/internet-culture/interviews/my-corner-of-the-internet-with-vesta-zare/",
          "publishedOn": "2021-11-11T19:11:33.000Z",
          "wordCount": 1427,
          "title": "A Firefox mobile product manager on her favorite corners of the internet"
        },
        {
          "id": "https://blog.mozilla.org/?p=67996",
          "author": "Rebecca Smith",
          "description": "Here at Mozilla, we are the first to admit the internet isn’t perfect, but we are also quick to point out that the internet is pretty darn magical. The internet opens up doors and opportunities, allows for people to connect with others, and lets everyone find where they belong — their corners of the internet. […]\nThe post A Firefox mobile product manager on her favorite corners of the internet appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/internet-culture/interviews/my-corner-of-the-internet-with-vesta-ware/",
          "publishedOn": "2021-11-11T19:11:33.000Z",
          "wordCount": 1391,
          "title": "A Firefox mobile product manager on her favorite corners of the internet"
        },
        {
          "id": "https://blog.mozilla.org/?p=67970",
          "author": "Mozilla",
          "description": "There are plenty of reasons why you might want to keep something you are doing on the web to yourself. You might be looking for a ring for your soon-to-be fiance, looking up what those mysterious skin rashes could be, or reading a salacious celebrity gossip blog. That’s where Private Browsing mode comes in handy. […]\nThe post Firefox’s Private Browsing mode upleveled for you appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/mozilla/firefoxs-private-browsing-mode-upleveled-for-you/",
          "publishedOn": "2021-11-11T14:58:45.000Z",
          "wordCount": 1549,
          "title": "Firefox’s Private Browsing mode upleveled for you"
        },
        {
          "id": "https://blog.mozilla.org/?p=67993",
          "author": "M.J. Kelly",
          "description": "Starting with Firefox version 94, you will be able to personalize your browsing experience with 18 exciting new colorways themes. Each limited edition colorway presents its own individual bespoke characteristic. Find a color that better fits you with our palette. Learn more about how to get colorways.\nThe post Personalize Firefox with colorways appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/videos/personalize-firefox-with-colorways/",
          "publishedOn": "2021-11-10T17:13:12.000Z",
          "wordCount": 733,
          "title": "Personalize Firefox with colorways"
        },
        {
          "id": "https://blog.mozilla.org/?p=67826",
          "author": "Mozilla",
          "description": "As of today, Firefox desktop is the first major browser to become available in the Windows Store for Windows 10 and Windows 11 users. Previously, if you were on Windows and wanted to use Firefox, you had to download it from the internet and go through a clunky process from Microsoft. Now that Microsoft has […]\nThe post Firefox: the first major browser to be available in the Windows Store appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/products/firefox/firefox-the-first-major-browser-to-be-available-in-the-windows-store/",
          "publishedOn": "2021-11-09T14:00:00.000Z",
          "wordCount": 1078,
          "title": "Firefox: the first major browser to be available in the Windows Store"
        },
        {
          "id": "https://blog.mozilla.org/?p=67877",
          "author": "Mitchell Baker",
          "description": "I am excited to announce that Eric Muhlheim has joined Mozilla Corporation as our Chief Financial Officer (CFO). As our CFO Eric will be a key member of our steering committee reporting to me. He will lead our continued strategy to scale our mission impact by growing and diversifying our revenue through new investments, product […]\nThe post Welcome Eric Muhlheim, our incoming Chief Financial Officer appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/mozilla/eric-muhlheim-mozilla-chief-financial-officer/",
          "publishedOn": "2021-11-08T16:53:03.000Z",
          "wordCount": 1109,
          "title": "Welcome Eric Muhlheim, our incoming Chief Financial Officer"
        },
        {
          "id": "https://blog.mozilla.org/?p=67823",
          "author": "M.J. Kelly",
          "description": "With something like 15 billion mobile phones in the world, our collective thumbs are getting a workout from swiping and tapping tiny screens all day. Check out some of our favorite pro tips and tricks for getting the most out of Firefox on your phone and tablet that might also give your thumbs and your […]\nThe post 8 Firefox pro tips and tricks for Android and iOS (plus a few more) appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/products/firefox/firefox-tips-android-ios/",
          "publishedOn": "2021-11-08T15:29:34.000Z",
          "wordCount": 1869,
          "title": "8 Firefox pro tips and tricks for Android and iOS (plus a few more)"
        }
      ]
    },
    {
      "title": "Julia Evans",
      "feedUrl": "https://jvns.ca/atom.xml",
      "siteUrl": "http://jvns.ca/atom.xml",
      "articles": [
        {
          "id": "https://jvns.ca/blog/2022/01/05/why-might-you-run-your-own-dns-server-/",
          "author": null,
          "description": "One of the things that makes DNS difficult to understand is that it’s\ndecentralized. There are thousands (maybe hundreds of thousands? I don’t know!) of authoritative nameservers, and at least\n10 million resolvers.\nAnd they’re running lots of different software! All these different servers\nrunning software means that there’s a lot of inconsistency in how DNS works,\nwhich can cause all kinds of frustrating problems.\nBut instead of talking about the problems, I’m interested in figuring out –\nwhy is it a good thing that DNS is decentralized?\nwhy is it good that DNS is decentralized?\nOne reason is scalability – the decentralized design of DNS makes it\neasier to scale and more resilient to failures. I find it really amazing that\nDNS is still scaling well even though it’s almost 40 years old. Th…",
          "link": "https://jvns.ca/blog/2022/01/05/why-might-you-run-your-own-dns-server-/",
          "publishedOn": "2022-01-05T06:42:51.000Z",
          "wordCount": 1858,
          "title": "Why might you run your own DNS server?"
        },
        {
          "id": "https://jvns.ca/blog/2021/12/31/2021--year-in-review/",
          "author": null,
          "description": "It’s the end of the year again! This was my second full year working for myself\non wizard zines.\nHere are some thoughts about what I’m working towards, a bunch of things I made\nthis year, and a few ideas and questions about 2022.\nmade some progress on a “mission statement”\nI think the two hardest things about working for myself are working alone and\nhaving to decide what to do.\nThis year I spent some time trying to figure out what I’m doing with wizard\nzines. This is hard for me because I work in a pretty intuitive way – I have\nsome feelings about what’s important, and even though following my feelings\nusually turns out well, I can’t always explain what I’m trying to do.\nHere are some thoughts about what I’m trying to do:\nI’m only interested in explaining “old” established technologies (HT…",
          "link": "https://jvns.ca/blog/2021/12/31/2021--year-in-review/",
          "publishedOn": "2021-12-31T09:27:53.000Z",
          "wordCount": 1790,
          "title": "2021: Year in review"
        },
        {
          "id": "https://jvns.ca/blog/2021/12/15/mess-with-dns/",
          "author": null,
          "description": "Hello! I’ve been thinking about how to explain DNS a bunch in the last year.\nI like to learn in a very hands-on way. And so when I write a zine, I often\nclose the zine by saying something like “… and the best way to learn more\nabout this is to play around and experiment!“.\nSo I built a site where you can do experiments with DNS called Mess With DNS. It has examples of experiments you can try, and\nyou’ve very encouraged to come up with your own experiments.\nIn this post I’ll talk about why I made this, how it works, and give you\nprobably more details than you want to know about how I built it (design, testing,\nsecurity, writing an authoritative nameserver, live streaming updates, etc)\na screencast\nHere’s a GIF screencast of what it looks like to use it:\n\nit’s a real DNS server\nFirst: Mess W…",
          "link": "https://jvns.ca/blog/2021/12/15/mess-with-dns/",
          "publishedOn": "2021-12-15T09:41:36.000Z",
          "wordCount": 3105,
          "title": "New tool: Mess with DNS!"
        },
        {
          "id": "https://jvns.ca/blog/2021/12/06/dns-doesn-t-propagate/",
          "author": null,
          "description": "Hello! Yesterday I tweeted this:\n\nI feel like the term \"DNS propagation\" is misleading, like you're not actually waiting for DNS records to \"propagate\", you're waiting for cached records to expire\n— 🔎Julia Evans🔍 (@b0rk) December 5, 2021\n \nand I want to talk about it a little more. This came up because I was showing a\nfriend a demo of how DNS caching works last week, and he realized that what was\nhappening in the demo didn’t line up with his mental model of how DNS worked.\nHe immediately brought this up and adjusted his mental model (“oh, DNS records are\npulled, not pushed!“). But this it got me thinking – why did my very\nsmart and experienced friend have an inaccurate mental model for how DNS works\nin the first place?\nFirst – I’m very tired of posts that complain about how people are “w…",
          "link": "https://jvns.ca/blog/2021/12/06/dns-doesn-t-propagate/",
          "publishedOn": "2021-12-06T09:44:31.000Z",
          "wordCount": 2209,
          "title": "DNS doesn't \"propagate\""
        },
        {
          "id": "https://jvns.ca/blog/2021/12/04/how-to-use-dig/",
          "author": null,
          "description": "Hello! I talked to a couple of friends recently who mentioned they wished they knew\nhow to use dig to make DNS queries, so here’s a quick blog post about it.\nWhen I first started using dig I found it a bit intimidating – there are so\nmany options! I’m going to leave out most of dig’s options in this post and just\ntalk about the ones I actually use.\nAlso I learned recently that you can set up a .digrc configuration file to make its output\neasier to read and it makes it SO MUCH nicer to use.\nI also drew a zine page about dig a few years ago, but I wanted to write this post to include a bit more information.\n2 types of dig arguments: query and formatting\nThere are 2 main types of arguments you can pass to dig:\narguments that tell dig what DNS query to make\narguments that tell dig how to forma…",
          "link": "https://jvns.ca/blog/2021/12/04/how-to-use-dig/",
          "publishedOn": "2021-12-04T08:44:04.000Z",
          "wordCount": 1491,
          "title": "How to use dig"
        },
        {
          "id": "https://jvns.ca/blog/2021/11/17/debugging-a-weird--file-not-found--error/",
          "author": null,
          "description": "Yesterday I ran into a weird error where I ran a program and got the error\n“file not found” even though the program I was running existed. It’s something\nI’ve run into before, but every time I’m very surprised and confused by it\n(what do you MEAN file not found, the file is RIGHT THERE???!!??)\nSo let’s talk about what happened and why!\nthe error\nLet’s start by showing the error message I got. I had a Go program called\nserve.go, and I was trying to bundle it into a Docker container with this\nDockerfile:\nFROM golang:1.17 AS go\n\nADD ./serve.go /app/serve.go\nWORKDIR /app\nRUN go build serve.go\n\nFROM alpine:3.14\n\nCOPY --from=go /app/serve /app/serve\nCOPY ./static /app/static\nWORKDIR /app/static\nCMD [\"/app/serve\"]\n\nThis Dockerfile\nBuilds the Go program\nCopies the binary into an Alpine container\nP…",
          "link": "https://jvns.ca/blog/2021/11/17/debugging-a-weird--file-not-found--error/",
          "publishedOn": "2021-11-17T12:34:36.000Z",
          "wordCount": 1284,
          "title": "Debugging a weird 'file not found' error"
        },
        {
          "id": "https://jvns.ca/blog/2021/11/15/esbuild-vue/",
          "author": null,
          "description": "Hello!\nI’ve been writing more frontend code in the last year or two – I’ve been making a bunch of little Vue projects. (for example nginx playground, sql playground, this dns lookup tool, and a couple of others)\nMy general approach to frontend development has been pretty “pretend it’s 2005” – I usually\nhave an index.html file, a script.js file, and then I do a <script\nsrc=\"script.js\"> and that’s it. You can see an example of that approach here.\nThis has been working mostly ok for me, but sometimes I run into problems. So I\nwanted to talk about one of those problems, a solution I found\n(esbuild!), and what I needed to learn to solve the problem (some very basic facts about how npm builds work).\nSome of the facts in this post might\nbe wrong because still I don’t understand Javascript build s…",
          "link": "https://jvns.ca/blog/2021/11/15/esbuild-vue/",
          "publishedOn": "2021-11-15T19:14:17.000Z",
          "wordCount": 1750,
          "title": "Some notes on using esbuild"
        }
      ]
    },
    {
      "title": "Josh Comeau's blog",
      "feedUrl": "https://www.joshwcomeau.com/rss.xml",
      "siteUrl": "https://www.joshwcomeau.com/",
      "articles": [
        {
          "id": "https://www.joshwcomeau.com/css/custom-css-reset/",
          "author": "Josh W. Comeau",
          "description": "I have a set of baseline CSS styles that come with me from project to project. In the past, I'd use a typical CSS reset, but times have changed, and I believe I have a better set of global styles!",
          "link": "https://www.joshwcomeau.com/css/custom-css-reset/",
          "publishedOn": "2021-11-23T12:00:00.000Z",
          "wordCount": 3037,
          "title": "My Custom CSS Reset"
        },
        {
          "id": "https://www.joshwcomeau.com/css/introducing-shadow-palette-generator/",
          "author": "Josh W. Comeau",
          "description": "In order to create lush, realistic shadows in CSS, we need to use multiple layers and colors. How do we come up with all of the parameters, though? I've built a tool that'll help.",
          "link": "https://www.joshwcomeau.com/css/introducing-shadow-palette-generator/",
          "publishedOn": "2021-11-16T14:00:00.000Z",
          "wordCount": 1230,
          "title": "Introducing “Shadow Palette Generator”"
        }
      ]
    },
    {
      "title": "A List Apart: The Full Feed",
      "feedUrl": "https://alistapart.com/main/feed/",
      "siteUrl": "https://alistapart.com",
      "articles": [
        {
          "id": "https://alistapart.com/article/breaking-out-of-the-box/",
          "author": "by",
          "description": "CSS is about styling boxes. In fact, the whole web is made of boxes, from the browser viewport to elements on a page. But every once in a while a new feature comes along that makes us rethink our design approach.\nRound displays, for example, make it fun to play with circular clip areas. Mobile screen notches and virtual keyboards offer challenges to best organize content that stays clear of them. And dual screen or foldable devices make us rethink how to best use available space in a number of different device postures.\nSketches of a round display, a common rectangular mobile display, and a device with a foldable display.\n\n\n\nThese recent evolutions of the web platform made it both more challenging and more interesting to design products. They’re great opportunities for us to break out of o…",
          "link": "https://alistapart.com/article/breaking-out-of-the-box/",
          "publishedOn": "2021-12-09T15:00:00.000Z",
          "wordCount": 3751,
          "title": "Breaking Out of the Box"
        }
      ]
    },
    {
      "title": "Pluralistic: Daily links from Cory Doctorow",
      "feedUrl": "https://pluralistic.net/feed/",
      "siteUrl": "https://pluralistic.net",
      "articles": [
        {
          "id": "https://pluralistic.net/?p=2991",
          "author": "Cory Doctorow",
          "description": "Today's links Hospital beds are a monopoly: The casket to hospital bed monopoly pipeline. This day in history: 2007, 2017, 2021 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Hospital beds are a monopoly (permalink) The great James Boyle tells an important parable about the coining of the term \"ecology.\" Before the term came into wide use, the \"ecology movement\" as we know it was just a bunch of fragmented, seemingly disconnected issues. https://thepublicdomain.org/thepublicdomain1.pdf Like, if you're worried about owls and I'm worried about the ozone layer, it's not immediately apparent that we're fighting the same fight. It's not intuitive to link the fate of charismatic nocturnal avians to the gaseous composition of the upper atmosp…",
          "link": "https://pluralistic.net/2022/01/05/hillrom/",
          "publishedOn": "2022-01-05T16:21:05.000Z",
          "wordCount": 2705,
          "title": "Pluralistic: 05 Jan 2022"
        },
        {
          "id": "https://pluralistic.net/?p=2985",
          "author": "Cory Doctorow",
          "description": "Today's links Science fiction is a Luddite literature: My latest column for Locus Magazine. Neal Stephenson's 'Termination Shock': Geoengineering and the end of the world. Stellar images of quack exercise machines: A memento mori for anyone flexing in lycra on a Peleton. This day in history: 2002, 2007, 2012, 2017 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Science fiction is a Luddite literature (permalink) My latest column for Locus Magazine is \"Science Fiction is a Luddite Literature,\" and it's my contribution to the burgeoning movement to rehabilitate the reputation of the Luddite uprisings, overturning the libel that Luddites were motivated by a fear of technology: https://locusmag.com/2022/01/cory-doctorow-science-fiction-is-a…",
          "link": "https://pluralistic.net/2022/01/04/general-ludd/",
          "publishedOn": "2022-01-04T17:07:38.000Z",
          "wordCount": 3168,
          "title": "Pluralistic: 04 Jan 2022"
        },
        {
          "id": "https://pluralistic.net/?p=2973",
          "author": "Cory Doctorow",
          "description": "Today's links Happy Public Domain Day: The public domain continues to roar back after decades in a coma. 2021 Daddy-Daughter podcast: The latest in a lengthy series. This day in history: 2002, 2007 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Happy Public Domain Day (permalink) On January 1, 2019 something extraordinary happened. For the first time since 1998, the American public domain got bigger. What happened in 1998? Congress – led by Rep Sonny Bono – extended the copyright on all works by 20 years. Works that had already been in the public domain went back into copyright. Works that were in copyright got an extra 20 years. The public domain…froze. This was a wanton, destructive act. The vast majority of works that the Sonny Bono…",
          "link": "https://pluralistic.net/2022/01/03/party-like-its-1926/",
          "publishedOn": "2022-01-03T16:28:58.000Z",
          "wordCount": 2534,
          "title": "Pluralistic: 03 Jan 2022",
          "enclosure": {
            "url": "https://archive.org/download/Cory_Doctorow_Podcast_410/Cory_Doctorow_Podcast_410_-_Daddy-Daughter_Podcast_2021_Edition.mp3",
            "length": "0",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://pluralistic.net/?p=2969",
          "author": "Cory Doctorow",
          "description": "Today's links Electrify: Saul Griffith's visionary, practical program for a US clean energy transition. This day in history: 2011, 2016 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Electrify (permalink) In Electrify, the MacArthur prizewinning engineer Saul Griffith offers a detailed, optimistic and urgent roadmap for a climate-respecting energy transition that we can actually accomplish in 10-15 years. There are a lot of popular science books out there, but the world really needs more popular engineering books – books that set out the technical parameters of our problems and the various proposed solutions, sorting the likely from the plausible to the foolish, and laying out a practical range of plans to accomplish the best of them. …",
          "link": "https://pluralistic.net/2021/12/09/practical-visionary/",
          "publishedOn": "2021-12-09T21:15:38.000Z",
          "wordCount": 2007,
          "title": "Pluralistic: 09 Dec 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2962",
          "author": "Cory Doctorow",
          "description": "Today's links All the books I reviewed in 2021: Plus one I published! Broken Promises: The Writers Guild of America West makes the case for media un-consolidation. How elite hobbies let billionaires pay no tax: More from Propublica's IRS Leaks. This day in history: 2011, 2016, 2020 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading All the books I reviewed in 2021 (permalink) This is more-or-less my last blogging day of 2021 (I may sneak a post or two in before the New Year, but I might not), so it's time for my annual roundup of my book reviews from the year gone by. I've sorted this year's books by genre (sf/f, other novels, graphic novels, YA, nonfic) and summarized the reviews with links to the full review. Here's last year's installme…",
          "link": "https://pluralistic.net/2021/12/08/required-ish-reading/",
          "publishedOn": "2021-12-08T16:15:37.000Z",
          "wordCount": 4172,
          "title": "Pluralistic: 08 Dec 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2955",
          "author": "Cory Doctorow",
          "description": "Today's links Podcasting \"Give Me Slack\": On the parenting challenges of an era without second chances. A lexicon of euphemisms for \"corporate crime\": Compliance, risk, white collar crime… IP lawyers weaponize trade secrecy to stall vaccine waivers: But Karan Menon has their number. This day in history: 2001, 2006, 2011, 2016, 2020 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Podcasting \"Give Me Slack\" (permalink) This week on my podcast, I read \"Give Me Slack,\" my latest column for Medium, about the second (and third, and fourth) chances I got growing up, and how scary it is that my kid – and yours – won't get those chances. https://doctorow.medium.com/give-me-slack-b4e88a007dbf From the fourth through the eighth grade, I attended a…",
          "link": "https://pluralistic.net/2021/12/07/solar-panel-for-a-sex-machine/",
          "publishedOn": "2021-12-07T16:37:56.000Z",
          "wordCount": 2779,
          "title": "Pluralistic: 07 Dec 2021",
          "enclosure": {
            "url": "https://archive.org/download/Cory_Doctorow_Podcast_409/Cory_Doctorow_Podcast_409_-_Give_Me_Slack.mp3",
            "length": "0",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://pluralistic.net/?p=2947",
          "author": "Cory Doctorow",
          "description": "Today's links When you hear \"one size fits all,\" think \"universal\": The origins and expansion of a right-wing shibboleth. This day in history: 2001, 2006, 2011, 2016, 2020 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading When you hear \"one size fits all,\" think \"universal\" (permalink) Once, the phrase \"one size fits all\" was a futuristic boast offered by manufacturers availing themselves of new, high-tech materials that stretched and flexed without tearing or deforming. Today, it's a curse-word used to damn universal programs. What happened? As is so often the case with big linguistic shifts, the culprit is capitalist realism, the ideology that there is no alternative to unfettered profit-seeking, which relies heavily on linguistic games…",
          "link": "https://pluralistic.net/2021/12/05/universalism/",
          "publishedOn": "2021-12-05T16:31:25.000Z",
          "wordCount": 2120,
          "title": "Pluralistic: 05 Dec 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2937",
          "author": "Cory Doctorow",
          "description": "Today's links Massive Predpol leak confirms that it drives racist policing: As with McKinsey consultants, buying Predpol is a way to buy outside validation for the indefensible. This day in history: 2001, 2016, 2020 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Massive Predpol leak confirms that it drives racist policing (permalink) When you or I seek out evidence to back up our existing beliefs and ignore the evidence that shows we're wrong, it's called \"confirmation bias.\" It's a well-understood phenomenon that none of us are immune to, and thoughtful people put a lot of effort into countering it in themselves. But confirmation bias isn't always an unconscious process. Consultancies like McKinsey have grown to multibillion-dollar ti…",
          "link": "https://pluralistic.net/2021/12/02/empirical-facewash/",
          "publishedOn": "2021-12-02T17:15:17.000Z",
          "wordCount": 2260,
          "title": "Pluralistic: 02 Dec 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2932",
          "author": "Cory Doctorow",
          "description": "Today's links Fintech is a scam, a listicle in eight parts: $91.5b/year, doubling every year. Teaching thread management with puzzle games: Rocky's Boots, 2021 edition. This day in history: 2001, 2006, 2011, 2016, 2020. Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Fintech is a scam, a listicle in eight parts (permalink) The world's economy ground to a halt during the pandemic as millions died, production slowed or stopped altogether, and the resulting supply chain disruptions made many essential products and services impossible to deliver. And yet, the world's billionaires added $5.5b to their net worth during that time. https://ips-dc.org/global-billionaires-see-5-5-trillion-pandemic-wealth-surge/ Thank \"financialization,\" the subor…",
          "link": "https://pluralistic.net/2021/12/01/satyajit-das/",
          "publishedOn": "2021-12-01T18:42:08.000Z",
          "wordCount": 2965,
          "title": "Pluralistic: 01 Dec 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2923",
          "author": "Cory Doctorow",
          "description": "Today's links The once and future mass-resignation and what it means for working people: On David Dayen's \"The Great Escape.\" This day in history: 2001, 2006, 2011, 2016 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading The once and future mass-resignation and what it means for working people (permalink) Once upon a time, a terrible disease swept the lands, prompting a great wave of resignations as low-waged workers walked off the job, rejecting offers of pay raises that would have been unthinkably lavish just a few years earlier. Their bosses went nuts. The former employers of these workers slammed them as lazy and greedy, and called upon their fellow bougies to take up \"unskilled\" labor and scab those proles back into the workplace. Whe…",
          "link": "https://pluralistic.net/2021/11/29/ordinance-of-labourers/",
          "publishedOn": "2021-11-29T16:43:44.000Z",
          "wordCount": 2584,
          "title": "Pluralistic: 29 Nov 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2919",
          "author": "Cory Doctorow",
          "description": "Today's links The Cuban vaccines: Omicron, vaccine apartheid, WTO TRIPS waivers and the false hope of viruses \"gentling\" themselves. This day in history: 2001, 2006, 2011, 2016 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading The Cuban vaccines (permalink) Are you low-key freaking out about omicron? Yeah, me too. Can't we catch a break? Maybe. Step one to preventing new, scarier mutant strains is to reduce the number of infected people, which require a mix of ventilation, masking, distancing, and, of course, vaccinations. These days, the \"vaccine controversy\" is primarily about vaccine-hesitancy and vaccine denial – that is, about people who can get the vaccine but choose not to. But if you cast your mind way, way, way back to last sprin…",
          "link": "https://pluralistic.net/2021/11/28/somos-cuba/",
          "publishedOn": "2021-11-28T15:55:23.000Z",
          "wordCount": 2599,
          "title": "Pluralistic: 28 Nov 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2906",
          "author": "Cory Doctorow",
          "description": "Today's links UK ICO: surveillance advertising is dead: A true consent framework would do the trick. This day in history: 2011, 2016 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading UK ICO: surveillance advertising is dead (permalink) Here's the theory behind Europe's GDPR: if an online service wants to collect, store and/or process your personal information, it has to obtain your real, informed consent for each of those activities. In theory, this should have exterminated surveillance-based \"behavioral\" ads. In practice, nothing of the sort has happened…yet. Let's look at the theory first. The ad-tech industry has long maintained that it obtains consent for all its data-processing. This is an obvious pretense. This \"consent\" consists of…",
          "link": "https://pluralistic.net/2021/11/26/ico-ico/",
          "publishedOn": "2021-11-26T19:07:40.000Z",
          "wordCount": 2697,
          "title": "Pluralistic: 26 Nov 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2902",
          "author": "Cory Doctorow",
          "description": "Today's links Unions are finally fighting two-tier contracts: How the actual fuck did they fail to see through this bullshit decades ago? McKinsey taught Big Pharma how to price-gouge: Leaked slides document the lies, sleaze and profiteering. This day in history: 2016, 2020 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Unions are finally fighting two-tier contracts (permalink) Now that Striketober has given way to Strikesgiving, let's pause for a moment and be grateful that labor made 2021 the year that unions wised up to the self-immolating scam that is the two-tier contract. As Alexandra Bradbury writes for Labor Notes, this year's most prominent labor actions fought against two-tier contracts, from the Teamsters to John Deere to Ka…",
          "link": "https://pluralistic.net/2021/11/25/strikesgiving/",
          "publishedOn": "2021-11-25T18:30:30.000Z",
          "wordCount": 2353,
          "title": "Pluralistic: 25 Nov 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2896",
          "author": "Cory Doctorow",
          "description": "Today's links Spaniards fight Wall Street landlords: When margins and misery are correlated. The Tesla-financial complex: When your financial instruments are better than your cars. This day in history: 2011, 2016, 2020 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Spaniards fight Wall Street landlords (permalink) One of the original sins of the modern economy was sidelining unions and social programs as a path to upward mobility and installing property speculation in their place. Converting the distribution of shelter (a human right and necessity) into a speculative asset had far-reaching consequences, and an eventual violent rupture was baked in from the start. A path to prosperity runs through the appreciation of your family home (n…",
          "link": "https://pluralistic.net/2021/11/24/no-puedo-pagar-no-pagara/",
          "publishedOn": "2021-11-24T19:31:01.000Z",
          "wordCount": 2877,
          "title": "Pluralistic: 24 Nov 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2890",
          "author": "Cory Doctorow",
          "description": "Today's links The definitive answers to Disney's pernicious queueing debates: Defunctland simulated a themepark and produced the first public data on queue-management strategies. This day in history: 2001, 2006, 2011, 2016, 2020 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading The definitive answers to Disney's pernicious queueing debates (permalink) Last summer, I wrote a six-part series on the history, future and present-day of queue- and crowd-management strategies at Disney themeparks, summarizing my endless reading, rumination, and direct experience on the question. https://doctorow.medium.com/disneyland-at-a-stroll-part-vi-62934f35aac1 Who gets to do what and when at a themepark may sound like a trivial question, but I think it's a…",
          "link": "https://pluralistic.net/2021/11/23/jump-in-the-line/",
          "publishedOn": "2021-11-23T16:26:08.000Z",
          "wordCount": 2473,
          "title": "Pluralistic: 23 Nov 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2878",
          "author": "Cory Doctorow",
          "description": "Today's links Private ambulances want a ban on firefighters rescuing babies: American Medical Response says Prescott Valley's firefighters shouldn't be allowed to operate an ambulance. Podcasting \"Jam To-Day\": How to free Big Tech's hostages on day one. This day in history: 2006, 2011, 2016, 2020 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Private ambulances want a ban on firefighters rescuing babies (permalink) Prescott Valley, AZ is home to 150,000 people and a single private ambulance operator with the exclusive regional franchise: Lifeline Ambulance, a division of American Medical Response (AMR) – a predatory monopolist that has snapped up many smaller ambulance companies and locked in lucrative exclusivity deals with many US ci…",
          "link": "https://pluralistic.net/2021/11/22/amr-vs-babies/",
          "publishedOn": "2021-11-22T16:55:25.000Z",
          "wordCount": 2320,
          "title": "Pluralistic: 21 Nov 2021",
          "enclosure": {
            "url": "https://archive.org/download/Cory_Doctorow_Podcast_408/Cory_Doctorow_Podcast_408_-_Jam-To-Day.mp3",
            "length": "0",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://pluralistic.net/?p=2871",
          "author": "Cory Doctorow",
          "description": "Today's links Inflation or price-gouging?: Big business loves inflation talk. This day in history: 2006, 2020 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Inflation or price-gouging? (permalink) You can't turn around these days without bumping into scary inflation talk, and with good reason: asset bubbles, supply chain shocks and energy geopolitics are on their way to wiping out most or all of the wage gains eked out by low-waged workers during the pandemic's labor shortage. The underlying message of this scare-talk is that we've been too generous with \"essential workers,\" by allowing them to inch a little closer to a living wage, and now it's time to roll that back, for their own good. What's the point of making $0.50/h more if it c…",
          "link": "https://pluralistic.net/2021/11/20/quiet-part-out-loud/",
          "publishedOn": "2021-11-20T16:15:56.000Z",
          "wordCount": 1893,
          "title": "Pluralistic: 20 Nov 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2868",
          "author": "Cory Doctorow",
          "description": "Today's links Teamsters transformed: Militant labor is strong labor. This day in history: 2001, 2016, 2020 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Teamsters transformed (permalink) It's one (true) thing to say that American union membership is down – that's a quantifiable, objective proposition. It's another to say that American unions are weak – and contrariwise, that unions are getting stronger. That's a lot more abstract and harder to pin down. If you'd like an unrolled version of this thread to read or share, here's a link to it on pluralistic.net, my surveillance-free, ad-free, tracker-free blog: https://pluralistic.net/2021/11/19/hoffa-jr-defeated/#teamsters-for-a-democratic-union But here's a nice, concrete version of wha…",
          "link": "https://pluralistic.net/2021/11/19/hoffa-jr-defeated/",
          "publishedOn": "2021-11-19T20:09:57.000Z",
          "wordCount": 1425,
          "title": "Pluralistic: 19 Nov 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2864",
          "author": "Cory Doctorow",
          "description": "Today's links This is your Congress on drugs: Corruption kills. Harvard is full of rich, white low-achievers: 43% of white Harvard students didn't get in on merit. This day in history: 2001, 2006, 2011, 2016, 2020 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading This is your Congress on drugs (permalink) Back in 2014, a pair of political scientists published a study of 1,779 US \"policy issues\" over 20 years, concluding that elected officials make policy to benefit the richest ten percent of the country to the exclusion of the needs of everyone else. https://www.cambridge.org/core/journals/perspectives-on-politics/article/testing-theories-of-american-politics-elites-interest-groups-and-average-citizens/62327F513959D0A304D4893B382B992B Thi…",
          "link": "https://pluralistic.net/2021/11/18/bipartisan-consensus/",
          "publishedOn": "2021-11-18T15:03:38.000Z",
          "wordCount": 1782,
          "title": "Pluralistic: 18 Nov 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2856",
          "author": "Cory Doctorow",
          "description": "Today's links Aspiration's comprehensively deceptive greenwashing: It's \"do well\" OR \"do good.\" Live Nation is to blame for the Astroworld deaths: Monopoly kills fandom, literally. This day in history: 2006, 2011, 2016 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Aspiration's comprehensively deceptive greenwashing (permalink) It's impossible to miss Aspiration's star-studded marketing blitz, in which a succession of A-listers promise you that you can save the planet by switching credit-cards (\"Do good. Do well.\"). They're emblematic of the promise of green capitalism, the idea that climate emergency is about a slight misconfiguration of the profit motive and the finance sector. If that's true, it's great news for our species, our civ…",
          "link": "https://pluralistic.net/2021/11/17/do-well-do-good-do-nothing/",
          "publishedOn": "2021-11-17T20:31:58.000Z",
          "wordCount": 2724,
          "title": "Pluralistic: 17 Nov 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2848",
          "author": "Cory Doctorow",
          "description": "Today's links What Police Get When They Get Your Phone: A new season of EFF's podcast, on cop-tech and what to do about it. This day in history: 2006, 2011, 2016, 2020 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading What Police Get When They Get Your Phone (permalink) It's not surprising that the debate over digital rights is dominated by technologists – after all, spotting risks (and promises) of technology requires a technical understanding. Likewise, it's not surprising that technologists are accused of solutionism – they've got a hammer, and they're gonna look for nails. The problem with this critique is that not every tech intervention is solutionism. I mean, sure, social problems are caused by social relations, but tech can change…",
          "link": "https://pluralistic.net/2021/11/16/cop-tech/",
          "publishedOn": "2021-11-16T17:33:45.000Z",
          "wordCount": 1914,
          "title": "Pluralistic: 16 Nov 2021",
          "enclosure": {
            "url": "https://archive.org/download/h2fti-ep1-harlan-yu-mix-vfinal/h2fti-ep1-harlan-yu-mix-vfinal.mp3",
            "length": "0",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://pluralistic.net/?p=2841",
          "author": "Cory Doctorow",
          "description": "Today's links Vizio makes more money spying on people who buy TVs than it does on TVs themselves: Even if you're paying for the product, you're still the product. This day in history: 2011, 2016 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Vizio makes more money spying on people who buy TVs than it does on TVs themselves (permalink) In the simplistic account of what many call \"surveillance capitalism,\" the original sin was swapping our attention for free content, summed up in the pithy phrase, \"If you're not paying for the product, you're the product.\" That's a comforting frame if you think that the problem with surveillance capitalism is surveillance, rather than capitalism. If you think that some companies want to make money the ho…",
          "link": "https://pluralistic.net/2021/11/14/still-the-product/",
          "publishedOn": "2021-11-14T16:00:15.000Z",
          "wordCount": 1981,
          "title": "Pluralistic: 14 Nov 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2835",
          "author": "Cory Doctorow",
          "description": "Today's links How to be safe(r) online: Ars Technica's excellent guide, by Sean Gallagher. This day in history: 2006, 2011, 2016, 2020 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading How to be safe(r) online (permalink) I flatter myself that I am pretty secure online. I've written a series of global bestsellers about information security, I've worked for EFF for nearly 20 years, I've given keynotes at some of the world's largest infosec conferences. And yet, I have been hacked. It wasn't even very sophisticated! It was in 2010. My kid had made a fuss about going to day-care so my wife and I were late walking to work. The cafe we always stopped at for a coffee had longer lines at that hour, so I stood in line while she sat down and read …",
          "link": "https://pluralistic.net/2021/11/13/opsec-soup-to-nuts/",
          "publishedOn": "2021-11-13T16:16:17.000Z",
          "wordCount": 2974,
          "title": "Pluralistic: 13 Nov 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2828",
          "author": "Cory Doctorow",
          "description": "Today's links American corporate criminals in the crosshairs (finally): Lisa Monaco says she's gonna enforce those bullshit deferred prosecution agreements. This day in history: 2001, 2011, 2016, 2020 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading American corporate criminals in the crosshairs (finally) (permalink) Though corporations in America routinely break the law, often with fatal consequences, it's fair to say America has no corporate criminals, because to have criminals, you need a criminal system that identifies criminal conduct and holds it to account. America does not have that. https://pluralistic.net/2021/10/12/no-criminals-no-crimes/#get-out-of-jail-free-card When American corporations break the law, the individuals in th…",
          "link": "https://pluralistic.net/2021/11/12/with-a-fountain-pen/",
          "publishedOn": "2021-11-12T18:10:38.000Z",
          "wordCount": 1913,
          "title": "Pluralistic: 12 Nov 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2818",
          "author": "Cory Doctorow",
          "description": "Today's links Risk compensation considered harmful: HPV vaccines, N95s, seatbelts, helmets and the Chicago Boys. This day in history: 2011, 2016, 2020 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Risk compensation considered harmful (permalink) The politicization of covid started early, with the \"noble lie\" that masks wouldn't prevent the spread of the disease, a lie told in a bid to prevent panic-shoppers buying up all the N95s that health workers needed. https://www.nytimes.com/2020/03/17/opinion/coronavirus-face-masks.html Safety talk is often a pretext: sometimes paternalistic, sometimes authoritarian and sometimes (ironically) anti-regulatory. The British \"health and safety gone mad\" panic of the 1990s is a perfect microcosm of …",
          "link": "https://pluralistic.net/2021/11/10/elfin-safety/",
          "publishedOn": "2021-11-10T15:00:54.000Z",
          "wordCount": 1780,
          "title": "Pluralistic: 10 Nov 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2811",
          "author": "Cory Doctorow",
          "description": "Today's links Stockholm's war on interoperability: An object lesson in how (not) to resolve the tension between comcom and privacy. This day in history: 2006, 2011, 2016, 2020 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Stockholm's war on interoperability (permalink) The city of Stockholm commissioned Skolplattform, an omnibus app to deliver timely information to students, teachers and parents. It was a mess: a late, SEK 1B (USD 117M) \"IT disaster\" boondoggle with a 1.2 star rating. https://play.google.com/store/apps/details?id=se.stockholm.vardnadshavare&amp;hl=en&amp;gl=US Among the groups that were poorly served by the app were parents, and among those parents was Christian Landgren, a software developer. Landgren created a strea…",
          "link": "https://pluralistic.net/2021/11/09/skrota-skolplattformen/",
          "publishedOn": "2021-11-09T14:59:56.000Z",
          "wordCount": 2444,
          "title": "Pluralistic: 09 Nov 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2803",
          "author": "Cory Doctorow",
          "description": "Today's links Imagining the end of capitalism: TINA, TAPAS, and Ministry for the Future. Charlie Jane Anders' Victories Greater Than Death: YA space opera that is thoroughly modern and crackling with adventure. Right-Clicker-Mentality: Bezzlers coin a phrase to describe the anti-bezzle. This day in history: 2006, 2011, 2016 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Imagining the end of capitalism (permalink) My latest column for Locus Magazine is \"The Unimaginable,\" about the relationship of science fiction plays to the future. Sf is a literature of inspiration and warning, not prediction. https://locusmag.com/2021/11/cory-doctorow-the-unimaginable/ I mean, thank goodness. If the future was predictable, there'd be no point in gett…",
          "link": "https://pluralistic.net/2021/11/08/tina-v-tapas/",
          "publishedOn": "2021-11-08T17:28:38.000Z",
          "wordCount": 2860,
          "title": "Pluralistic: 08 Nov 2021"
        }
      ]
    },
    {
      "title": "The Candybox Blog",
      "feedUrl": "http://www.nathalielawhead.com/candybox/feed",
      "siteUrl": "http://www.nathalielawhead.com/candybox",
      "articles": [
        {
          "id": "http://www.nathalielawhead.com/candybox/?p=5236",
          "author": "alienmelon",
          "description": "Yesterday GameJolt emailed a lot of people saying that their game was removed because the site’s new policy bans any game that “depicts, solicits, promotes, normalizes, or glorifies sexual acts, sexual solicitation, and sexual violence“. I got an email too for F2OGGY (Only one survives!). This seemed like an obvious error to me because this game has 0 depiction of anything sexual. The game Curtain also received this notice… Source: https://twitter.com/ldreamfeel/status/1478065400286007304 Curtain is a brilliant and critically acclaimed work of art that interrogates abuse. It’s far from a porn game. “CURTAIN is an interactive first-person narrative about Kaci & Ally,...",
          "link": "http://www.nathalielawhead.com/candybox/on-gamejolts-new-policy-why-stigmatizing-sex-in-games-is-harmful-to-the-medium-and-never-works",
          "publishedOn": "2022-01-04T22:53:16.000Z",
          "wordCount": 3706,
          "title": "On GameJolt’s new policy: why stigmatizing “sex” in games is harmful to the medium and never works…"
        },
        {
          "id": "http://www.nathalielawhead.com/candybox/?p=5229",
          "author": "alienmelon",
          "description": "~ This post is my epic roundup of recommendations for 202x! ~ When we talk about games, especially the indie game space, most of the games we suggest are ones with lots of critical acclaim, playtime, and that demand plenty of involvement. Playing a game these days feels like as much of a financial investment as it becomes a life investment. I find myself drawn more and more to spelunking itch.io for tiny hidden gems… getting lost while diving into all the developer pages filled with all these odd little works. Browsing itch or GameJolt has become almost as rewarding...",
          "link": "http://www.nathalielawhead.com/candybox/tiny-indiegames-and-the-joy-of-very-small-things",
          "publishedOn": "2021-12-30T01:53:05.000Z",
          "wordCount": 4744,
          "title": "Tiny indiegames and the joy of Very Small Things"
        },
        {
          "id": "http://www.nathalielawhead.com/candybox/?p=5209",
          "author": "alienmelon",
          "description": "I’ve been wanting to do another post talking about indie games, analyzing game design, and showcasing good examples from the indie space but… I’m struggling a lot with being afraid of unintentionally platforming an abuser. I know saying that out loud sounds irrational, maybe. It’s been hard finding love for a space that I feel like happily decided people like me are a justifiable loss if it means making snarky Twitter Takes about what they’re going through… or just benefiting from indifference. I don’t know anymore… I don’t want to rant. I want to talk about game design. It’s hard...",
          "link": "http://www.nathalielawhead.com/candybox/red-dead-redemption-2-as-a-commentary-on-the-game-industry-my-love-hate-relationship-with-it",
          "publishedOn": "2021-12-21T03:59:32.000Z",
          "wordCount": 5215,
          "title": "Red Dead Redemption 2 as a commentary on The Game Industry (my love–hate relationship with it)",
          "enclosure": {
            "url": "http://nathalielawhead.com/noodles/rdr2-screenshots/cleaningtheair.mp4",
            "length": "27823182",
            "type": "video/mp4"
          }
        },
        {
          "id": "http://www.nathalielawhead.com/candybox/?p=5173",
          "author": "alienmelon",
          "description": "I recently gave a keynote talk at the ATLAS Institute at the University of Colorado’s Whaaat!? 2021 Festival. A festival focusing on small and quirky games and experimental interactions. They’re doing wonderful work. I’m honored to have been part of this, talking about something very near and dear to my heart. This post is that keynote turned into a blog post. I’m sharing a lot of links here! Mind the in-line text links too for good resources. I hope this will be useful to people that share this same interest. ~ ~ ~ As most of you know, my work...",
          "link": "http://www.nathalielawhead.com/candybox/make-tiny-weird-software-please-all-about-desktop-pets-old-computer-eras-and-virtual-toys",
          "publishedOn": "2021-11-15T23:13:04.000Z",
          "wordCount": 6023,
          "title": "Make Tiny Weird Software, Please! (all about desktop pets, old computer eras, and virtual toys)"
        },
        {
          "id": "http://www.nathalielawhead.com/candybox/?p=5179",
          "author": "alienmelon",
          "description": "This is a continuation of my original post “In support of Wren (the abuse she endured while working on Fight Knight)“. More things have happened since I originally voiced support for Wren and I think it’s really important to discuss how this is all unfolding, in order to hold those responsible for this abuse accountable. I will do my best to be as concise as possible. I am still shook up. TW: severe content warning for all this. Hello, I'm the \"writer\" of the Dangen Warning and the former writer of Fight Knight. I feel it's important for me to...",
          "link": "http://www.nathalielawhead.com/candybox/part-2-in-support-of-wren-the-abuse-she-continues-to-endure-fight-knight-and-publicly-ridiculing-her-trauma",
          "publishedOn": "2021-11-13T01:55:14.000Z",
          "wordCount": 3864,
          "title": "Part 2: In support of Wren (the abuse she continues to endure, Fight Knight, and publicly ridiculing her trauma)"
        }
      ]
    }
  ],
  "cliVersion": "1.11.3"
}