{
  "sources": [
    {
      "title": "Christian Heilmann",
      "feedUrl": "https://christianheilmann.com/feed/",
      "siteUrl": "https://christianheilmann.com",
      "articles": [
        {
          "id": "https://christianheilmann.com/?p=7268",
          "author": "Chris Heilmann",
          "description": "When you have your OS set up in dark mode seeing bright form elements is grating. By starting your style sheet with a single line of CSS, you can make sure that people using dark mode get dark form elements and backgrounds and those using light mode, light ones. You can see it in this […]",
          "link": "https://christianheilmann.com/2022/06/20/one-line-of-css-to-add-basic-dark-light-mode/",
          "publishedOn": "2022-06-20T22:33:20.000Z",
          "wordCount": 423,
          "title": "One line of CSS to add basic dark/light mode",
          "imageUrl": null
        },
        {
          "id": "https://christianheilmann.com/?p=7265",
          "author": "Chris Heilmann",
          "description": "GitHub Copilot is already the dog’s bollocks, but I just installed the GitHub Labs extension and my jaw is still open. Code explanation This one allows you to highlight a piece of code and get explanations of what it does: For example: async function downloadZipFile(downloadUrl) { await fs.remove(‘out/edge’); const file = fs.createWriteStream(‘edge.zip’); https.get(downloadUrl, function(response) { […]",
          "link": "https://christianheilmann.com/2022/06/07/github-copilot-explaining-code-and-translating-it-from-one-language-to-another/",
          "publishedOn": "2022-06-07T20:57:10.000Z",
          "wordCount": 344,
          "title": "GitHub Copilot explaining code and translating it from one language to another",
          "imageUrl": null
        },
        {
          "id": "https://christianheilmann.com/?p=7259",
          "author": "Chris Heilmann",
          "description": "Last week I was at build Europe and talked to a lot of people about the developer market. The general consensus was that there is a huge lack of developers to hire. That there is not enough talent. When I poked further and asked about how people assess talent, it boiled down to people having […]",
          "link": "https://christianheilmann.com/2022/05/31/do-we-have-a-lack-of-developers-or-a-false-assumption-what-the-job-is/",
          "publishedOn": "2022-05-31T10:03:04.000Z",
          "wordCount": 565,
          "title": "Do we have a lack of developers or a false assumption what the job is?",
          "imageUrl": null
        },
        {
          "id": "https://christianheilmann.com/?p=7256",
          "author": "Chris Heilmann",
          "description": "What people think web developers do: Code, deploy and use, with coding being the main task What web developers really do: Coding Require random 3rd party framework code Updating Node/NPM Try the last command again with `sudo` Checking on mobile Shaking fist towards Cupertino Looking things up on the web Pasting Stack Overflow solutions Resize […]",
          "link": "https://christianheilmann.com/2022/05/27/what-people-think-that-web-developers-do-vs-what-we-really-do/",
          "publishedOn": "2022-05-27T09:09:56.000Z",
          "wordCount": 279,
          "title": "What people think that web developers do vs. what we really do",
          "imageUrl": null
        },
        {
          "id": "https://christianheilmann.com/?p=7253",
          "author": "Chris Heilmann",
          "description": "Currently I am recording a lot of videos and I found the fastest way to do them is to write the script and read it out to my camera and then record screencasts and edit them to fit the narration. In order to make sure I read from the top of the screen and reading […]",
          "link": "https://christianheilmann.com/2022/05/25/a-teleprompter-script-for-video-recordings/",
          "publishedOn": "2022-05-25T21:03:21.000Z",
          "wordCount": null,
          "title": "A teleprompter script for video recordings",
          "imageUrl": null
        },
        {
          "id": "https://christianheilmann.com/?p=7249",
          "author": "Chris Heilmann",
          "description": "You never create one product on the web – you create a product that people can change to their needs. At least you should. I’ve been working on the web since 1997 and one thing I realised early on is a big basic idea of the web: You do not control how your web product […]",
          "link": "https://christianheilmann.com/2022/05/19/global-accessbility-awareness-day-does-your-web-product-support-the-needs-of-the-many/",
          "publishedOn": "2022-05-19T17:07:54.000Z",
          "wordCount": 832,
          "title": "Global Accessbility Awareness Day – Does your web product support the needs of the many?",
          "imageUrl": null
        },
        {
          "id": "https://christianheilmann.com/?p=7246",
          "author": "Chris Heilmann",
          "description": "The Inspect tool is a great way to get information about different page elements before selecting then. Once it is enabled, it shows an information overlay as you move from element to element. The main problem with the tool is that sometimes it is tough to get the information about the right element, as they […]",
          "link": "https://christianheilmann.com/2022/05/17/fixing-the-accessibility-of-inspection-overlays/",
          "publishedOn": "2022-05-17T14:56:41.000Z",
          "wordCount": 429,
          "title": "Fixing the accessibility of Inspection overlays",
          "imageUrl": null
        },
        {
          "id": "https://christianheilmann.com/?p=7244",
          "author": "Chris Heilmann",
          "description": "Using the Quick edit bookmarklet you can make any web site editable. Drag it to your favourites toolbar, click it and you get into edit mode. You can edit, copy and paste, delete and anything else. Hitting `ESC` will end edit mode. You can use this to quickly edit web sites before taking a screenshot, […]",
          "link": "https://christianheilmann.com/2022/05/12/a-quick-edit-bookmarklet-to-make-changes-to-any-web-site/",
          "publishedOn": "2022-05-12T19:29:56.000Z",
          "wordCount": 217,
          "title": "A “Quick Edit” bookmarklet to make changes to any web site",
          "imageUrl": null
        },
        {
          "id": "https://christianheilmann.com/?p=7237",
          "author": "Chris Heilmann",
          "description": "Last week, Šime Vidas complained on Twitter that it is hard to paste a block of text on a mobile device. I proposed to use pastebin.com but that needs a lot of taps before you paste. Šime then proceeded to joke that we should create pastebinzero.com and all it needs is a full-screen. So I […]",
          "link": "https://christianheilmann.com/2022/05/09/someone-should-build-x-for-the-web-why-not-you-all-you-need-is-a-github-account/",
          "publishedOn": "2022-05-09T20:16:51.000Z",
          "wordCount": 792,
          "title": "Someone should build X for the web” – why not you? All you need is a GitHub account",
          "imageUrl": null
        },
        {
          "id": "https://christianheilmann.com/?p=7229",
          "author": "Chris Heilmann",
          "description": "The V2 version of the Microsoft Edge DevTools for Visual Studio Code extension is now live. We’ve worked hard to make the current feature set more stable and introduced new ones. Console integration Console Integration – makes it easier to use `console.log()` or interact with the document right from the developer tools. We found the […]",
          "link": "https://christianheilmann.com/2022/05/05/edge-devtools-for-visual-studio-code-v2-new-browser-preview-with-emulation-and-sourcemap-support/",
          "publishedOn": "2022-05-05T12:51:29.000Z",
          "wordCount": 781,
          "title": "Edge DevTools for Visual Studio Code V2 – new browser preview with emulation and sourcemap support",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Hundred Rabbits",
      "feedUrl": "https://100r.co/links/rss.xml",
      "siteUrl": "https://100r.co",
      "articles": [
        {
          "id": "log.html#may2022",
          "author": "Rekka Bellum",
          "description": "Hey everyone! This is the list of all the changes we've done to our projects and apps during the month of May. We'll also be reporting in our on position in the world, and on our future plans.\nSummary Of Changes\nCombinatory Logic, wrote a guide to combinatory logic, using talking birds.\n, released a linter, and optimized uxnasm.\nDexe, released an updated version.\n100r.co, added batteries, and regulator.\nNews\nFrom this month until next October, our updates may be delayed. We are sailing northward, towards Desolation Sound and the Broughtons, where cell towers are few. We will wander in and out of such regions all summer. So far, we sailed up to the Gulf Islands, and over to Nanaimo from Victoria, and then crossed the Strait of Georgia over to the Sunshine Coast(close-reaching in 20-knot winds). This was a good shakedown for Pino, a good way to re-awaken our little vessel. All went well, but we ought to have secured our produce better... some of our potatoes escaped their nest and went out for an afternoon roll around the cabin floor.\nStart of May, we had some issues with our batteries. They've been acting out for some time, we think because of a dead cell. We have been operating at half battery capacity for a month, and realized that yet again we don't need that much power, especially in the summer when the days are long.\nThe combinatory logic guide is the first of many projects we plan to release this summer. We also released an sign language version of Uxntal.\nIn other news, a version of Collapse OS was ported to Uxn.\nPino book club\nWe're reading Watership Down by Richard Adams.\nContinue Reading",
          "link": "https://100r.co/site/log.html#may2022",
          "publishedOn": "2022-06-01T00:00:00.000Z",
          "wordCount": 3676,
          "title": "Summary of changes for May",
          "imageUrl": null
        },
        {
          "id": "log.html#apr2022",
          "author": "Rekka Bellum",
          "description": "Hey everyone! This is the list of all the changes we've done to our projects and apps during the month of April. We'll also be reporting in our on position in the world, and on our future plans.\nSummary Of Changes\nBicycle, released an Uxntal playground. See Varvara riding a Sinclair bike.\nUxn, wrote a linux native implementation of Varvara, as well as an HTML5 implementation of the virtual machine.\nTurquoise, released a little line plotting system.\n100r.co, added sewing, Shimoda, Cathedral Grove, and mini dodger.\nNebu, working on a spreadsheet editor in Uxn.\nNews\nThe month of April was a time of boat projects. We built a mini dodger to cover the companionway, and installed a large spindle for floating rope on Pino's stern (marine stores give those spindles away for free, usually). In these waters, it is often necessary to stern tie to shore when anchoring and the spindle will make it easier to uncoil the line.\nWe also took some time off to visit some ancient trees in Cathedral Grove on Vancouver Island.\nDevine found some slide rules and wrote a guide on how to use them.\nIf you want to play Catpot, the little Hypercard game we made for Merveilles Hyperjam 2020, you can play it with this Hypercard Simulator (thank you Dan).\nPino book club\nWe're reading The Stranger by Albert Camus.\nContinue Reading",
          "link": "https://100r.co/site/log.html#apr2022",
          "publishedOn": "2022-05-01T00:00:00.000Z",
          "wordCount": 3430,
          "title": "Summary of changes for April",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Blog on SaraSoueidan.com",
      "feedUrl": "https://www.sarasoueidan.com/blog/index.xml",
      "siteUrl": "https://sarasoueidan.com/blog/",
      "articles": []
    },
    {
      "title": "there.oughta.be/",
      "feedUrl": "https://there.oughta.be/feed.xml",
      "siteUrl": "https://there.oughta.be/",
      "articles": []
    },
    {
      "title": "Grumpy Gamer",
      "feedUrl": "https://grumpygamer.com/rss",
      "siteUrl": "https://grumpygamer.com",
      "articles": [
        {
          "id": "https://grumpygamer.com/dev_diary",
          "author": null,
          "description": "Jul 17, 2020\nFirst official day is Monday but I've started setting up Slack and other web services.\nJul 18, 2020\nOrdered Linux machine. Talked to Dave about maybe controlling Elaine for a section of the game.  \nStarting to worry about finding great people. It's going to be hard because we have to keep the project a secret.\nPlayed MI1 again. Taking a lot of notes about what made MI MI.  After TWP and fast walk and other almost invisible improvements, it's painful to play a 35 year-old adventure game.\nI was surprised at how many objects didn't have custom default responses. A large number of objects just said \"That doesn't seem to work.\"\nJul 19, 2020\nPlayed MI again.\nJul 20, 2020\nWorking with the lawyer to get contractor contracts done that conform to Disney's requirements. Taking longer than I thought.\nHope to get Dave's contract done by tomorrow.\nJul 23, 2020\nFirst \"real\" design meeting with dave.  Laying down the backbone puzzles for Act 1.\nJul 24, 2020\nStarted the Puzzle Dependency Chart for Act 1.\nJul 27, 2020\nJenn started\nJul 28, 2020\nMaking good progress on design.  I know we'll slow down when we have to do all the details.  Looking forward to getting a concept artist.  Things come alive for me when concepts start to come in.\nNov 17, 2020\nStarting up diary again... maybe I'll be able to keep it going this time.\nThinking about the ui. I hate the current status-quo.\nNov 18, 2020\nMeeting with Disney.\nMay 25, 2022\nYep, this dev diary didn't last long.",
          "link": "https://grumpygamer.com/dev_diary",
          "publishedOn": "2022-05-25T07:00:00.000Z",
          "wordCount": null,
          "title": "Return to Monkey Island Dev Diary",
          "imageUrl": null
        },
        {
          "id": "https://grumpygamer.com/when_i_made_another_monkeyisland",
          "author": null,
          "description": "Nine years ago I wrote a blog post titled \"If I made another Monkey Island\" and it feels like there are some things I need to say.\nI can't remember the exact incident, but the day I wrote that I was feeling down about never being able to make another Monkey Island.  I wrote it in a single afternoon, and it was not much more than a stream of thoughts. In the movie version, tears would have been pouring down my cheeks, but it wasn't the movie version so I was probably sipping coffee and eating a chocolate chip cookie.\nMy point is these were not commandments handed down and etched in stone on a giant tablet. They were just random thoughts about a (then very unlikely) new Monkey Island game. \nNone of these are promises or anything I owe anybody.\nPeople talk a lot about Monkey Island 3a as if i…",
          "link": "https://grumpygamer.com/when_i_made_another_monkeyisland",
          "publishedOn": "2022-05-01T07:00:00.000Z",
          "wordCount": 993,
          "title": "When I Made Another Monkey Island",
          "imageUrl": "https://images-grumpygamer.nyc3.digitaloceanspaces.com/\n"
        }
      ]
    },
    {
      "title": "Emily Short's Interactive Storytelling",
      "feedUrl": "https://emshort.blog/feed/",
      "siteUrl": "https://emshort.blog",
      "articles": [
        {
          "id": "http://emshort.blog/?p=42723",
          "author": "Emily Short",
          "description": "Events Games may be submitted for ParserComp, a jam for parser-based interactive fiction, through June 30; then there will be a judging window July 1 – July 31, where players can try all the games and weigh in on their favourites. July 2, the San Francisco Bay IF Meetup gets together. July 10, 2-4 PM … Continue reading \"Mid-June Link Assortment\"",
          "link": "https://emshort.blog/2022/06/15/mid-june-link-assortment-7/",
          "publishedOn": "2022-06-15T17:30:00.000Z",
          "wordCount": 1594,
          "title": "Mid-June Link Assortment",
          "imageUrl": "https://s0.wp.com/i/blank.jpg"
        },
        {
          "id": "http://emshort.blog/?p=42708",
          "author": "Emily Short",
          "description": "Events June 4 is the next meeting of the SF Bay IF Meetup. June 5 is the next meeting of the Seattle IF group, 2-4 PM PDT. Narrascope registrations are now open for July 30-31: the event is low-cost and remote, and features speakers on many aspects of interactive narrative. Releases Hannah Nicklin’s Writing for … Continue reading \"End of May Link Assortment\"",
          "link": "https://emshort.blog/2022/05/31/end-of-may-link-assortment-8/",
          "publishedOn": "2022-05-31T17:53:00.000Z",
          "wordCount": 1698,
          "title": "End of May Link Assortment",
          "imageUrl": "https://emshort.files.wordpress.com/2022/05/fermentationist.png"
        },
        {
          "id": "http://emshort.blog/?p=42646",
          "author": "Emily Short",
          "description": "Events June 4 is the next meeting of the SF Bay IF Meetup.",
          "link": "https://emshort.blog/2022/05/15/mid-may-link-assortment-5/",
          "publishedOn": "2022-05-15T17:30:00.000Z",
          "wordCount": 1418,
          "title": "Mid-May Link Assortment",
          "imageUrl": "https://s0.wp.com/i/blank.jpg"
        },
        {
          "id": "http://emshort.blog/?p=42644",
          "author": "Emily Short",
          "description": "Events May 1 (tomorrow!) the London IF Meetup plays Spring Thing games together, 2 PM-5 PM British time. May 4, the Unnamed IF Book Club meets, also discussing Spring Thing games – though very possibly a different set of them. There are lots of entries this year. LudoNarraCon, May 5-9, is an event running on Steam … Continue reading \"End of April Link Assortment\"",
          "link": "https://emshort.blog/2022/04/30/end-of-april-link-assortment-6/",
          "publishedOn": "2022-04-30T17:30:00.000Z",
          "wordCount": 1757,
          "title": "End of April Link Assortment",
          "imageUrl": "https://emshort.files.wordpress.com/2022/04/screenshot-2022-04-28-at-10.44.51.png"
        }
      ]
    },
    {
      "title": "xkcd.com",
      "feedUrl": "https://xkcd.com/atom.xml",
      "siteUrl": "https://xkcd.com/",
      "articles": [
        {
          "id": "https://xkcd.com/2637/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/roman_numerals.png\" title=\"100he100k out th1s 1nno5at4e str1ng en100o501ng 15e been 500e5e50op1ng! 1t's 6rtua100y perfe100t! ...hang on, what's a &quot;virtuacy&quot;?\" alt=\"100he100k out th1s 1nno5at4e str1ng en100o501ng 15e been 500e5e50op1ng! 1t's 6rtua100y perfe100t! ...hang on, what's a &quot;virtuacy&quot;?\" />",
          "link": "https://xkcd.com/2637/",
          "publishedOn": "2022-06-24T00:00:00.000Z",
          "wordCount": 223,
          "title": "Roman Numerals",
          "imageUrl": "https://imgs.xkcd.com/comics/roman_numerals_2x.png"
        },
        {
          "id": "https://xkcd.com/2636/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/what_if_2_countdown.png\" title=\"If you don't end the 99 Bottles of Beer recursion at N=0 it just becomes The Other Song That Never Ends.\" alt=\"If you don't end the 99 Bottles of Beer recursion at N=0 it just becomes The Other Song That Never Ends.\" />",
          "link": "https://xkcd.com/2636/",
          "publishedOn": "2022-06-22T00:00:00.000Z",
          "wordCount": 227,
          "title": "What If? 2 Countdown",
          "imageUrl": "https://imgs.xkcd.com/comics/what_if_2_countdown_2x.png"
        },
        {
          "id": "https://xkcd.com/2635/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/superintelligent_ais.png\" title=\"Your scientists were so preoccupied with whether or not they should, they didn't stop to think if they could.\" alt=\"Your scientists were so preoccupied with whether or not they should, they didn't stop to think if they could.\" />",
          "link": "https://xkcd.com/2635/",
          "publishedOn": "2022-06-20T00:00:00.000Z",
          "wordCount": 223,
          "title": "Superintelligent AIs",
          "imageUrl": "https://imgs.xkcd.com/comics/superintelligent_ais_2x.png"
        },
        {
          "id": "https://xkcd.com/2634/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/red_line_through_https.png\" title=\"Some organization has been paying to keep this up and it hasn't been removed from search results. Seems like two votes of confidence to me.\" alt=\"Some organization has been paying to keep this up and it hasn't been removed from search results. Seems like two votes of confidence to me.\" />",
          "link": "https://xkcd.com/2634/",
          "publishedOn": "2022-06-17T00:00:00.000Z",
          "wordCount": 227,
          "title": "Red Line Through HTTPS",
          "imageUrl": "https://imgs.xkcd.com/comics/red_line_through_https_2x.png"
        },
        {
          "id": "https://xkcd.com/2633/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/astronomer_hotline.png\" title=\"Employment statistics have to correct for the fact that the Weird Bug Hotline hires on a bunch of extra temporary staff every 17 years.\" alt=\"Employment statistics have to correct for the fact that the Weird Bug Hotline hires on a bunch of extra temporary staff every 17 years.\" />",
          "link": "https://xkcd.com/2633/",
          "publishedOn": "2022-06-15T00:00:00.000Z",
          "wordCount": 197,
          "title": "Astronomer Hotline",
          "imageUrl": "https://imgs.xkcd.com/comics/astronomer_hotline_2x.png"
        },
        {
          "id": "https://xkcd.com/2632/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/greatest_scientist.png\" title=\"&quot;Ow! One of the petri dishes I left on the tower railing fell and hit me on the head! Hey, that gives me an idea...&quot;\" alt=\"&quot;Ow! One of the petri dishes I left on the tower railing fell and hit me on the head! Hey, that gives me an idea...&quot;\" />",
          "link": "https://xkcd.com/2632/",
          "publishedOn": "2022-06-13T00:00:00.000Z",
          "wordCount": 197,
          "title": "Greatest Scientist",
          "imageUrl": "https://imgs.xkcd.com/comics/greatest_scientist_2x.png"
        },
        {
          "id": "https://xkcd.com/2631/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/exercise_progression.png\" title=\"They said after I got into a routine, I'd enjoy getting progressively stronger and stop whining so much about how hard exercise was. Well, they were half right!\" alt=\"They said after I got into a routine, I'd enjoy getting progressively stronger and stop whining so much about how hard exercise was. Well, they were half right!\" />",
          "link": "https://xkcd.com/2631/",
          "publishedOn": "2022-06-10T00:00:00.000Z",
          "wordCount": 197,
          "title": "Exercise Progression",
          "imageUrl": "https://imgs.xkcd.com/comics/exercise_progression_2x.png"
        },
        {
          "id": "https://xkcd.com/2630/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/shuttle_skeleton.png\" title=\"It's believed to be related to the Stellar Sea Cow.\" alt=\"It's believed to be related to the Stellar Sea Cow.\" />",
          "link": "https://xkcd.com/2630/",
          "publishedOn": "2022-06-08T00:00:00.000Z",
          "wordCount": 197,
          "title": "Shuttle Skeleton",
          "imageUrl": "https://imgs.xkcd.com/comics/shuttle_skeleton_2x.png"
        },
        {
          "id": "https://xkcd.com/2629/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/or_whatever.png\" title=\"Oh yeah, I didn't even know they renamed it the Willis Tower in 2009, because I know a normal amount about skyscrapers.\" alt=\"Oh yeah, I didn't even know they renamed it the Willis Tower in 2009, because I know a normal amount about skyscrapers.\" />",
          "link": "https://xkcd.com/2629/",
          "publishedOn": "2022-06-06T00:00:00.000Z",
          "wordCount": 197,
          "title": "Or Whatever",
          "imageUrl": "https://imgs.xkcd.com/comics/or_whatever_2x.png"
        },
        {
          "id": "https://xkcd.com/2628/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/motion_blur.png\" title=\"I can't speak for your other subjects, but MY motion was as smooth and natural as the framerate allowed.\" alt=\"I can't speak for your other subjects, but MY motion was as smooth and natural as the framerate allowed.\" />",
          "link": "https://xkcd.com/2628/",
          "publishedOn": "2022-06-03T00:00:00.000Z",
          "wordCount": 197,
          "title": "Motion Blur",
          "imageUrl": "https://imgs.xkcd.com/comics/motion_blur_2x.png"
        },
        {
          "id": "https://xkcd.com/2627/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/types_of_scopes.png\" title=\"An x-ray gyroscope is used to determine exactly which toppings they included in the pita.\" alt=\"An x-ray gyroscope is used to determine exactly which toppings they included in the pita.\" />",
          "link": "https://xkcd.com/2627/",
          "publishedOn": "2022-06-01T00:00:00.000Z",
          "wordCount": 199,
          "title": "Types of Scopes",
          "imageUrl": "https://imgs.xkcd.com/comics/types_of_scopes_2x.png"
        },
        {
          "id": "https://xkcd.com/2626/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/d65536.png\" title=\"They're robust against quantum attacks because it's hard to make a quantum system that large.\" alt=\"They're robust against quantum attacks because it's hard to make a quantum system that large.\" />",
          "link": "https://xkcd.com/2626/",
          "publishedOn": "2022-05-30T00:00:00.000Z",
          "wordCount": 195,
          "title": "d65536",
          "imageUrl": "https://imgs.xkcd.com/comics/d65536_2x.png"
        },
        {
          "id": "https://xkcd.com/2625/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/field_topology.png\" title=\"The combination croquet set/10-lane pool can also be used for some varieties of foosball and Skee-Ball.\" alt=\"The combination croquet set/10-lane pool can also be used for some varieties of foosball and Skee-Ball.\" />",
          "link": "https://xkcd.com/2625/",
          "publishedOn": "2022-05-27T00:00:00.000Z",
          "wordCount": 197,
          "title": "Field Topology",
          "imageUrl": "https://imgs.xkcd.com/comics/field_topology_2x.png"
        },
        {
          "id": "https://xkcd.com/2624/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/voyager_wires.png\" title=\"Also, they're getting increasingly worried that someone will accidentally hit the 'retract' button, and that the end of the cable thrashing around as it winds up could devastate the Earth's surface.\" alt=\"Also, they're getting increasingly worried that someone will accidentally hit the 'retract' button, and that the end of the cable thrashing around as it winds up could devastate the Earth's surface.\" />",
          "link": "https://xkcd.com/2624/",
          "publishedOn": "2022-05-25T00:00:00.000Z",
          "wordCount": null,
          "title": "Voyager Wires",
          "imageUrl": null
        },
        {
          "id": "https://xkcd.com/2623/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/goofs.png\" title=\"The film is set in 2018, but when Commander Bremberly chases the hologram through Times Square, there's a billboard for Avengers: Age of Ultron. Depending on the date, that billboard would have been advertising either Infinity War or this movie.\" alt=\"The film is set in 2018, but when Commander Bremberly chases the hologram through Times Square, there's a billboard for Avengers: Age of Ultron. Depending on the date, that billboard would have been advertising either Infinity War or this movie.\" />",
          "link": "https://xkcd.com/2623/",
          "publishedOn": "2022-05-23T00:00:00.000Z",
          "wordCount": 195,
          "title": "Goofs",
          "imageUrl": "https://imgs.xkcd.com/comics/goofs_2x.png"
        },
        {
          "id": "https://xkcd.com/2622/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/angular_diameter_turnaround.png\" title=\"Thank you to Katie Mack for teaching me about this effect, and to Janelle Shane for describing redshifts as 'like galaxies sinking into a pool of dilute blood,' which is how I'll see them from now on.\" alt=\"Thank you to Katie Mack for teaching me about this effect, and to Janelle Shane for describing redshifts as 'like galaxies sinking into a pool of dilute blood,' which is how I'll see them from now on.\" />",
          "link": "https://xkcd.com/2622/",
          "publishedOn": "2022-05-20T00:00:00.000Z",
          "wordCount": 199,
          "title": "Angular Diameter Turnaround",
          "imageUrl": "https://imgs.xkcd.com/comics/angular_diameter_turnaround_2x.png"
        },
        {
          "id": "https://xkcd.com/2621/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/mainly_known_for.png\" title=\"Oh sure, I know Keira Knightly, from the first movie in that series by The Land Before Time producer. You know, the franchise with the guy from Jurassic Park and Ghostwriter, and script work by Billie Lourd's mom?\" alt=\"Oh sure, I know Keira Knightly, from the first movie in that series by The Land Before Time producer. You know, the franchise with the guy from Jurassic Park and Ghostwriter, and script work by Billie Lourd's mom?\" />",
          "link": "https://xkcd.com/2621/",
          "publishedOn": "2022-05-18T00:00:00.000Z",
          "wordCount": 199,
          "title": "Mainly Known For",
          "imageUrl": "https://imgs.xkcd.com/comics/mainly_known_for_2x.png"
        },
        {
          "id": "https://xkcd.com/2620/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/health_data.png\" title=\"Donate now to help us find a cure for causality. No one should have to suffer through events because of other events.\" alt=\"Donate now to help us find a cure for causality. No one should have to suffer through events because of other events.\" />",
          "link": "https://xkcd.com/2620/",
          "publishedOn": "2022-05-16T00:00:00.000Z",
          "wordCount": 197,
          "title": "Health Data",
          "imageUrl": "https://imgs.xkcd.com/comics/health_data_2x.png"
        },
        {
          "id": "https://xkcd.com/2619/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/crepe.png\" title=\"A medicine that makes you put two dots over your letters more often is a diäretic.\" alt=\"A medicine that makes you put two dots over your letters more often is a diäretic.\" />",
          "link": "https://xkcd.com/2619/",
          "publishedOn": "2022-05-13T00:00:00.000Z",
          "wordCount": 195,
          "title": "Crêpe",
          "imageUrl": "https://imgs.xkcd.com/comics/crepe_2x.png"
        },
        {
          "id": "https://xkcd.com/2618/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/selection_bias.png\" title=\"We carefully sampled the general population and found that most people are familiar with acquiescence bias.\" alt=\"We carefully sampled the general population and found that most people are familiar with acquiescence bias.\" />",
          "link": "https://xkcd.com/2618/",
          "publishedOn": "2022-05-11T00:00:00.000Z",
          "wordCount": 197,
          "title": "Selection Bias",
          "imageUrl": "https://imgs.xkcd.com/comics/selection_bias_2x.png"
        },
        {
          "id": "https://xkcd.com/2617/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/maps.png\" title=\"OpenStreetMap was always pretty good but is also now *really* good? And Apple Maps's new zoomed-in design in certain cities like NYC and London is just gorgeous. It's cool how there are all these good maps now!\" alt=\"OpenStreetMap was always pretty good but is also now *really* good? And Apple Maps's new zoomed-in design in certain cities like NYC and London is just gorgeous. It's cool how there are all these good maps now!\" />",
          "link": "https://xkcd.com/2617/",
          "publishedOn": "2022-05-09T00:00:00.000Z",
          "wordCount": 195,
          "title": "Maps",
          "imageUrl": "https://imgs.xkcd.com/comics/maps_2x.png"
        },
        {
          "id": "https://xkcd.com/2616/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/deep_end.png\" title=\"Hey! No running in the back-arc basin!\" alt=\"Hey! No running in the back-arc basin!\" />",
          "link": "https://xkcd.com/2616/",
          "publishedOn": "2022-05-06T00:00:00.000Z",
          "wordCount": 197,
          "title": "Deep End",
          "imageUrl": "https://imgs.xkcd.com/comics/deep_end_2x.png"
        },
        {
          "id": "https://xkcd.com/2615/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/welcome_back.png\" title=\"'We're shocked by the Notre Dame fire. Click for our tribute to--' [okay] 'Now that we're all staying at home these past few weeks thanks to this new coronavirus, we--' [okay]\" alt=\"'We're shocked by the Notre Dame fire. Click for our tribute to--' [okay] 'Now that we're all staying at home these past few weeks thanks to this new coronavirus, we--' [okay]\" />",
          "link": "https://xkcd.com/2615/",
          "publishedOn": "2022-05-04T00:00:00.000Z",
          "wordCount": 197,
          "title": "Welcome Back",
          "imageUrl": "https://imgs.xkcd.com/comics/welcome_back_2x.png"
        },
        {
          "id": "https://xkcd.com/2614/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/2.png\" title=\"It's like sigma summation notation, except instead of summing the argument over all values of i, you 2 the argument over all values of 2.\" alt=\"It's like sigma summation notation, except instead of summing the argument over all values of i, you 2 the argument over all values of 2.\" />",
          "link": "https://xkcd.com/2614/",
          "publishedOn": "2022-05-02T00:00:00.000Z",
          "wordCount": 195,
          "title": "2",
          "imageUrl": "https://imgs.xkcd.com/comics/2_2x.png"
        },
        {
          "id": "https://xkcd.com/2613/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/bad_map_projection_madagascator.png\" title=\"The projection's north pole is in a small lake on the island of Mahé in the Seychelles, which is off the top of the map and larger than the rest of the Earth's land area combined.\" alt=\"The projection's north pole is in a small lake on the island of Mahé in the Seychelles, which is off the top of the map and larger than the rest of the Earth's land area combined.\" />",
          "link": "https://xkcd.com/2613/",
          "publishedOn": "2022-04-29T00:00:00.000Z",
          "wordCount": 201,
          "title": "Bad Map Projection: Madagascator",
          "imageUrl": "https://imgs.xkcd.com/comics/bad_map_projection_madagascator_2x.png"
        },
        {
          "id": "https://xkcd.com/2612/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/lightsabers.png\" title=\"A lot of Jedi romances start with this turning into a Lady and the Tramp spaghetti situation.\" alt=\"A lot of Jedi romances start with this turning into a Lady and the Tramp spaghetti situation.\" />",
          "link": "https://xkcd.com/2612/",
          "publishedOn": "2022-04-27T00:00:00.000Z",
          "wordCount": 195,
          "title": "Lightsabers",
          "imageUrl": "https://imgs.xkcd.com/comics/lightsabers_2x.png"
        }
      ]
    },
    {
      "title": "remy sharp's b:log",
      "feedUrl": "https://remysharp.com/feed.xml",
      "siteUrl": "https://remysharp.com",
      "articles": [
        {
          "id": "missy",
          "author": null,
          "description": "We've had Missy for 17 years, she was part of a litter that her brothers Dizzy and Ninja came from.\nShe died early this morning at home. Thankfully it was quick for her. There's been a lot of tears today from all of us, and I know I'll miss her dearly, she was a great friend.\nI wanted to use my blog to remember some of what made her special to me.",
          "link": "https://remysharp.com/2022/06/22/missy",
          "publishedOn": "2022-06-22T09:00:00.000Z",
          "wordCount": 1044,
          "title": "Missy [blog]",
          "imageUrl": "https://remysharp.com/images/cards/og/9-2.jpg"
        },
        {
          "id": "one-decade-waiting-for-web-apis",
          "author": null,
          "description": "In the last couple of years (rather slowed by the pandemic), a number of new browser APIs have started to land that I had wanted over a decade ago. That's not to say that the process is slow, more that the technology simply didn't exist a 10 years ago, and now the APIs exist, it took me a matter of hours to build the small bit of software I so desperately needed back then.",
          "link": "https://remysharp.com/2022/06/13/one-decade-waiting-for-web-apis",
          "publishedOn": "2022-06-13T12:00:00.000Z",
          "wordCount": 1447,
          "title": "One decade waiting for web APIs [blog]",
          "imageUrl": "https://remysharp.com/images/cards/og/9-2.jpg"
        }
      ]
    },
    {
      "title": "Writing - rachelbythebay",
      "feedUrl": "https://rachelbythebay.com/w/atom.xml",
      "siteUrl": "https://rachelbythebay.com/w/",
      "articles": [
        {
          "id": "https://rachelbythebay.com/w/2022/03/17/macedit/",
          "author": null,
          "description": "Cutting to the chase: text editors *and* tabs vs. spaces!  Ooooh!\n\n\nI've had this thing called \"e\" for a while now.  It's a stupid little \nscript which serves to do a couple of things.  It starts my \neditor\nwith a given file, and it kicks it with the right arguments to make it \ndisable line wrapping and to make the [TAB] key actually put in two \nspaces.\n\n\nSo, my dumb script would use \"-w -E -T 2\" most of the time, except when it \nwas running on a Makefile, at which point it would skip those args.  \nSimple enough, right?\n\n\npico is back?  Yes indeed, on Macs, as of 12.3, pico is in fact back.  To \nmake sure I wasn't imagining things, I tracked down a machine that hadn't \nbeen upgraded yet and checked there.  Sure enough, it was in fact nano and \nnot pico.\n\n\nmacOS 12.3 has nano as a symlink... pointing to pico!\n\n\nAt some point, I switched from literal tab characters in my source code to \nblobs of spaces, probably due to using that style at work and not hating \nit.  So, somewhere along the line I actually started depending on nano \nbehavior without realizing it.\n\n\nAs for the lack of a feature in pico itself, it's kind of strange, really.  \nIf you go digging into the source, they have this random.c with a function \ncalled tab which claims to \"simulate tab stop\" using spaces.  That said, I \ncan't find any place where it would be called with the magic values which \nwould make it behave that way.\n\n\nIt wouldn't surprise me if this switch is just more of Apple removing \nGPLed things from their OS - pico seems to use the Apache license.  They \ndumped bash for zsh (MIT license) at some point (Big Sur, I think), and \nnow this?  Okay then.",
          "link": "https://rachelbythebay.com/w/2022/03/17/macedit/",
          "publishedOn": "2022-03-17T23:56:56.000Z",
          "wordCount": 708,
          "title": "Discussing two \"holy war\" topics at the same time",
          "imageUrl": null
        },
        {
          "id": "https://rachelbythebay.com/w/2022/03/15/link/",
          "author": null,
          "description": "Here's a very old and stupid trick you could do with some filesystems in \nsome situations back in the day... and might still be able to do in a \nfew places today.\n\n\nThe problem is that while version X might eventually have an exploit, \nit'll get removed and it'll be replaced by version Y without that\nparticular hole.  By the time you get your hands on a tool to break into \nX, it'll be gone.\n\n\nWhat you'd do is create a hard link pointing at the file you wanted to \npreserve, storing it in a spot which was writable by your account.  \nThen, say, /usr/bin/sudo (because that never has security \nissues...) gets replaced at some point with a new file and you get to \nkeep the old version.  When you get the tool to pop it, off you go!\n\n\nOf course, these days, it's not quite so easy on the more modern systems \nyou find.  Debian 11 here won't let me do it - it's EPERM city.  Rocky 8 \n(so CentOS 8 and RHEL 8 too) also won't do it.  They both have some gunk\nin /usr/lib/sysctl.d to lock this down.  But, my old Slackware 14.2 \ninstall of my workstation let me do it the last time I tried about \na year ago.  How about that, huh?  I bet it'd still work if I dug out \nthe old drives and booted them up.\n\n\nIncidentally, this is the magic sauce: /proc/sys/fs/protected_hardlinks\nRead the man page for proc(5) to learn more about it.\n\nhere it is,\nthe thread I read a long time ago.  It's interesting to note that as far \nas I can tell, nothing actually changed upstream.  This left paranoid \nadmins like me with no option but to use the (most excellent) Openwall \npatches to lock down this kind of stuff.  I used that on my machines at \nwork which had non-staff users... just in case.\n\n\nThis whole situation is scary.  \nRead more about it.",
          "link": "https://rachelbythebay.com/w/2022/03/15/link/",
          "publishedOn": "2022-03-16T01:51:07.000Z",
          "wordCount": 640,
          "title": "Dumb things you can sometimes do with hard links",
          "imageUrl": null
        },
        {
          "id": "https://rachelbythebay.com/w/2022/03/14/modems/",
          "author": null,
          "description": "Back in January, you might have seen my\npost\nabout a very large BBS which seemed to solve for the problem of \"how do \nwe host a bunch of users\" by having one physical box per user.  It might \nhave been one physical box per *two* users, maybe, but it's hard to say.\n\n\nNow, keep in mind digital cameras weren't easy to come by, so I have \nvery few actual pictures.  I'll have to do a lot of explaining to make \nup for the lack of detail and alternate angles.  Clearly, I had no \nnotion of ever using these pictures to tell stories 25+ years later.\n\n\nSome friends at a local company had some bandwidth to spare (a T1 to \nAlternet somewhere, as I recall), so they parked a Zoom modem on one of \ntheir boxes and plugged it into a phone line.  We got an identical model \nto avoid cross-brand issues (Zoom m…",
          "link": "https://rachelbythebay.com/w/2022/03/14/modems/",
          "publishedOn": "2022-03-14T23:17:57.000Z",
          "wordCount": 2059,
          "title": "More stories about stacks of modems",
          "imageUrl": null
        },
        {
          "id": "https://rachelbythebay.com/w/2022/03/12/chow/",
          "author": null,
          "description": "I sometimes write the beginnings of posts but don't post them.  I still \nsave them in case conditions change or other things happen and make me \nwant to follow up on the topic.  In this case, I wrote something about \noffices before the whole COVID lockdown thing happened and people \nlargely stopped going to offices every day.  With that in mind, let's \nproceed.\n\n\nHowever, tech companies decided to go past this at some point and \nbrought about this whole notion of \"microkitchens\".  This is where \nthey'd put their branding on the coolers (instead of \"Coca-Cola\" or \n\"Pepsi\") and would load it up with every kind of fizzy sugary liquid \nthey could get their hands on.  They'd have racks and racks of shelving \npacked with all sorts of interesting crunchy, sugary and carb-loaded \nsnacks.  They'd a…",
          "link": "https://rachelbythebay.com/w/2022/03/12/chow/",
          "publishedOn": "2022-03-13T02:14:33.000Z",
          "wordCount": 932,
          "title": "Taking away the berries",
          "imageUrl": null
        },
        {
          "id": "https://rachelbythebay.com/w/2021/10/13/temp/",
          "author": null,
          "description": "One of the fun things I used to do at a prior job was to dig through the \nraw data points which were collected from the *many* servers we had.  I \ncould just pick an interesting-sounding metric and then would just ask \nthe system to show me the top 10 or bottom 10 out of a population of \nthousands or more.\n\n\nTo get my feet wet with the whole \"investigations\" thing that we'd do, I \nstarted looking into this one day and chose one of the many temp sensors \nwhich were being logged by the servers.  I forget exactly which one it \nwas, for there were many.  The CPUs logged it, the chassis logged it, \nthe power supply logged it, and so on.  There were so many choices.\n\n\nI went looking for a reason.  What could possibly explain this?  First \noff, it didn't line up with any obvious pattern in the host names.  The \nhosts were named for whichever team owned them, followed by a sequence \nnumber that was bumped any time a new one was provisioned.  There was no \nsignal to be found in that.\n\n\nThere was more, though.  You could also see a \"rack position\" in this \ndata, and now it started getting interesting.  It seems that all of the \nreally hot machines had a rack position of something low, like 04 or 05, \nand never anything higher than that.  In fact, when looking at a whole \nrack, it was always the lowest number of all of the positions that were \nbeing used.  Now this was worth chasing!\n\n\nIt's good that I asked, since they told me something surprising: \nposition 04 or 05 or whatever was the *bottom* of the rack.  Yes, \nsomehow, the lowest machine in the rack was the hottest!  They found \nthis interesting, too, and wound up digging into it.  Given that I was \nfar away in a distant office, this was the best way for us to proceed.\n\n\nThe problem was that the bottommost server would have nothing below it \nbut just open space until it got to the floor.  That space would not \nmove air efficiently, and it obviously mattered.\n\n\nThis rolled out and my hot spots disappeared.  Fantastic!",
          "link": "https://rachelbythebay.com/w/2021/10/13/temp/",
          "publishedOn": "2022-03-11T07:04:12.000Z",
          "wordCount": 839,
          "title": "Looking at the outlying data points",
          "imageUrl": null
        },
        {
          "id": "https://rachelbythebay.com/w/2022/03/10/caltrain/",
          "author": null,
          "description": "Another day, another bit of local flavor, but this time it's something I \nwish I didn't have to write about.\n\nwrote\nabout seeing a maintenance truck rolling down the Caltrain line in \nMountain View.  It had a special attachment to let it stay on the rails.  \nAt no point did the arms come down for the crossing.  It managed to \napproach, then the people inside looked around and went through, and the \narms never budged.  There were no flashing lights or bells.\n\n\n\n\ncaught fire.  A bunch of people were hurt.  More were shaken \nup.\n\n\nI'm assuming their construction trucks don't trigger the \"short the \nrails together to signal various things\" logic, either.  This would \nmean that crossing arms stay up... and I have to assume it also means \nthe signals along the way stay green instead of going red.\n\nWe will presumably hear more about whatever the signals said, and \nwhether the train went past a red signal or not.  I just have a bad \nfeeling that they saw a green and kept on going.",
          "link": "https://rachelbythebay.com/w/2022/03/10/caltrain/",
          "publishedOn": "2022-03-11T01:26:06.000Z",
          "wordCount": 306,
          "title": "Questions about construction trucks on train tracks",
          "imageUrl": null
        },
        {
          "id": "https://rachelbythebay.com/w/2022/03/09/toll/",
          "author": null,
          "description": "Here's a little bit of Silicon Valley local flavor for a change.  We \nhave this freeway that runs from San Jose to San Francisco called US \n101, or around here, just \"101\".  (Southern California has it too, but \nthey call it \"the\" 101.  That's how we detect invaders.)  Anyway, this \nthing is usually eight or more lanes up and down the peninsula, and it's \nhad a \"diamond\" or car pool lane on the #1 (innermost/\"fast\") lane for \nmany years.  You had to have a certain number of people in the car (or \nsome other conditions met) during certain hours (AM and PM rush, \nweekdays), or you'd be in for a hefty ticket.\n\n\nHow does the system know what to charge you?  Well, you either have an \nold-style toll transponder that always bills you as a solo driver, or \nyou have a new-style transponder with a 1/2/3+ switch that tells the \nroad how to handle you.\n\n\nThink about what this does to enforcement.  Now, instead of just \"is \nthere a vehicle in the lane\", \"is it the right time during a weekday\", \nand \"how many people are in the car\", now it's also a matter of \"do they \nhave their transponder set properly\".\n\n\nCheck this out.\n\n\n\nCHP\ncould roll up on them and give them a ticket.",
          "link": "https://rachelbythebay.com/w/2022/03/09/toll/",
          "publishedOn": "2022-03-10T03:50:54.000Z",
          "wordCount": 486,
          "title": "Toll signs on 101 report your transponder setting",
          "imageUrl": null
        },
        {
          "id": "https://rachelbythebay.com/w/2022/03/08/core/",
          "author": null,
          "description": "I already told a\nstory\nabout how you can hose your machine by pointing the Linux kernel at a \ncustom core dump handler and then have that handler fail to function.  \nThis'll clog up the pipe (really), and then everything else will just \nstack up behind it.  Pretty soon, every crashing process will be stuck \njust the same.\n\n\nOnce upon a time, in a big company environment, someone decided that \nthey wanted to provide a service to other things running on the same \nLinux box.  But, instead of either writing Yet Another Service (tm) \nthat would go through release processes and all of that good stuff, they \nwent for a different design entirely.\n\n\nThere are so many problems with this.  You have the issue of a \"server\" \nthat appears out of thin air depending on who or what starts first on \nthe mac…",
          "link": "https://rachelbythebay.com/w/2022/03/08/core/",
          "publishedOn": "2022-03-09T04:39:40.000Z",
          "wordCount": 625,
          "title": "A parasitic RPC service that broke core dumps",
          "imageUrl": null
        },
        {
          "id": "https://rachelbythebay.com/w/2022/03/07/get/",
          "author": null,
          "description": "If a web site makes an RSS or Atom feed available, it's not a bad idea \nto poll it from time to time.  Actually doing that poll like a good \nnetizen (remember that concept?) takes a little attention to detail.\n\n\nGiven the reality of the situation, does it make sense to poll every 10 \nseconds?  Probably not, right?  Someone set up something like that and \nleft it running for a couple of months until I finally noticed it and \ndealt with it myself.\n\n\nGiven this, you can keep track of the \"Last-Modified\" header when you \nget a copy of the feed.  Then, you can turn around and use that same \nvalue in an \"If-Modified-Since\" header the next time you come to look \nfor an update.  If nothing's changed, the web server will notice it's \nthe same as what it already has, and it'll send you a HTTP 304 co…",
          "link": "https://rachelbythebay.com/w/2022/03/07/get/",
          "publishedOn": "2022-03-08T17:49:05.000Z",
          "wordCount": 820,
          "title": "A sysadmin's rant about feed readers and crawlers",
          "imageUrl": null
        },
        {
          "id": "https://rachelbythebay.com/w/2022/03/05/prod/",
          "author": null,
          "description": "Here's a concept: \"ssh to prod and edit directly on the machine\" is \ngenerally bad news.\n\n\nI should point out that I didn't know this person and had no idea how \nthey would respond to such feedback - it might have been fine!  They \nmight be a well-adjusted person who can take a request like that and not \nturn it around into a full-on nuclear attack.  But, I didn't know either \nway.\n\n\nAt some point, I actually had a meeting with this developer for some \nother reason, and what happened was kind of amazing.  First thing, he \nbrought it up and asked me about it.  I said something like, \"well, I \ndidn't want to get into it, but since you asked\", and proceeded into \nsomething along the lines of \"obviously it would be best if you didn't \ndo that - sshing in and twiddling Python files on the actual production \nAWS instance of the service\".\n\n\n\"But... I suspect you are doing it for some reason?\"\n\n\nMy response was... I hope... reasonable: \"So as much as I would love to \nsay 'don't do that!!!', I'm not going to stand in the way of you \nliterally doing your job.  So please proceed with care, and keep an eye \nopen for some day when (first dumb thing) and (second dumb thing) aren't \nproblems any more and you need not do this any more.\"\n\n\nIt was either \"edit in prod\" or endure DAY LONG development cycles: make \na change, wait 24 hours, come back tomorrow, and try it again.  That's \nhow broken it was.\n\n\nThe best part about this was that we had a totally reasonable \nconversation about it.  It's the kind of thing which had become a rare \ncommodity in those days at that place.\n\n\nWould I expect someone else to go to that level of insanity every single \ntime they just want to get their job done?  Absolutely not.\n\nEditing files in prod to develop them?  That's bad news.  Deliberately \nrigging tunnels to spoof a connection from prod?  That's also bad news.  \nHaving to do them to get your job done?  You might be in the bad place.",
          "link": "https://rachelbythebay.com/w/2022/03/05/prod/",
          "publishedOn": "2022-03-05T21:21:55.000Z",
          "wordCount": 738,
          "title": "Editing stuff in prod",
          "imageUrl": null
        },
        {
          "id": "https://rachelbythebay.com/w/2022/03/02/wrong/",
          "author": null,
          "description": "Quite a while back, I wrote a post that basically went like this: if \nsomeone has a problem with someone else or something that person is \ndoing, they're going to find a way to get to \"no\".  They will find some \nreason, some excuse, or some problem with it.  They'll bring up a point \nand you'll show that this is not in fact a thing.  They will then pivot \nagain and again.\n\n\nBut, as I said, that was back then, and this time I'm talking about \nsomething else: when it happens in person with a coworker.  I had an \nexperience like this a few years back, and figured I'd share how it goes \nfor the sake of others who might not have encountered it yet, or who \nhave and thought they were alone in this.\n\n\nCoworker: There are no docs for [this thing you're doing].\n\n\nCoworker: You could make a wiki pag…",
          "link": "https://rachelbythebay.com/w/2022/03/02/wrong/",
          "publishedOn": "2022-03-04T00:14:12.000Z",
          "wordCount": 860,
          "title": "It's now your fault they don't know about it",
          "imageUrl": null
        },
        {
          "id": "https://rachelbythebay.com/w/2022/03/01/uuid/",
          "author": null,
          "description": "This is a short one since it's somewhere between a random bit of \n\"grab some popcorn\" amusement and a \"huh, that might be a problem some \nday\".  In short, it looks like every Raspberry Pi filesystem installed \nfrom any given release image probably ends up with the same\nUUID.\n\n\nFor instance, if you downloaded the \"lite\" version of Raspbian between \nroughly November 8th and January 28th, you probably got a file called \n2021-10-30-raspios-bullseye-armhf-lite.zip.  Inside, there's an image, \nand the idea is that you dump that straight to your SD card, cram it in \nthe Pi, and off you go.  The second partition on that image is an ext4 \nfilesystem which was created on some build machine somewhere.  The UUID \non it never gets \"evolved\" to something else after the install.\n\n\nYou can see it inside the image itself here:\n\n\nOr, if you actually installed a few of these things like I did over the \npast couple of months, you can just 'tune2fs -l /dev/mmcblk0p2' and see \nthe same value in there.\n\n\nDon't end up with a pile of SD cards on your desk and think \"I know, \nI'll use the filesystem UUIDs to track which one goes where\", in other \nwords.\n\n\nIf it's not breaking anything for you, it's probably best to just let it \nbe.  Untangling a boot mess on these weird little boxes is anything but \nfun.\n\nNote: if you're actually on a recent Raspberry Pi, odds are good that \nyour /etc/fstab will be using *partition* UUIDs (PARTUUID=...) and not \nthose of the filesystem.  If in doubt, use blkid to see what's what.",
          "link": "https://rachelbythebay.com/w/2022/03/01/uuid/",
          "publishedOn": "2022-03-02T03:44:06.000Z",
          "wordCount": 529,
          "title": "Universally unique identifier?  Sometimes...",
          "imageUrl": null
        },
        {
          "id": "https://rachelbythebay.com/w/2022/02/28/copilot/",
          "author": null,
          "description": "A reader wrote in asking what I thought about the whole GitHub \"copilot\" \nthing.  If you haven't heard of it yet, it's apparently this thing that \nwas trained on a whole mess of repositories and their code, and you can \n\"prompt\" it and it'll spit out code that may or may not do what you \nwant.  It doesn't seem to know about licensing (BSD, GPL, MIT, that sort \nof thing), or plagiarism, or any of that other good stuff.\n\n\nThis is actually a story about somewhere I used to work, and someone who \nwas on one of my teams back in the day.  One day, I heard that one of \nthe people in a far-away office had created some kind of tool that would \nlet you look at the status of different machines - that is, Linux boxes. \nI don't remember the finer points of it or why this person even \nbothered, but they…",
          "link": "https://rachelbythebay.com/w/2022/02/28/copilot/",
          "publishedOn": "2022-02-28T22:54:39.000Z",
          "wordCount": 661,
          "title": "When Command-V (or CTRL-V) is your \"copilot\"",
          "imageUrl": null
        },
        {
          "id": "https://rachelbythebay.com/w/2022/02/26/include/",
          "author": null,
          "description": "There are some interesting implications to the way that you have to \nhandle references to other bits of code when you write a C++ header \nfile.  There are things you can do which turn out to be suboptimal, and \nuntil or unless you work someplace with a coding style document or get \nsome mentor who's already been there, you're likely to make some\nmistakes.\n\n\nAnyway, a common way to do this is to set up the outer class such that \nit has a pointer to the inner one.  You *could* have it just own it \ndirectly, but then that introduces problems.\n\n\n\n private:\n  Bar bar_;\n\n\n\nOf course, bar.h probably has its own dependencies which get #included, \nand so now you end up with this evil web of slow compiles.  It sucks.\n\n\nWhat used to happen next is that someone would say, okay, let's make it \na pointe…",
          "link": "https://rachelbythebay.com/w/2022/02/26/include/",
          "publishedOn": "2022-02-27T11:35:01.000Z",
          "wordCount": 1934,
          "title": "C++ header files and inter-class connections",
          "imageUrl": null
        },
        {
          "id": "https://rachelbythebay.com/w/2022/02/21/result/",
          "author": null,
          "description": "Yesterday, I\nput forth\na bunch of API possibilities for the problem of needing to return a \nvalue but also indicating the lack of a value and being able to comment \non why.  In it, the notion of a \"wrapper\" around a string was presented, \nsuch that it might look like \"Result<string>\", and those brackets \nstarted looking like a pain.  There was also the possibility of having \nsomething like \"ResultString\", but didn't that open the door to having a \nbunch of code duplication?\n\n\nAfter this had existed for a while, the general happy feeling of having \nthis stuff in place became infectious.  I wanted it to cover other \nthings with it, too.  I wanted it to handle something a bit more \ncomplicated than a mere string, and so decided to try my hand at the \ntemplate-wrangling metaprogramming cruft t…",
          "link": "https://rachelbythebay.com/w/2022/02/21/result/",
          "publishedOn": "2022-02-22T05:01:25.000Z",
          "wordCount": 809,
          "title": "Results without all of the brackets",
          "imageUrl": null
        },
        {
          "id": "https://rachelbythebay.com/w/2022/02/20/return/",
          "author": null,
          "description": "If you agree with the notion that you need to be able to tell the \ndifference between the absence of a value and a value itself, then this \nhas some impacts on the code you write.  If you want to keep 'em \nseparated (so they can come out and play), then it gets you looking at \nyour API designs in certain ways.\n\n\nImagine we're talking about a helper function that is intended to be run \ninside a program that's handling the access to a web page.  It's \nprobably a CGI program, but it could also be buried inside some much \nbigger thing, too.  This is all about C++ styles, but you can probably \nsee slices of other languages in here, too.\n\n\nstring UserIP() -- No more lifetime worries here, but oops, uh, well, \nwhat if we don't know what it is and need to provide an error?  If it's \na CGI situatio…",
          "link": "https://rachelbythebay.com/w/2022/02/20/return/",
          "publishedOn": "2022-02-20T21:33:28.000Z",
          "wordCount": 834,
          "title": "Returning values and errors",
          "imageUrl": null
        },
        {
          "id": "https://rachelbythebay.com/w/2022/02/17/using/",
          "author": null,
          "description": "In\nyesterday's post,\nI mentioned taking my old Mac Mini out of the OS X/macos ecosystem and \nbringing it into Debian, and then what kind of hilarity followed when I \nattempted to install a Javascript linter (and it tried to drag in 180+ \nnode-related packages).\n\n\nReaders are advised that this post will probably contain \ndefinitely contains a even higher than usual amount of \nnavel-gazing as I dish out the details of my setup.  My usual \ndisclaimer of \"this works for me and probably won't work for you, so if \nyou have different tastes, then great, go with that\" definitely applies \nhere.\n\n\nFirst of all, the one that most people actually notice is the actual box \nwhich is serving rachelbythebay.com, which at the moment is a box called \nsnowgoose.  I had installed it in early 2020 as CentOS 8 …",
          "link": "https://rachelbythebay.com/w/2022/02/17/using/",
          "publishedOn": "2022-02-17T21:48:27.000Z",
          "wordCount": 2660,
          "title": "My \"daily drivers\", and what happened to Slackware here",
          "imageUrl": null
        },
        {
          "id": "https://rachelbythebay.com/w/2022/02/16/deps/",
          "author": null,
          "description": "Oh sure, everyone laughs about things having a lot of dependencies, but \ndo they ever really think about the implications of having hundreds of \nteeny little libraries, all moving independently?  This is how it \nmanifests in the real world.\n\n\nMy relative inexperience with Debian systems means I'm constantly being \ndelighted to discover that such and such has already been packaged up \nand is just an apt command away.  Things that I would have done by hand \nin the years up to this point now have someone else worrying about them.\n\n\nThis is what happened next:\n\n\n... huh.  The story basically ends there.  I'm going to handle this some \nother way.",
          "link": "https://rachelbythebay.com/w/2022/02/16/deps/",
          "publishedOn": "2022-02-17T03:07:46.000Z",
          "wordCount": 752,
          "title": "A twisted maze of dependencies",
          "imageUrl": null
        },
        {
          "id": "https://rachelbythebay.com/w/2022/02/15/4740180/",
          "author": null,
          "description": "Oh dear.  The software fungus where bits of code take the\nliteral characters \"HTTP\" as a number\nhas expanded.  Now it has a variant: 4740180.\n\n\nWhere does this one come from?  \nGo and gRPC, apparently!\n\n\nI found this while searching the web for \"1213486160\" to see how things \nhave been going in the past few years.  Unfortunately, it's still biting \npeople all over the place.  There are far too many posts asking people \nto upgrade their software, or restart things, or do any number of \nuseless rubber-chicken-waving techniques which ultimately will \naccomplish nothing.\n\nWhen you see a funny-looking number, figure out where it comes from.\nThat's the only way to have any chance of understanding what's actually \ngoing on.",
          "link": "https://rachelbythebay.com/w/2022/02/15/4740180/",
          "publishedOn": "2022-02-15T08:11:35.000Z",
          "wordCount": 182,
          "title": "Add 4740180 to the list of silly magic numbers",
          "imageUrl": null
        },
        {
          "id": "https://rachelbythebay.com/w/2022/02/14/feedback/",
          "author": null,
          "description": "Yep, it's time for another round of reader feedback.\n\n\"process infection\" story:\n\nhttps://lwn.net/Articles/883547/):\n\n\nIf you do privileged execution of specific operations via IPC you get \nthe guarantee that whatever is done, is done from a well-defined, \npristine execution environment, without leaking context implicitly. The \nIPC message is the *full* vulnerable surface, and that's as minimal as \nit can get. And that's great.\n\n\n\n\nOh wow, thank you for mentioning that, unnamed reader!  I definitely \nread that post on LWN at some point in the past couple of days when the \npkexec thing started going around.  It must have really worked its way \ninto my head, and then eventually stirred up the memory of everything \ngetting \"nicely infected\" at $OLD_JOB.\n\n\nEvery time I talk about trying to par…",
          "link": "https://rachelbythebay.com/w/2022/02/14/feedback/",
          "publishedOn": "2022-02-14T23:56:36.000Z",
          "wordCount": 1731,
          "title": "Feedback: environments, old BBSes, Honda's 2022 bug",
          "imageUrl": null
        },
        {
          "id": "https://rachelbythebay.com/w/2022/02/09/nice/",
          "author": null,
          "description": "I once worked at a place that had an interesting little problem stemming \nfrom the way they managed machines and some of the fun side-effects \nprocesses can have on each other.  This is back in the pre-systemd days \nof running services, such that things tended to be started or restarted \nby someone or something that itself ran as root.  That is, if you \nstarted something, it might inherit one or more things from your \nenvironment.  Likewise, if you ran something with an unusual \nenvironment, it might bestow those \"gifts\" onto anything it happened to \ntouch.\n\n\nAfter locking themselves out of machines too many times, people \ngenerally learned that after you mess with a glibc upgrade, you restart \nthe sshd listener on port 22.  Of course, they also had to learn to not \nwhack EVERY sshd at the…",
          "link": "https://rachelbythebay.com/w/2022/02/09/nice/",
          "publishedOn": "2022-02-10T19:24:29.000Z",
          "wordCount": 951,
          "title": "A nice story about Unix processes \"infecting\" each other"
        },
        {
          "id": "https://rachelbythebay.com/w/2022/01/26/swcbbs/",
          "author": null,
          "description": "Nearly 30 years ago, I was given this picture.  I wanted to present it \nin a post all by itself to give it a chance to \"sink in\" before I went \nand used it in an analogy.  First, I'll just show the image and explain \nwhat you're looking at here.\n\n\n\n\nI do remember the description from the back: this is a picture of *part \nof* something that was called the Software Creations BBS.  It was a \nmulti-line bulletin board system where you could dial up and send \nmessages to people, upload and download files, and (presumably) play \nonline games (\"doors\") and anything else they cared to offer.\n\n64 machines in a little space.  I have to assume \nthey are at least \n286s (ATs, more or \nless), but it's impossible to tell from just this picture.  They could \nhave been 386s or even 486s by that point, but …",
          "link": "https://rachelbythebay.com/w/2022/01/26/swcbbs/",
          "publishedOn": "2022-01-28T05:01:25.000Z",
          "wordCount": 694,
          "title": "An old photo of a very large BBS"
        },
        {
          "id": "https://rachelbythebay.com/w/2022/01/27/scale/",
          "author": null,
          "description": "Okay, so yesterday I \nposted\na picture of an old multi-line bulletin board system which had \napparently taken over an entire bedroom with dozens of computers.  I \nmentioned that I intended to come back to the topic to throw in my own \ntwo cents, and so here we go.\n\n\nOr, were you someone who found it horrific and wished there was a \nsimpler way?  Did you wonder if it would be possible to pack all of that \ninto one or maybe two boxes, instead?  Did you want a way to negate all \nof that complexity while still providing the same level of service?\n\n\nNow, things are different.  I look at that and just sigh at the lost \nopportunities.  The actual amount of work being done on behalf of any of \nthe users who are connected is tiny.  If we ignore the fact that the \nactual BBS software and related acc…",
          "link": "https://rachelbythebay.com/w/2022/01/27/scale/",
          "publishedOn": "2022-01-28T05:00:38.000Z",
          "wordCount": 846,
          "title": "One machine can go pretty far if you build things properly"
        }
      ]
    },
    {
      "title": "LOW-TECH MAGAZINE",
      "feedUrl": "https://feeds2.feedburner.com/typepad/krisdedecker/lowtechmagazineenglish",
      "siteUrl": "https://www.lowtechmagazine.com/",
      "articles": []
    },
    {
      "title": "esoteric.codes",
      "feedUrl": "https://esoteric.codes/rss",
      "siteUrl": "https://esoteric.codes",
      "articles": []
    },
    {
      "title": "Lea Verou",
      "feedUrl": "https://feeds.feedburner.com/leaverou",
      "siteUrl": "https://lea.verou.me",
      "articles": []
    },
    {
      "title": "TEXT-MODE",
      "feedUrl": "https://text-mode.tumblr.com/rss",
      "siteUrl": "https://text-mode.tumblr.com/",
      "articles": []
    },
    {
      "title": "The Mozilla Blog",
      "feedUrl": "https://blog.mozilla.org/en/feed/",
      "siteUrl": "https://blog.mozilla.org/en/",
      "articles": [
        {
          "id": "https://blog.mozilla.org/?p=69339",
          "author": "Damiano",
          "description": "Here at Mozilla, we are the first to admit the internet isn’t perfect, but we are also quick to point out that the internet is pretty darn magical. The internet opens up doors and opportunities, allows for people to connect with others, and lets everyone find where they belong — their corners of the internet. […]\nThe post Joey Amato, Publisher of Pride Journeys, Shares What Brings Him Joy Online appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/internet-culture/joey-amato-publisher-of-pride-journeys-shares-what-brings-him-joy-online/",
          "publishedOn": "2022-06-21T16:55:01.000Z",
          "wordCount": 1602,
          "title": "Joey Amato, Publisher of Pride Journeys, Shares What Brings Him Joy Online",
          "imageUrl": "https://blog.mozilla.org/wp-content/blogs.dir/278/files/2022/06/mcoi_joeyamato_header_1920x1080-1080x720.png"
        },
        {
          "id": "https://blog.mozilla.org/?p=69308",
          "author": "Rebecca Smith",
          "description": "Ten years ago, a small, yet mighty team launched Pocket because we felt that people deserved a better way to consume content on the internet. We wanted it to be easy — “as simple an action as putting it in your pocket” — and empowering, giving people the means to engage with the web on […]\nThe post Reflecting on 10 years of time well spent with Pocket appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/products/pocket/reflecting-on-10-years-of-time-well-spent-with-pocket/",
          "publishedOn": "2022-06-21T13:00:00.000Z",
          "wordCount": 1970,
          "title": "Reflecting on 10 years of time well spent with Pocket",
          "imageUrl": "https://blog.mozilla.org/wp-content/blogs.dir/278/files/2022/06/pocket10_blogheader_distilled_1200x800.jpg"
        },
        {
          "id": "https://blog.mozilla.org/?p=69335",
          "author": "Martin Thomson",
          "description": "Private advertising technology proposals could greatly improve privacy for web users. Web advertising has a reputation for poor privacy practices. Firefox, other browsers, and the web community are collaborating on finding ways to support advertising while maintaining strong, technical privacy protections for users. This series of posts aims to contribute to the ongoing conversation regarding […]\nThe post Understanding Apple’s Private Click Measurement appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/mozilla/understanding-apples-private-click-measurement/",
          "publishedOn": "2022-06-21T13:00:00.000Z",
          "wordCount": 1473,
          "title": "Understanding Apple’s Private Click Measurement",
          "imageUrl": "https://blog.mozilla.org/wp-content/blogs.dir/278/files/2022/04/moz_cybersecurity_blog_header_1920x1080-1080x720.png"
        },
        {
          "id": "https://blog.mozilla.org/?p=69152",
          "author": "Damiano",
          "description": "Here at Mozilla, we are the first to admit the internet isn’t perfect, but we are also quick to point out that the internet is pretty darn magical. The internet opens up doors and opportunities, allows for people to connect with others, and lets everyone find where they belong — their corners of the internet. […]\nThe post Queer Singer/Songwriter Criibaby Finds Pride and Joy at the Intersection of Tech and Music appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/internet-culture/queer-singer-songwriter-criibaby-finds-pride-and-joy-at-the-intersection-of-tech-and-music/",
          "publishedOn": "2022-06-17T16:00:00.000Z",
          "wordCount": 2214,
          "title": "Queer Singer/Songwriter Criibaby Finds Pride and Joy at the Intersection of Tech and Music",
          "imageUrl": "https://blog.mozilla.org/wp-content/blogs.dir/278/files/2022/06/mcoi_criibaby_header_1920x1080-1080x720.png"
        },
        {
          "id": "https://blog.mozilla.org/?p=69247",
          "author": "Kristina Bravo",
          "description": "Every Monday and Thursday, queer comedy writer and actor Brandon Kyle Goodman asks their 176,000 Instagram followers to tell them something good or messy.  People who tune into the Instagram Stories series, called “Messy Mondays” and “Thot Thursdays,” send in submissions that are indeed good, messy or both. Some share their kinks. Others inquire about […]\nThe post Firefox Presents: Redefining love and identity, one viral video at a time appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/products/firefox/brandon-kyle-goodman-big-mouth-messy-mondays-online-community/",
          "publishedOn": "2022-06-17T13:15:19.000Z",
          "wordCount": 1728,
          "title": "Firefox Presents: Redefining love and identity, one viral video at a time",
          "imageUrl": "https://blog.mozilla.org/wp-content/blogs.dir/278/files/2022/06/Firefox_Presents_Ep3_Brandon_16x9_3-1080x720.jpg"
        },
        {
          "id": "https://blog.mozilla.org/?p=69106",
          "author": "Kristina Bravo",
          "description": "Technology is easy to blame for the mental health crisis that kids are facing. But according to experts, it’s not that simple.  A rare public advisory from the U.S. surgeon general in December 2021 warned that young people are facing unprecedented challenges that have had a “devastating” effect on their mental health. These difficulties were […]\nThe post Kids are growing up in a very online world. What’s a concerned parent to do? appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/internet-culture/kids-mental-health-screen-time-technology/",
          "publishedOn": "2022-06-16T18:24:07.000Z",
          "wordCount": 2746,
          "title": "Kids are growing up in a very online world. What’s a concerned parent to do?",
          "imageUrl": "https://blog.mozilla.org/wp-content/blogs.dir/278/files/2022/06/moz_kidstechnologymentalhealth_blog_header_1920x1080_2-1080x720.jpg"
        },
        {
          "id": "https://blog.mozilla.org/?p=69205",
          "author": "Kristina Bravo",
          "description": "There’s never been a better time to switch from Chrome to Firefox, if we do say so ourselves.  Some of the internet’s most popular ad blockers, such as uBlock Origin — tools that save our digital sanity from video ads that auto-play, banners that take up half the screen and pop-up windows with infuriatingly tiny […]\nThe post How to easily switch from Chrome to Firefox appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/products/firefox/how-to-switch-from-chrome-to-firefox/",
          "publishedOn": "2022-06-15T13:47:25.000Z",
          "wordCount": 1283,
          "title": "How to easily switch from Chrome to Firefox",
          "imageUrl": "https://blog.mozilla.org/wp-content/blogs.dir/278/files/2022/02/fx_colorcalibration_blogheader_1280x720-1-1080x720.jpg"
        },
        {
          "id": "http://blog.mozilla.org/foxtail/2020/01/20/how-to-set-firefox-as-your-default-browser-on-windows/",
          "author": "M.J. Kelly",
          "description": "During a software update, your settings can sometimes change or revert back to their original state. For example, if your computer has multiple browsers installed, you may end up with a different default browser than Firefox. That’s easy to fix so that Firefox is there for you when you expect it, like when you click […]\nThe post How to set Firefox as your default browser on Windows appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/products/firefox/how-to-set-firefox-as-your-default-browser-on-windows/",
          "publishedOn": "2022-06-14T16:15:00.000Z",
          "wordCount": 1044,
          "title": "How to set Firefox as your default browser on Windows",
          "imageUrl": "https://blog.mozilla.org/wp-content/blogs.dir/278/files/2020/01/firefox-browser-logo-1008x672.png"
        },
        {
          "id": "https://blog.mozilla.org/?p=69120",
          "author": "Mozilla",
          "description": "Take back your privacy Starting today, Firefox is rolling out Total Cookie Protection by default to all Firefox users worldwide, making Firefox the most private and secure major browser available across Windows, Mac and Linux. Total Cookie Protection is Firefox’s strongest privacy protection to date, confining cookies to the site where they were created, thus […]\nThe post Firefox rolls out Total Cookie Protection by default to all users worldwide appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/products/firefox/firefox-rolls-out-total-cookie-protection-by-default-to-all-users-worldwide/",
          "publishedOn": "2022-06-14T13:00:00.000Z",
          "wordCount": 1574,
          "title": "Firefox rolls out Total Cookie Protection by default to all users worldwide",
          "imageUrl": "https://blog.mozilla.org/wp-content/blogs.dir/278/files/2021/05/moz_explains_supercookies_blog_header_1200x800-1200x800.jpg"
        },
        {
          "id": "https://blog.mozilla.org/?p=69126",
          "author": "Urmika Devi Shah",
          "description": "Mozilla supports the American Innovation and Choice Online Act (AICOA). The time for change is now. It’s time for governments to address the reality that five tech companies—not everyday consumers—control our online experiences today. Updated competition laws are essential for the internet to be private, secure, interoperable, open, accessible, transparent, and a balance between commercial […]\nThe post Calling for Antitrust Reform appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/mozilla/calling-for-antitrust-reform/",
          "publishedOn": "2022-06-14T10:00:00.000Z",
          "wordCount": 1379,
          "title": "Calling for Antitrust Reform",
          "imageUrl": "https://blog.mozilla.org/wp-content/blogs.dir/278/files/2022/06/moz_blog_header_sustainability_2020-11-11-1080x720.png"
        },
        {
          "id": "https://blog.mozilla.org/?p=69108",
          "author": "Damiano",
          "description": "Here at Mozilla, we are the first to admit the internet isn’t perfect, but we are also quick to point out that the internet is pretty darn magical. The internet opens up doors and opportunities, allows for people to connect with others, and lets everyone find where they belong — their corners of the internet. […]\nThe post CEO and Founder of HER Robyn Exton Shares Celebrates Pride from Her Corner of the Internet appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/internet-culture/ceo-and-founder-of-her-robyn-exton-shares-celebrates-pride-from-her-corner-of-the-internet/",
          "publishedOn": "2022-06-13T17:42:53.000Z",
          "wordCount": 1423,
          "title": "CEO and Founder of HER Robyn Exton Shares Celebrates Pride from Her Corner of the Internet",
          "imageUrl": "https://blog.mozilla.org/wp-content/blogs.dir/278/files/2022/06/mcoi_robinexton_header_1920x1080-1080x720.png"
        },
        {
          "id": "https://blog.mozilla.org/?p=69090",
          "author": "Damiano",
          "description": "Here at Mozilla, we are the first to admit the internet isn’t perfect, but we are also quick to point out that the internet is pretty darn magical. The internet opens up doors and opportunities, allows for people to connect with others, and lets everyone find where they belong — their corners of the internet. […]\nThe post Tony-nominated Arnulfo Maldonado Shares Pride and Joy From His Corner of the Internet appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/internet-culture/tony-nominated-arnulfo-maldonado-shares-pride-and-joy-from-his-corner-of-the-internet/",
          "publishedOn": "2022-06-10T16:15:00.000Z",
          "wordCount": 1521,
          "title": "Tony-nominated Arnulfo Maldonado Shares Pride and Joy From His Corner of the Internet",
          "imageUrl": "https://blog.mozilla.org/wp-content/blogs.dir/278/files/2022/06/mcoi_arnulfomaldonado_header_1920x1080-1080x720.png"
        },
        {
          "id": "https://blog.mozilla.org/?p=69069",
          "author": "Damiano",
          "description": "Here at Mozilla, we are the first to admit the internet isn’t perfect, but we are also quick to point out that the internet is pretty darn magical. The internet opens up doors and opportunities, allows for people to connect with others, and lets everyone find where they belong — their corners of the internet. […]\nThe post Trevor Project’s Kevin Wong Shares What’s In His Corner of the Internet appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/internet-culture/trevor-projects-kevin-wong-shares-whats-in-his-corner-of-the-internet/",
          "publishedOn": "2022-06-03T19:55:42.000Z",
          "wordCount": 1341,
          "title": "Trevor Project’s Kevin Wong Shares What’s In His Corner of the Internet",
          "imageUrl": "https://blog.mozilla.org/wp-content/blogs.dir/278/files/2022/06/mcoi_kevinwong_header_1920x1080-1080x720.png"
        },
        {
          "id": "https://blog.mozilla.org/?p=69069",
          "author": "Damiano",
          "description": "Here at Mozilla, we are the first to admit the internet isn’t perfect, but we are also quick to point out that the internet is pretty darn magical. The internet opens up doors and opportunities, allows for people to connect with others, and lets everyone find where they belong — their corners of the internet. […]\nThe post Trevor Project’s Kevin Wong Shares What’s In His Corner of the Internet appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/internet-culture/pride-month/trevor-projects-kevin-wong-shares-whats-in-his-corner-of-the-internet/",
          "publishedOn": "2022-06-03T19:55:42.000Z",
          "wordCount": 1318,
          "title": "Trevor Project’s Kevin Wong Shares What’s In His Corner of the Internet",
          "imageUrl": "https://blog.mozilla.org/wp-content/blogs.dir/278/files/2022/06/mcoi_kevinwong_header_1920x1080-1080x720.png"
        },
        {
          "id": "https://blog.mozilla.org/?p=69042",
          "author": "Kristina Bravo",
          "description": "Here at Mozilla, we are the first to admit the internet isn’t perfect, but we are also quick to point out that the internet is pretty darn magical. The internet opens up doors and opportunities, allows for people to connect with others, and lets everyone find where they belong — their corners of the internet. […]\nThe post Social media’s ‘Doomscrolling Reminder Lady’ on her favorite corners of the internet appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/internet-culture/karen-ho-twitter-doomscrolling-reminder-lady/",
          "publishedOn": "2022-06-02T15:55:40.000Z",
          "wordCount": 1391,
          "title": "Social media’s ‘Doomscrolling Reminder Lady’ on her favorite corners of the internet",
          "imageUrl": "https://blog.mozilla.org/wp-content/blogs.dir/278/files/2022/05/mcoi_karenho_twitter_1200x630-945x630.jpg"
        },
        {
          "id": "https://blog.mozilla.org/?p=69042",
          "author": "Kristina Bravo",
          "description": "Here at Mozilla, we are the first to admit the internet isn’t perfect, but we are also quick to point out that the internet is pretty darn magical. The internet opens up doors and opportunities, allows for people to connect with others, and lets everyone find where they belong — their corners of the internet. […]\nThe post Social media’s ‘Doomscrolling Reminder Lady’ on her favorite corners of the internet appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/internet-culture/interviews/karen-ho-twitter-doomscrolling-reminder-lady/",
          "publishedOn": "2022-06-02T15:55:40.000Z",
          "wordCount": null,
          "title": "Social media’s ‘Doomscrolling Reminder Lady’ on her favorite corners of the internet",
          "imageUrl": null
        },
        {
          "id": "https://blog.mozilla.org/?p=69082",
          "author": "Rebecca Smith",
          "description": "In January of 2019, Mozilla joined the University of Edinburgh, Charles University, University of Sheffield and University of Tartu as part of a project funded by the European Union called Project Bergamot. The ultimate goal of this consortium was to build a set of neural machine translation tools that would enable Mozilla to develop a […]\nThe post Mozilla releases local machine translation tools as part of Project Bergamot appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/mozilla/local-translation-add-on-project-bergamot/",
          "publishedOn": "2022-06-02T15:23:26.000Z",
          "wordCount": null,
          "title": "Mozilla releases local machine translation tools as part of Project Bergamot",
          "imageUrl": null
        },
        {
          "id": "https://blog.mozilla.org/?p=69067",
          "author": "Jenifer Boscacci",
          "description": "When we launched Mozilla VPN, a fast and easy-to-use VPN, it was in a market crowded by companies making promises about privacy and security and we believed our reputation for building products that help you keep your information safe would make our product stand-out. To date, tens of thousands of people have signed up to […]\nThe post Marketing our privacy products while preserving privacy  appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/products/mozilla-vpn/marketing-our-privacy-products-while-preserving-privacy/",
          "publishedOn": "2022-05-31T16:22:14.000Z",
          "wordCount": 1457,
          "title": "Marketing our privacy products while preserving privacy",
          "imageUrl": "https://blog.mozilla.org/wp-content/blogs.dir/278/files/2021/09/moz_vpn_blog_header_seo_explainer_home-1013x675.jpg"
        },
        {
          "id": "https://blog.mozilla.org/?p=68990",
          "author": "Kristina Bravo",
          "description": "Being feminine and having technical skills are not mutually exclusive. This should be obvious, but Xyla Foxlin has had to work hard to prove femininity and engineering can go hand in hand. While in college, she started a YouTube channel called Beauty and the Bolt, where she co-produced tutorials on STEM topics like electronics, math […]\nThe post Firefox Presents: A YouTube creator blending femininity and engineering appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/products/firefox/xyla-foxlin-youtube-engineering/",
          "publishedOn": "2022-05-20T15:44:03.000Z",
          "wordCount": 2040,
          "title": "Firefox Presents: A YouTube creator blending femininity and engineering",
          "imageUrl": "https://blog.mozilla.org/wp-content/blogs.dir/278/files/2022/05/Firefox_Presents_Ep2_Xyla_16x9_1-1080x720.jpg"
        },
        {
          "id": "https://blog.mozilla.org/?p=68934",
          "author": "admin",
          "description": "With the rapid growth of e-commerce in the last few years, more people are expecting their browser to help them out when shopping online. Firefox has supported credit card autofill in the United States and Canada since 2018. Starting today Firefox can remember and fill credit card details additionally in the United Kingdom, France and […]\nThe post Credit card autofill now enabled in the United Kingdom, France and Germany appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/products/firefox/firefox-credit-card-autofill-uk-france-germany/",
          "publishedOn": "2022-05-03T15:24:00.000Z",
          "wordCount": 846,
          "title": "Credit card autofill now enabled in the United Kingdom, France and Germany",
          "imageUrl": "https://blog.mozilla.org/wp-content/blogs.dir/278/files/2020/05/firefox-76-header-19-1056x704.png"
        },
        {
          "id": "https://blog.mozilla.org/?p=68902",
          "author": "Mozilla",
          "description": "Whether it’s celebrating the first 100 days of school or turning 100 years old, reaching a 100th milestone is a big deal worthy of confetti, streamers and cake, and of course, reflection. Today, Firefox is releasing its 100th version to our users and we wanted to take a moment to pause and look back on […]\nThe post Celebrating Firefox: How we got to 100 appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/mozilla/celebrating-firefox-100/",
          "publishedOn": "2022-05-03T13:00:08.000Z",
          "wordCount": 1959,
          "title": "Celebrating Firefox: How we got to 100",
          "imageUrl": "https://blog.mozilla.org/wp-content/blogs.dir/278/files/2022/04/firefox_blog_ffx100_orange-1008x672.png"
        },
        {
          "id": "https://blog.mozilla.org/?p=68888",
          "author": "Sarah Vasquez",
          "description": "There are so many different ways that Firefox users count on Picture-in-Picture for their best browsing and content viewing experiences: Toddler duty? Don’t sweat it! Stream your child’s favorite movie to watch on your desktop while you hold down your job and the title of “favorite parent!” Can’t miss the big game? Firefox’s Multiple Picture-in-Picture […]\nThe post Firefox’s Picture-in-Picture rolls out subtitles – a Mozilla Connect community requested feature appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/products/firefox/firefox-picture-in-picture-rolls-out-subtitles/",
          "publishedOn": "2022-05-03T12:43:26.000Z",
          "wordCount": 1551,
          "title": "Firefox’s Picture-in-Picture rolls out subtitles – a Mozilla Connect community requested feature",
          "imageUrl": "https://blog.mozilla.org/wp-content/blogs.dir/278/files/2022/05/PiP-Subtitles-Blog-Header-21-1027x684.jpg"
        }
      ]
    },
    {
      "title": "Julia Evans",
      "feedUrl": "https://jvns.ca/atom.xml",
      "siteUrl": "http://jvns.ca/atom.xml",
      "articles": [
        {
          "id": "https://jvns.ca/blog/2022/05/12/sqlite-utils--a-nice-way-to-import-data-into-sqlite/",
          "author": null,
          "description": "Hello! This is a quick post about a nice tool I found recently called sqlite-utils, from the tools category.\nRecently I wanted to do some basic data analysis using data from my Shopify\nstore. So I figured I’d query the Shopify API and import my data into SQLite,\nand then I could make queries to get the graphs I want.\nBut this seemed like a lot of boring work, like I’d have to write a\nschema and write a Python program. So I hunted around for a solution, and I\nfound sqlite-utils, a tool designed to make it easy to import arbitrary data\ninto SQLite to do data analysis on the data.\nsqlite-utils automatically generates a schema\nThe Shopify data has about a billion fields and I really did not want to type\nout a schema for it. sqlite-utils solves this problem: if I have an array of\nJSON orders, I…",
          "link": "https://jvns.ca/blog/2022/05/12/sqlite-utils--a-nice-way-to-import-data-into-sqlite/",
          "publishedOn": "2022-05-12T09:35:06.000Z",
          "wordCount": 653,
          "title": "sqlite-utils: a nice way to import data into SQLite for analysis",
          "imageUrl": null
        },
        {
          "id": "https://jvns.ca/blog/2022/05/10/pages-that-didn-t-make-it-into--how-dns-works-/",
          "author": null,
          "description": "Hello! A couple weeks ago I released a new zine called How DNS Works.\nWhen I started writing that zine (in, uh, January 2021), I originally had in\nmind a broader zine on “everything you need to know to own a domain”. So it had\na bunch of pages on domain registration, TLS, and email.\nAt the time I thought “I can just explain DNS in like 5 pages, it’s not\nthat complicated, there will be lots of space for other topics about domains”.\nI was extremely wrong about that and it turned out I needed all 28 pages to\nexplain DNS. So I ended up deciding to just focus the zine on DNS and all those\nother topics didn’t make it into the final zine.\nThis morning it occurred to me that instead of letting all of the old draft\npages languish in purgatory on my hard drive, I could post those extra pages\nhere all together on my blog. So here they are!\ndisclaimer: not super cohesive\nI will say (as a disclaimer) that these pages aren’t as cohesive as I usually\nlike my zines to be and they definitely do not tell you everything you need to\nneed to know to own a domain.\ndomain registration\n\n\n\n\n\n\nemail\n\n\nI should say that these 2 pages don’t really do email justice – email security\nis a HUGE topic that honestly I don’t know a lot about.\nTLS\n\n\nThese two pages also don’t remotely cover TLS, it’s possible I’ll write more in\ndepth about TLS at some point. Who knows!\nthat’s all!\nthough I will say: if you liked these, you might be interested in buying How DNS Works :)",
          "link": "https://jvns.ca/blog/2022/05/10/pages-that-didn-t-make-it-into--how-dns-works-/",
          "publishedOn": "2022-05-10T14:44:24.000Z",
          "wordCount": 361,
          "title": "Pages that didn't make it into \"How DNS Works\"",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Josh Comeau's blog",
      "feedUrl": "https://www.joshwcomeau.com/rss.xml",
      "siteUrl": "https://www.joshwcomeau.com/",
      "articles": [
        {
          "id": "https://www.joshwcomeau.com/css/surprising-truth-about-pixels-and-accessibility/",
          "author": "Josh W. Comeau",
          "description": "“Should I use pixels or rems?”. In this comprehensive blog post, we'll answer this question once and for all. You'll learn about the accessibility implications, and how to determine the best unit to use in any scenario.",
          "link": "https://www.joshwcomeau.com/css/surprising-truth-about-pixels-and-accessibility/",
          "publishedOn": "2022-05-17T12:00:00.000Z",
          "wordCount": 3835,
          "title": "The Surprising Truth About Pixels and Accessibility",
          "imageUrl": "https://www.joshwcomeau.com/images/og-surprising-truth-about-pixels-and-accessibility.png"
        },
        {
          "id": "https://www.smashingmagazine.com/2022/05/you-dont-need-ui-framework/",
          "author": "Josh W. Comeau",
          "description": "As developers, it can be tempting to grab a pre-styled UI framework like Material UI or Bootstrap. Seems like a great way to outsource design and save a bunch of time, right? In my experience, this is an unrealistic expectation, and things don’t quite work out that way.",
          "link": "https://www.smashingmagazine.com/2022/05/you-dont-need-ui-framework/",
          "publishedOn": "2022-05-03T11:00:00.000Z",
          "wordCount": 2895,
          "title": "You Don’t Need a UI Framework",
          "imageUrl": "https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/7fae9333-8fe0-468f-bc90-274417de15c3/you-dont-need-ui-framework.jpg"
        }
      ]
    },
    {
      "title": "A List Apart: The Full Feed",
      "feedUrl": "https://alistapart.com/main/feed/",
      "siteUrl": "https://alistapart.com",
      "articles": [
        {
          "id": "https://alistapart.com/article/mobile-first-css-is-it-time-for-a-rethink/",
          "author": "by",
          "description": "The mobile-first design methodology is great—it focuses on what really matters to the user, it’s well-practiced, and it’s been a common design pattern for years. So developing your CSS mobile-first should also be great, too…right? \nWell, not necessarily. Classic mobile-first CSS development is based on the principle of overwriting style declarations: you begin your CSS with default style declarations, and overwrite and/or add new styles as you add breakpoints with min-width media queries for larger viewports (for a good overview see “What is Mobile First CSS and Why Does It Rock?”). But all those exceptions create complexity and inefficiency, which in turn can lead to an increased testing effort and a code base that’s harder to maintain. Admit it—how many of us willingly want that?\nOn your…",
          "link": "https://alistapart.com/article/mobile-first-css-is-it-time-for-a-rethink/",
          "publishedOn": "2022-06-09T02:13:10.000Z",
          "wordCount": null,
          "title": "Mobile-First CSS: Is It Time for a Rethink?",
          "imageUrl": null
        },
        {
          "id": "https://alistapart.com/article/redefine-success-first/",
          "author": "by",
          "description": "About two and a half years ago, I introduced the idea of daily ethical design. It was born out of my frustration with the many obstacles to achieving design that’s usable and equitable; protects people’s privacy, agency, and focus; benefits society; and restores nature. I argued that we need to overcome the inconveniences that prevent us from acting ethically and that we need to elevate design ethics to a more practical level by structurally integrating it into our daily work, processes, and tools.\nUnfortunately, we’re still very far from this ideal. \nAt the time, I didn’t know yet how to structurally integrate ethics. Yes, I had found some tools that had worked for me in previous projects, such as using checklists, assumption tracking, and “dark reality” sessions, but I didn’t manage to a…",
          "link": "https://alistapart.com/article/redefine-success-first/",
          "publishedOn": "2022-05-12T14:00:00.000Z",
          "wordCount": 3970,
          "title": "Designers, (Re)define Success First",
          "imageUrl": "https://i0.wp.com/alistapart.com/wp-content/uploads/2022/05/redefine-success-illo.jpg?fit=1200%2C627&ssl=1"
        }
      ]
    },
    {
      "title": "Pluralistic: Daily links from Cory Doctorow",
      "feedUrl": "https://pluralistic.net/feed/",
      "siteUrl": "https://pluralistic.net",
      "articles": [
        {
          "id": "https://pluralistic.net/?p=3806",
          "author": "Cory Doctorow",
          "description": "Today's links Daycare apps are insecure surveillance dumpster-fires: Apps are like software, only worse. Hey look at this: Delights to delectate. This day in history: 2007, 2012, 2017, 2021 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Daycare apps are insecure surveillance dumpster-fires (permalink) When my EFF colleague Alexis Hancock signed her baby up for daycare, she was told that she had to download a childcare management app – to monitor and specify \"feedings, diaper changes, pictures, activities, and which guardian picked-up/dropped-off the child.\" https://www.eff.org/deeplinks/2022/06/daycare-apps-are-dangerously-insecure This was during the lockdown, and the app was a way to comply with social distancing and contact tracing …",
          "link": "https://pluralistic.net/2022/06/23/peek-a-boo/",
          "publishedOn": "2022-06-23T16:08:59.000Z",
          "wordCount": 2969,
          "title": "Pluralistic: 23 Jun 2022",
          "imageUrl": null
        },
        {
          "id": "https://pluralistic.net/?p=3799",
          "author": "Cory Doctorow",
          "description": "Today's links The sex industry isn't technophilic: Why sex workers are the first in – and first out – of new technologies. Schroedinger's streaming service just died: When is a \"sale\" a \"license?\" Hey look at this: Delights to delectate. This day in history: 2002, 2007, 2012, 2017, 2021 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading The sex industry isn't technophilic (permalink) The sex industry has pioneered every new communications tool since the printing press: in my own lifetime, I've watched it take the lead in VCRs, desktop publishing, BBSes, digital text, digital images, digital videos, live streaming services, cryptocurrency, and VR. It would be easy to conclude that being interested in sex is somehow correlated with being fas…",
          "link": "https://pluralistic.net/2022/06/21/early-adopters/",
          "publishedOn": "2022-06-21T17:46:45.000Z",
          "wordCount": 3894,
          "title": "Pluralistic: 21 Jun 2022",
          "imageUrl": "https://i0.wp.com/pluralistic.net/wp-content/uploads/2020/02/cropped-guillotine-French-Revolution.jpg?fit=32%2C32&ssl=1"
        },
        {
          "id": "https://pluralistic.net/?p=3788",
          "author": "Cory Doctorow",
          "description": "Today's links Facebook's right, Apple is too powerful: And so is Facebook. This day in history: 2002, 2007, 2012, 2017, 2021 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Facebook's right, Apple is too powerful (permalink) On the one hand, Facebook's comments to the NTIA on Apple's market power are supremely ironic. Facebook, complaining about excessive market power? https://downloads.regulations.gov/NTIA-2022-0001-0145/attachment_1.pdf Even worse is what Facebook is complaining about: Apple's App Tracking Transparency update to Ios devices like the Iphone, which allowed users to comprehensively and easily block all the apps on their phones from spying on them. When Apple gave users this choice, nearly all of them chose privacy. https…",
          "link": "https://pluralistic.net/2022/06/17/no-gods-no-masters/",
          "publishedOn": "2022-06-17T08:55:23.000Z",
          "wordCount": 2025,
          "title": "Pluralistic: 17 Jun 2022",
          "imageUrl": null
        },
        {
          "id": "https://pluralistic.net/?p=3771",
          "author": "Cory Doctorow",
          "description": "Today's links Boy, gig companies sure hire disastrously sloppy lawyers: $100m flushed down the drain in Massachusetts. Hey look at this: Delights to delectate. This day in history: 2002, 2007, 2012, 2017, 2021 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Boy, gig companies sure hire disastrously sloppy lawyers (permalink) In the run-up to the 2020 election, \"gig work\" companies, led by Uber and Lyft, firehosed $225m to back the passage of Proposition 22, a law that would permanently allow them to misclassify employees as contractors, not entitled to benefits or workplace protections. More than a decade after Citizen United – the Supreme Court ruling that paved the way for unlimited dark money in US election spending – it's sometimes …",
          "link": "https://pluralistic.net/2022/06/15/simple-as-abc/",
          "publishedOn": "2022-06-15T07:01:02.000Z",
          "wordCount": 2141,
          "title": "Pluralistic: 15 Jun 2022",
          "imageUrl": null
        },
        {
          "id": "https://pluralistic.net/?p=3766",
          "author": "Cory Doctorow",
          "description": "Today's links Adventure Capitalism: A history of \"Libertarian Exit\" movements. This day in history: 2007, 2012, 2017, 2021 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Adventure Capitalism (permalink) The 17th century philosopher John Locke is a key grifter thinkfluencer, and his \"labor theory of property\" is key to understanding the libertarian mind-palace. https://locusmag.com/2019/03/cory-doctorow-terra-nullius/ Locke says that property arises when the empty, unimproved natural places are mixed with human labor. You own your body, so you own its labor and the fruits of its labor. No one owns an empty place, so when you influse your body's labor into a place, it becomes yours. There's only one teensy problem with this: there are no…",
          "link": "https://pluralistic.net/2022/06/14/this-way-to-the-egress/",
          "publishedOn": "2022-06-14T09:41:40.000Z",
          "wordCount": 2389,
          "title": "Pluralistic: 14 Jun 2022",
          "imageUrl": null
        },
        {
          "id": "https://pluralistic.net/?p=3761",
          "author": "Cory Doctorow",
          "description": "Today's links Podcasting \"Regulatory Capture\": My column about the difference between a left and a right theory of sound regulation. Hey look at this: Delights to delectate. This day in history: 2012, 2017. Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Podcasting \"Regulatory Capture\" (permalink) This week on my podcast, I read my Medium column, \"Regulatory Capture: Beyond Revolving Doors and Against Regulatory Nihilism,\" about the left/right split on theories of sound regulation: https://doctorow.medium.com/regulatory-capture-59b2013e2526 If you'd like an essay-formatted version of this thread to read or share, here's a link to it on pluralistic.net, my surveillance-free, ad-free, tracker-free blog: https://pluralistic.net/2022/06/13/…",
          "link": "https://pluralistic.net/2022/06/13/public-choice/",
          "publishedOn": "2022-06-13T12:40:15.000Z",
          "wordCount": 2728,
          "title": "Pluralistic: 13 Jun 2022",
          "enclosure": {
            "url": "https://archive.org/download/Cory_Doctorow_Podcast_428/Cory_Doctorow_Podcast_428_-_Regulatory_Capture.mp3",
            "length": "0",
            "type": "audio/mpeg"
          },
          "imageUrl": null
        },
        {
          "id": "https://pluralistic.net/?p=3758",
          "author": "Cory Doctorow",
          "description": "Today's links The Geico STD story is the new McDonald's Hot Coffee story: The real story is binding arbitration. Hey look at this: Delights to delectate. This day in history: 2002, 2007, 2012, 2017, 2021 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading The Geico STD story is the new McDonald's Hot Coffee story (permalink) Here's a media literacy rule of thumb: any time you hear about how the courts have done something outrageous and absurd to some poor, long-suffering, gigantic, wildly profitable corporation…dig deeper. The canonical example is the \"McDonald's Hot Coffee Lawsuit\" (aka Liebeck v. McDonald's Restaurants). You know, that time that an old lady got burned by her McDonald's coffee and then sued for for $2.7 million?! Most peop…",
          "link": "https://pluralistic.net/2022/06/12/hot-coffee/",
          "publishedOn": "2022-06-12T15:05:51.000Z",
          "wordCount": 2802,
          "title": "Pluralistic: 12 Jun 2022",
          "imageUrl": null
        },
        {
          "id": "https://pluralistic.net/?p=3753",
          "author": "Cory Doctorow",
          "description": "Today's links Monopolists want to create human inkjet printers: The war on your pancreas continues. Hey look at this: Delights to delectate. This day in history: 2012, 2017, 2021 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Monopolists want to create human inkjet printers (permalink) Even if you don't have diabetes, you can't have missed that there's something really terrible going on with how Americans with diabetes control their illness. Insulin – a century-old drug whose inventors refused any patents – has experienced double-digit, year-on-year price hikes (1123% between 2009-2017 alone!): https://www.nbcnews.com/business/consumer/desperate-families-driven-black-market-insulin-n730026 Moreover, this is a uniquely American circumst…",
          "link": "https://pluralistic.net/2022/06/10/loopers/",
          "publishedOn": "2022-06-10T17:57:07.000Z",
          "wordCount": 2464,
          "title": "Pluralistic: 10 Jun 2022",
          "imageUrl": null
        },
        {
          "id": "https://pluralistic.net/?p=3744",
          "author": "Cory Doctorow",
          "description": "Today's links Powered wheelchairs and Right to Repair: An unprecedented legislative victory in Colorado. Hey look at this: Delights to delectate. This day in history: 2007, 2012, 2017, 2021 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Powered wheelchairs and Right to Repair (permalink) Here's a miserable story with a mostly happy ending, one that leaves us with work to do, sure, but also with clarity on what to do next and how to do it. It's about Colorado's HB22-1031, \"Consumer Right To Repair Powered Wheelchairs,\" which Governor Jared Polis signed into law last week: https://leg.colorado.gov/bills/hb22-1031#:~:text=Concerning%20a%20requirement%20that%20a,repair%20the%20manufacturer%27s%20powered%20wheelchairs Three million American…",
          "link": "https://pluralistic.net/2022/06/08/chair-ish/",
          "publishedOn": "2022-06-08T15:16:09.000Z",
          "wordCount": 2424,
          "title": "Pluralistic: 08 Jun 2022",
          "imageUrl": null
        },
        {
          "id": "https://pluralistic.net/?p=3736",
          "author": "Cory Doctorow",
          "description": "Today's links James Bridle's \"Ways of Being\": Dispatches from the more than human world. Fake Christian health insurance and other big cons: If you have to trick people into hearing your message, you are in a cult. Hey look at this: Delights to delectate. This day in history: 2002, 2012, 2017, 2021 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading James Bridle's \"Ways of Being\" (permalink) It's hard to pin down the thesis of James Bridle's Ways of Being, published today in the USA by Farrar, Strauss, Giroux – it's a big, lyrical, strange and inspiring book about the \"more than human world\" – a world that encompasses the worldview of animals, ecosystems, and software. https://us.macmillan.com/books/9780374601119/waysofbeing Bridle, an Engl…",
          "link": "https://pluralistic.net/2022/06/07/more-than-human/",
          "publishedOn": "2022-06-07T16:26:33.000Z",
          "wordCount": 3526,
          "title": "Pluralistic: 07 Jun 2022",
          "imageUrl": null
        },
        {
          "id": "https://pluralistic.net/?p=3732",
          "author": "Cory Doctorow",
          "description": "Today's links Podcasting \"Against Cozy Catastrophes\": My Medium column about the failure of market-based pensions. MBAs and wage stagnation: Going to business school makes you a dick. This day in history: 2002, 2007, 2012, 2017 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Podcasting \"Against Cozy Catastrophes\" (permalink) This week on my podcast, I read my recent Medium column, \"Against Cozy Catastrophies: Cowering in a luxury bunker is a lousy retirement plan.\" It's a column about the failure of a market-based, individual based approach to the collective problem of retirement savings. https://doctorow.medium.com/against-cozy-catastrophies-7ac0a62f0922 One of the major contributors to the national wealth of the world's \"advanced econ…",
          "link": "https://pluralistic.net/2022/06/06/fortress-mentality/",
          "publishedOn": "2022-06-06T16:35:51.000Z",
          "wordCount": 2676,
          "title": "Pluralistic: 06 Jun 2022",
          "enclosure": {
            "url": "https://ia601409.us.archive.org/19/items/Cory_Doctorow_Podcast_427/Cory_Doctorow_Podcast_427_-_Against_Cozy_Catastrophies.mp3",
            "length": "18999296",
            "type": "audio/mpeg"
          },
          "imageUrl": null
        },
        {
          "id": "https://pluralistic.net/?p=3726",
          "author": "Cory Doctorow",
          "description": "Today's links The Big Box of Sparkly Unicorn Magic: If Hobbes was a snarky unicorn and Calvin was an awesome little girl. Hey look at this: Delights to delectate. This day in history: 2007, 2012, 2017, 2021 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading The Big Box of Sparkly Unicorn Magic (permalink) Back in 2015, when my daughter Poesy was seven, I read her a story every night at bedtime. It was a glorious time, not just for our father-daughter relationship, but for my own relationship with kids' literature, which is a spectacular and rich part of the publishing world that grownups frequently have no contact with. One of the great successes of our bedtime story ritual was our discovery of Dana Simpson's \"Phoebe and Her Unicorn\" comic…",
          "link": "https://pluralistic.net/2022/06/05/heavenly-nostrils/",
          "publishedOn": "2022-06-05T15:20:42.000Z",
          "wordCount": 2166,
          "title": "Pluralistic: 05 Jun 2022",
          "imageUrl": null
        },
        {
          "id": "https://pluralistic.net/?p=3714",
          "author": "Cory Doctorow",
          "description": "Today's links House sales are cratering but inventory is soaring: You are the sucker at the table. Hey look at this: Delights to delectate. This day in history: 2002, 2007, 2012, 2017, 2021 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading House sales are cratering but inventory is soaring (permalink) When I moved to the UK in the early 2000s, nearly everyone I met fancied themselves a real-estate investment genius. Young people all had plans to \"get on the housing ladder.\" Each of these schemes was more crackpot than the last – the most plausible involved buying minuscule flats, \"doing them up,\" and flipping them. The weirder ones involved buying unbuilt holiday homes in Spain or Croatia – places these people couldn't afford to visit, es…",
          "link": "https://pluralistic.net/2022/06/03/gambling-home/",
          "publishedOn": "2022-06-03T17:54:05.000Z",
          "wordCount": 2557,
          "title": "Pluralistic: 03 Jun 2022",
          "imageUrl": null
        },
        {
          "id": "https://pluralistic.net/?p=3720",
          "author": "Cory Doctorow",
          "description": "NB: This duplicate post exists solely to correct a broken Twitter link Today's links House sales are cratering but inventory is soaring: You are the sucker at the table. Hey look at this: Delights to delectate. This day in history: 2002, 2007, 2012, 2017, 2021 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading House sales are cratering but inventory is soaring (permalink) When I moved to the UK in the early 2000s, nearly everyone I met fancied themselves a real-estate investment genius. Young people all had plans to \"get on the housing ladder.\" Each of these schemes was more crackpot than the last – the most plausible involved buying minuscule flats, \"doing them up,\" and flipping them. The weirder ones involved buying unbuilt holiday homes…",
          "link": "https://pluralistic.net/2022/06/02/residential-casino/",
          "publishedOn": "2022-06-02T18:45:37.000Z",
          "wordCount": 2568,
          "title": "Pluralistic: 03 Jun 2022 (supplemental)",
          "imageUrl": null
        },
        {
          "id": "https://pluralistic.net/?p=3702",
          "author": "Cory Doctorow",
          "description": "Today's links Inflation is caused by too little capacity: Not too much money. Hey look at this: Delights to delectate. This day in history: 2002, 2007, 2012, 2017, 2021 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Inflation is caused by too little capacity (permalink) Inflation is here, and there are a lot of explanations for it. People who worry about the monetary supply – especially people in the deflation-loving cryptocurrency world – blame it on excessive money creation during the pandemic and uppity workers demanding higher wages: https://www.businessinsider.com/elon-musk-remote-work-makes-you-less-productive-wrong-2022-6 Anti-monopolists blame inflation on price-gouging. This is a persuasive argument. After all, CEOs of compani…",
          "link": "https://pluralistic.net/2022/06/01/factories-to-condos-pipeline/",
          "publishedOn": "2022-06-01T16:16:33.000Z",
          "wordCount": 2488,
          "title": "Pluralistic: 01 Jun 2022",
          "imageUrl": null
        },
        {
          "id": "https://pluralistic.net/?p=3697",
          "author": "Cory Doctorow",
          "description": "Today's links How John Deere leverages repair-blocking into gag orders: A farmer's only local dealership refuses to fix his tractor because he advocates for Right to Repair. Hey look at this: Delights to delectate. This day in history: 2007, 2012, 2017 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading How John Deere leverages repair-blocking into gag orders (permalink) John Deere is justifiably notorious for its campaign to block farmers from fixing their own agricultural equipment. The company is #RightToRepair's archnemesis, and no amount of misleading feel-good stories about how it keeps its heavy hand on farmers' tractors forever can change that. https://doctorow.medium.com/about-those-kill-switched-ukrainian-tractors-bc93f471b9c8 The…",
          "link": "https://pluralistic.net/2022/05/31/dealers-choice/",
          "publishedOn": "2022-05-31T15:10:43.000Z",
          "wordCount": 1666,
          "title": "Pluralistic: 31 May 2022",
          "imageUrl": null
        },
        {
          "id": "https://pluralistic.net/?p=3692",
          "author": "Cory Doctorow",
          "description": "Today's links Podcasting \"Apple's Cement Overshoes\": Thinking different about right to repair. Hey look at this: Delights to delectate. This day in history: 2002, 2007, 2012, 2017 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Podcasting \"Apple's Cement Overshoes\" (permalink) This week on my podcast, I read my recent Medium column, \"Apple's Cement Overshoes,\" about the incredible, cynical fuckery that Apple engages in to sabotage right to repair and ensure that its devices end up in overseas e-waste landfills rather than being fixed and kept in service. https://doctorow.medium.com/apples-cement-overshoes-329856288d13 For all the debate around Right to Repair, it's amazing how simple the actual issue is. On the anti- side, you have comp…",
          "link": "https://pluralistic.net/2022/05/30/80-lbs/",
          "publishedOn": "2022-05-30T19:18:32.000Z",
          "wordCount": 3626,
          "title": "Pluralistic: 30 May 2022",
          "enclosure": {
            "url": "https://archive.org/download/apples-cement-overshoes/Cory_Doctorow_Podcast_426_-_Apples_Cement_Overshoes.mp3",
            "length": "0",
            "type": "audio/mpeg"
          },
          "imageUrl": null
        },
        {
          "id": "https://pluralistic.net/?p=3684",
          "author": "Cory Doctorow",
          "description": "Today's links Wework founder raises $70m for blockchain-based, \"voluntary\" carbon credits: It's a scam matrioshka. Hey look at this: Delights to delectate. This day in history: None Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Wework founder raises $70m for blockchain-based, \"voluntary\" carbon credits (permalink) Even crypto's biggest boosters admit that the industry has a scam problem. This is especially hard to deny now that hundred of billions of (real) dollars' worth of (fake) \"stablecoins\" have gone up in smoke. Crypto apologists will tell you that there are scams everywhere, and they're not wrong. The productive economy has been systematic dismantled and replaced with financialized grifts: private equity, REITs, SPACs, MLMs, ad…",
          "link": "https://pluralistic.net/2022/05/27/voluntary-carbon-market/",
          "publishedOn": "2022-05-27T16:35:34.000Z",
          "wordCount": 2551,
          "title": "Pluralistic: 27 May 2022",
          "imageUrl": null
        },
        {
          "id": "https://pluralistic.net/?p=3680",
          "author": "Cory Doctorow",
          "description": "Today's links Attacking machine learning training by re-ordering data: Boy it's hard to audit an AI. This day in history: 2012, 2021 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Attacking machine learning training by re-ordering data (permalink) We have increasingly outsourced our decision-making to machine learning models (\"the algorithm\"). The whole point of building recommendation, sorting, and \"decision support\" systems on ML is to undertake assessments at superhuman speed and scale, which means that the idea of a \"human in the loop\" who validates machine judgment is a mere figleaf, and it only gets worse from here. There are real consequences to this. I mean, for starters, if you get killed by a US military drone, chances are th…",
          "link": "https://pluralistic.net/2022/05/26/initialization-bias/",
          "publishedOn": "2022-05-26T10:41:19.000Z",
          "wordCount": 1734,
          "title": "Pluralistic: 26 May 2022",
          "imageUrl": null
        },
        {
          "id": "https://pluralistic.net/?p=3667",
          "author": "Cory Doctorow",
          "description": "Today's links Talking with Kim Stanley Robinson about \"The High Sierra\": An interview for Fatherly Magazine. Kim Stanley Robinson's \"The High Sierra\": A love story. Hey look at this: Delights to delectate. This day in history: 2007, 2012, 2017, 2021 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Talking with Kim Stanley Robinson about \"The High Sierra\" (permalink) This month, the great Kim Stanley Robinson published \"The High Sierra,\" an odd combination of memoir, natural history, mountaineering guidebook, and environmental manifesto. At one point, Robinson told me it would be his last book. Thankfully, he changed his mind, but I can see why he'd think of this as a career capstone. https://www.littlebrown.com/titles/kim-stanley-robinso…",
          "link": "https://pluralistic.net/2022/05/25/the-wild-places/",
          "publishedOn": "2022-05-25T11:56:18.000Z",
          "wordCount": null,
          "title": "Pluralistic: 25 May 2022",
          "imageUrl": null
        },
        {
          "id": "https://pluralistic.net/?p=3661",
          "author": "Cory Doctorow",
          "description": "Today's links HSBC: \"Who cares if Miami is underwater?\": Scenes from the \"Moral Money Summit.\" Hey look at this: Delights to delectate. This day in history: 2002, 2012, 2017 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading HSBC: \"Who cares if Miami is underwater?\" (permalink) Before I tell you about how HSBC just announced it wants to literally render the planet Earth unfit for human habitation, I want to talk about HSBC's other crimes. Remember the LIBOR scandal? HSBC was neck-deep in it, costing the world's public coffers trillions through fraud? https://www.bloomberg.com/news/articles/2016-05-23/banks-are-ordered-by-court-to-defend-libor-antitrust-lawsuit HSBC used laundered money from the world's most corrupt people to cash out on it…",
          "link": "https://pluralistic.net/2022/05/24/moral-money/",
          "publishedOn": "2022-05-24T14:24:27.000Z",
          "wordCount": 2353,
          "title": "Pluralistic: 24 May 2022",
          "imageUrl": null
        },
        {
          "id": "https://pluralistic.net/?p=3656",
          "author": "Cory Doctorow",
          "description": "Today's links SPACs were hugely successful (for banks): But you lost your shirt. Hey look at this: Delights to delectate. This day in history: 2002, 2007, 2012, 2017, 2021 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading SPACs were hugely successful (for banks) (permalink) Remember SPACs? For a while, you couldn't turn around without hearing about a celeb who was backing a \"blank check\" IPO. It was confusing, because SPACs don't make any sense: you buy into a company at $10/share. The company has no business, no products, nothing. But it plans on going public, and then buying another company. In theory, you're betting that some celebrity-endorsed randos will take all the $10 share buy-ins and use the money to buy another company – a comp…",
          "link": "https://pluralistic.net/2022/05/23/you-got-spacced/",
          "publishedOn": "2022-05-23T15:50:53.000Z",
          "wordCount": 2607,
          "title": "Pluralistic: 23 May 2022",
          "imageUrl": null
        },
        {
          "id": "https://pluralistic.net/?p=3652",
          "author": "Cory Doctorow",
          "description": "Today's links Podcasting \"About Those Killswitched Ukrainian Tractors\": Good spaceships don't have self-destruct buttons. Hey look at this: Delights to delectate. This day in history: 2002, 2017 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Podcasting \"About Those Killswitched Ukrainian Tractors\" (permalink) This week on my podcast, I read my Medium column, \"About Those Killswitched Ukrainian Tractors,\" in which I am a bit of a buzzkill about that feel-good story of a Ukrainian John Deere dealership bricking $5m worth of tractors stolen by Russian looters: https://doctorow.medium.com/about-those-kill-switched-ukrainian-tractors-bc93f471b9c8 In case you missed the underlying story, here's a quick recap. Russian looters, abetted by the …",
          "link": "https://pluralistic.net/2022/05/20/self-destruct-button/",
          "publishedOn": "2022-05-20T17:05:08.000Z",
          "wordCount": 3085,
          "title": "Pluralistic: 20 May 2022",
          "enclosure": {
            "url": "https://archive.org/download/Cory_Doctorow_Podcast_425/Cory_Doctorow_Podcast_425_-_About_Those_Killswitched_Ukrainian_Tractors.mp3",
            "length": "0",
            "type": "audio/mpeg"
          },
          "imageUrl": null
        },
        {
          "id": "https://pluralistic.net/?p=3641",
          "author": "Cory Doctorow",
          "description": "Today's links Your mom is a tech ninja: Your boss? Not so much. The impossible scam of US drug plans: Even the guy who invented them can't figure them out. Hey look at this: Delights to delectate. This day in history: 2002, 2007, 2012, 2017, 2021 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Your mom is a tech ninja (permalink) What makes someone \"good at technology?\" In part, it's an understanding of the underlying technical principles and industry conventions – what a \"power on\" icon looks like, say. I have a lot of that. But there's another component, one that's often invisible to people like me: the extent to which your technology was designed to suit your needs. I have a lot of that, too. I'm a 50 year old, middle-class, tech-ind…",
          "link": "https://pluralistic.net/2022/05/19/the-weakest-link/",
          "publishedOn": "2022-05-19T16:13:42.000Z",
          "wordCount": 3083,
          "title": "Pluralistic: 19 May 2022",
          "imageUrl": null
        },
        {
          "id": "https://pluralistic.net/?p=3635",
          "author": "Cory Doctorow",
          "description": "Today's links A(nother) way in which Facebook is the 21st Century's tobacco industry: Millions for front groups who insist that only Mark Zuckerberg can save us from Xi Jinping. This day in history: 2007, 2012, 2017, 2021 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading A(nother) way in which Facebook is the 21st Century's tobacco industry (permalink) Have you noticed some extremely normal ads from extremely normal \"grassroots activists\" who are really, really worried that if we break up Facebook, China will destroy America and that is why Congress must absolutely stop trying to regulate America's tech giants, the bristling colossi that stand guard to defend us from the menace across the ocean? https://www.djournal.com/opinion/columnists…",
          "link": "https://pluralistic.net/2022/05/18/turfed/",
          "publishedOn": "2022-05-18T07:01:21.000Z",
          "wordCount": 2288,
          "title": "Pluralistic: 18 May 2022",
          "imageUrl": null
        },
        {
          "id": "https://pluralistic.net/?p=3621",
          "author": "Cory Doctorow",
          "description": "Today's links How Big Pharma bribed docs to overprescribe opioids: Analysis from UCSF's \"Opioid Industry Documents\" repository. Hey look at this: Delights to delectate. This day in history: 2002, 2007, 2012, 2017, 2021 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading How Big Pharma bribed docs to overprescribe opioids (permalink) I have complex chronic pain, and I've seen a lot of specialists. One of them prescribed long-term opioids for me. I dodged a bullet there, I think. Here's a little story about how hard it is to know whether to trust your doctor when you have a pain condition. One day, I was in a neurologist's office here in Burbank, waiting for a nerve timing study. I picked up the neurology journal on the waiting-room table and…",
          "link": "https://pluralistic.net/2022/05/17/dollars-for-docs/",
          "publishedOn": "2022-05-17T15:45:56.000Z",
          "wordCount": 2140,
          "title": "Pluralistic: 17 May 2022",
          "enclosure": {
            "url": "https://ia802708.us.archive.org/26/items/SFinSF_Cory_Doctorow_and_Rudy_Rucker/SFinSF_1_Cory_Doctorow_256.mp3",
            "length": "52324626",
            "type": "audio/mpeg"
          },
          "imageUrl": null
        },
        {
          "id": "https://pluralistic.net/?p=3617",
          "author": "Cory Doctorow",
          "description": "Today's links Amy's Kitchen, a case-study in the problems with consumerism: You are not an ambulatory wallet. Hey look at this: Delights to delectate. This day in history: 2002, 2007, 2012, 2017, 2021 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Amy's Kitchen, a case-study in the problems with consumerism (permalink) As theories of change go, consumerism has a lot going for it. \"Voting with your dollars\" cuts out the middleman: rather than voting for a politician and hoping that they do the right thing, you can just reward good companies directly by buying their products (and punish bad companies by not buying their products). But voting with your dollars has some obvious deficits. The first one is that you can't shop your way out of…",
          "link": "https://pluralistic.net/2022/05/16/through-the-meat-grinder/",
          "publishedOn": "2022-05-16T16:50:40.000Z",
          "wordCount": 2958,
          "title": "Pluralistic: 16 May 2022",
          "imageUrl": null
        },
        {
          "id": "https://pluralistic.net/?p=3607",
          "author": "Cory Doctorow",
          "description": "Today's links A useful, critical taxonomy of decentralization, beyond blockchains: Not all who decentralize are bros. Hey look at this: Delights to delectate. This day in history: 2002, 2012, 2017. Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading A useful, critical taxonomy of decentralization, beyond blockchains (permalink) I keep getting sucked into discussions of web3, decentralization and cryptocurrency. It's only natural: much of the rhetoric and stated goals of the people behind these technologies intersect with my longstanding causes, like access to cryptography and decentralized communities (what we used to call P2P). The reason I say I get \"sucked into\" these discussions is that, despite the rhetorical overlap, I've sensed a sig…",
          "link": "https://pluralistic.net/2022/05/12/crypto-means-cryptography/",
          "publishedOn": "2022-05-12T17:28:13.000Z",
          "wordCount": 3471,
          "title": "Pluralistic: 12 May 2022",
          "imageUrl": null
        },
        {
          "id": "https://pluralistic.net/?p=3602",
          "author": "Cory Doctorow",
          "description": "Today's links The (billionaires') case against billionaires: Turns out, we live in a society. Hey look at this: Delights to delectate. This day in history: 2002, 2007, 2012, 2017, 2021 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading The (billionaires') case against billionaires (permalink) The downsides of a world with billionaires in it are well-rehearsed: billionaires can convert their vast wealth to power, and use that power to turn their whims and pet theories into policy failures that affect millions – or even billions – of people. Take Bill Gates. Forget all the conspiracy theories about Gates and vaccines – it's bizarre that people bother to make up those fairy-tales when the truth is so much worse. Gates has an absolute ideologi…",
          "link": "https://pluralistic.net/2022/05/11/a-dent-in-the-universe/",
          "publishedOn": "2022-05-11T15:14:36.000Z",
          "wordCount": 2436,
          "title": "Pluralistic: 11 May 2022",
          "imageUrl": null
        },
        {
          "id": "https://pluralistic.net/?p=3595",
          "author": "Cory Doctorow",
          "description": "Today's links At the FTC, a quiet, profound shift on antitrust: Listening to \"those who have experienced firsthand the effects of mergers and acquisitions beyond antitrust experts.\" Hey look at this: Delights to delectate. This day in history: 2002, 2007, 2012, 2017, 2021 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading At the FTC, a quiet, profound shift on antitrust (permalink) Sometimes, a tiny change in the political process comes along that makes you realize just how far things have come – a change that's both substantive and symbolic. Something like this terse, six-paragraph memo from the FTC, a deceptively anodyne wrapper for an explosive moment: https://www.ftc.gov/news-events/events/2022/05/ftc-justice-department-listening-forum…",
          "link": "https://pluralistic.net/2022/05/09/rest-in-piss-robert-bork/",
          "publishedOn": "2022-05-09T10:28:30.000Z",
          "wordCount": 2445,
          "title": "Pluralistic: 09 May 2022",
          "imageUrl": null
        },
        {
          "id": "https://pluralistic.net/?p=3590",
          "author": "Cory Doctorow",
          "description": "Today's links Safegraph follows people into abortion clinics and then sells the data: And then they lie about it. Hey look at this: Delights to delectate. This day in history: 2002, 2007, 2012, 2017, 2021 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Safegraph follows people into abortion clinics and then sells the data (permalink) As theocrats in robes, appointed by presidents who lost their elections, make ready to impose forced birth on half of America, it's right to worry that police in thrall to \"the party of small government\" will spy on, hunt down, and punish people who get abortions (or miscarry). It's not all despair. This era of forced birth offers many possibilities that were denied in the pre-Roe era. The advent of abortio…",
          "link": "https://pluralistic.net/2022/05/07/safegraph-spies-and-lies/",
          "publishedOn": "2022-05-07T11:53:05.000Z",
          "wordCount": 2506,
          "title": "Pluralistic: 07 May 2022",
          "imageUrl": null
        },
        {
          "id": "https://pluralistic.net/?p=3583",
          "author": "Cory Doctorow",
          "description": "Today's links A New York law to end to Wall Street's pension ripoff: The ex-suckers flip the card table. Hey look at this: Delights to delectate. This day in history: 2002, 2012, 2017, 2021 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading A New York law to end to Wall Street's pension ripoff (permalink) The \"Shield of Boringness\" – c.f. Dana Claire – is a scammer's weapon. Layering scams in complexity lets villains get away with all kinds of nastiness. Some things are hard to understand because they're complex, but some things are complex so they'll be hard to understand. In finance, this is sometimes called MEGO: \"my eyes glaze over\" – complex scams designed to bore their victims into submission. All of us are vulnerable to MEGO, becaus…",
          "link": "https://pluralistic.net/2022/05/05/mego/",
          "publishedOn": "2022-05-05T14:38:35.000Z",
          "wordCount": 1992,
          "title": "Pluralistic: 05 May 2022",
          "imageUrl": null
        },
        {
          "id": "https://pluralistic.net/?p=3576",
          "author": "Cory Doctorow",
          "description": "Today's links The eye-glazing scam of Medicare drug plans: Six tiers and none of them mean a fucking thing. Hey look at this: Delights to delectate. This day in history: 2012, 2017, 2021 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading The eye-glazing scam of Medicare drug plans (permalink) CORRECTION: An earlier version of this article erroneously claimed Simon Lovell had passed away; I misremembered my contribution to a 2015 medical fundraiser for Mr Lovell as a contribution to a funeral expenses fundraiser. My sincere apologies to Mr Lovell (and I'm delighted to learn I was wrong!). Indie bookstores can change your life. In 2007, I wandered into NYC's St Marks' Bookstore (RIP) and picked up a book from the recommended table: \"How to C…",
          "link": "https://pluralistic.net/2022/05/04/house-always-wins/",
          "publishedOn": "2022-05-04T14:52:29.000Z",
          "wordCount": 2052,
          "title": "Pluralistic: 04 May 2022",
          "imageUrl": null
        },
        {
          "id": "https://pluralistic.net/?p=3567",
          "author": "Cory Doctorow",
          "description": "Today's links The Democrats' self-immolating fetish for means-testing: How to lose an election…and a nation. Hey look at this: Delights to delectate. This day in history: 2002, 2007, 2012, 2017, 2021 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading The Democrats' self-immolating fetish for means-testing (permalink) Biden campaigned on universal student debt reduction, but now wants to add a means-test; a layer of bureaucratic formalities to identify the \"deserving poor.\" The neoliberal fetish for red-tape is on the march, and the consequences will be the 2022 mid-terms, and maybe the future of the nation. Means-testing is the kind of technocratic make-work beloved of the McKinsey set, thus it was no surprise that Buttigieg campaigned aga…",
          "link": "https://pluralistic.net/2022/05/03/utopia-of-rules/",
          "publishedOn": "2022-05-03T16:36:41.000Z",
          "wordCount": 2224,
          "title": "Pluralistic: 03 May 2022",
          "imageUrl": null
        },
        {
          "id": "https://pluralistic.net/?p=3563",
          "author": "Cory Doctorow",
          "description": "Today's links Podcasting \"Revenge Of the Chickenized Reverse Centaurs\": The relationship between algorithms, interoperability and worker power. Hey look at this: Delights to delectate. This day in history: 2007, 2012, 2017 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Podcasting \"Revenge Of the Chickenized Reverse Centaurs\" (permalink) This week on my podcast, I read my Medium column, \"Revenge Of the Chickenized Reverse Centaurs,\" proposing a theory of the relationship between algorithms, interoperability and worker power (happy May Day!). https://onezero.medium.com/revenge-of-the-chickenized-reverse-centaurs-b2e8d5cda826 Let's break it down. Start with \"chickenization\": this is a labor economics term referring to industries that foll…",
          "link": "https://pluralistic.net/2022/05/02/reverse-centaurs/",
          "publishedOn": "2022-05-02T15:59:36.000Z",
          "wordCount": 2462,
          "title": "Pluralistic: 02 May 2022",
          "enclosure": {
            "url": "https://archive.org/download/Cory_Doctorow_Podcast_424/Cory_Doctorow_Podcast_424_-_Revenge_of_the_Chickenized_Reverse-Centaurs.mp3",
            "length": "0",
            "type": "audio/mpeg"
          },
          "imageUrl": null
        },
        {
          "id": "https://pluralistic.net/?p=3541",
          "author": "Cory Doctorow",
          "description": "Today's links Disney's writer wage theft, a year on: Still work to do. Hey look at this: Delights to delectate. This day in history: 2002, 2007, 2012, 2021 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Disney's writer wage theft, a year on (permalink) In November 2020, SFWA came forward with a stunning accusation: Disney had told the beloved writer Alan Dean Foster (author of the original, bestselling Star Wars novelization) that they would not ever pay him the royalties he was owed. https://pluralistic.net/2020/11/19/disneymustpay/#disneymustpay Disney argued that Foster's contract – where he was guaranteed wages for his creative labor on the Star Wars book, which was written before the film was complete and formed the basis for many…",
          "link": "https://pluralistic.net/2022/04/30/disney-still-must-pay/",
          "publishedOn": "2022-04-30T15:41:02.000Z",
          "wordCount": 2359,
          "title": "Pluralistic: 30 Apr 2022",
          "imageUrl": null
        },
        {
          "id": "https://pluralistic.net/?p=3537",
          "author": "Cory Doctorow",
          "description": "Today's links Killing online surveillance with contextual ads: For chrissakes, can we stop talking about who the product is? Hey look at this: Delights to delectate. This day in history: 2007, 2012, 2017, 2021 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Killing online surveillance with contextual ads (permalink) The internet has ushered in an era of unprecedented invasive surveillance. Commercial operators large and small spy on us in every way and sell and give away and leak our data to criminals, cops, spies, advertisers and stalkers. This isn't because you're not paying for \"the product,\" which makes you the product. Companies that can abuse you do. John Deere will sell you a $800,000 tractor and then lock you out of getting it f…",
          "link": "https://pluralistic.net/2022/04/29/taken-in-context/",
          "publishedOn": "2022-04-29T13:40:54.000Z",
          "wordCount": 1976,
          "title": "Pluralistic: 29 Apr 2022",
          "imageUrl": null
        },
        {
          "id": "https://pluralistic.net/?p=3532",
          "author": "Cory Doctorow",
          "description": "Today's links Renegotiate the web \"bargain\" by blocking all ads: The Adafruit ESPHole lets you say \"How about 'Nah?'\" Hey look at this: Delights to delectate. This day in history: 2002, 2007, 2012, 2017, 2021 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Renegotiate the web \"bargain\" by blocking all ads (permalink) Back in 2019, I wrote a case-study on ad- and tracker-blocking as part of EFF's series on adversarial interoperability (AKA \"competitive compatibility\" or comcom). My point was that the ad-tech industry says that it tracks you as part of a bargain: you trade away your privacy and get media in exchange, but that this was a bizarre kind of take-it-or-leave-it form of bargaining. https://www.eff.org/deeplinks/2019/07/adblockin…",
          "link": "https://pluralistic.net/2022/04/28/shut-yer-pi-hole/",
          "publishedOn": "2022-04-28T13:29:27.000Z",
          "wordCount": 1665,
          "title": "Pluralistic: 28 Apr 2022",
          "imageUrl": null
        },
        {
          "id": "https://pluralistic.net/?p=3525",
          "author": "Cory Doctorow",
          "description": "Today's links How police backdoors for online services let sextortionists target children: There is no such thing as a back-door that only lets the good guys through. Laura Jean McKay's \"The Animals in That Country\": A brilliant debut novel of too much understanding. Hey look at this: Delights to delectate. This day in history: 2002, 2012, 2017, 2021 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading How police backdoors for online services let sextortionists target children (permalink) An \"Emergency Data Request\" (EDR) is a warrantless demand by a police officer to a tech company, designed for white-hot emergencies when a cop needs an online service to cough up some of its user data to save a life or prevent a tragedy. Criminals love EDRs…",
          "link": "https://pluralistic.net/2022/04/27/im-a-backdoor-man/",
          "publishedOn": "2022-04-27T14:28:03.000Z",
          "wordCount": 2324,
          "title": "Pluralistic: 27 Apr 2022",
          "imageUrl": null
        },
        {
          "id": "https://pluralistic.net/?p=3516",
          "author": "Cory Doctorow",
          "description": "Today's links Bottled water monopolist admits recycling is bullshit: \"Personal responsibility\" and \"caveat emptor.\" This day in history: 2012, 2017 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Bottled water monopolist admits recycling is bullshit (permalink) \"Puffery\" is a funny word! It's the word that lawyers use when their clients are accused of unlawful speech acts, such as fraud or libel. In that context, \"puffery\" (or, even better, \"mere puffery\") is a synonym for bullshit. Recycling is puffery. Which is to say, recyling is bullshit. Plastics recycling has its origins in a \"puffery\" campaign. In 1973, Exxon researchers told the company that there was no feasible way to recycle plastics, and that there likely never would be. htt…",
          "link": "https://pluralistic.net/2022/04/26/plastic-fatalistic/",
          "publishedOn": "2022-04-26T14:38:52.000Z",
          "wordCount": 1933,
          "title": "Pluralistic: 26 Apr 2022",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "The Candybox Blog",
      "feedUrl": "http://www.nathalielawhead.com/candybox/feed",
      "siteUrl": "http://www.nathalielawhead.com/candybox",
      "articles": [
        {
          "id": "http://www.nathalielawhead.com/candybox/?p=5424",
          "author": "alienmelon",
          "description": "As you probably know from following me on either Mastodon or Twitter, I’ve been working hard on my next “game” (the appropriate label for it is still undecided)… built in UE5. This post is an excuse to share a bunch of screenshots! There have been points where I wasn’t sure if what I was making would even run on any other computer, but I tested it today on my work laptop… omg it runs! Smoothly too! When I started I didn’t completely understand performance, or settings, or all the fancy things Unreal lets you do with optimization… so it was...",
          "link": "http://www.nathalielawhead.com/candybox/bluesuburbia-progress-update-screenshots-of-what-im-working-on",
          "publishedOn": "2022-06-23T23:30:25.000Z",
          "wordCount": 2508,
          "title": "BlueSuburbia Progress Update (screenshots of what I’m working on)",
          "enclosure": {
            "url": "http://nathalielawhead.com/noodles/Screenshots_firstProgressPost/ruins1.mp4",
            "length": "69781873",
            "type": "video/mp4"
          },
          "imageUrl": "http://nathalielawhead.com/noodles/Screenshots_firstProgressPost/spaceskybox1.PNG"
        },
        {
          "id": "http://www.nathalielawhead.com/candybox/?p=5386",
          "author": "alienmelon",
          "description": "It has been about a full year since the Kotaku article that exploited my sexual assault, and exploited the other victims of my rapist, has been removed. A full year since I had to argue with journalists for my life, and trying to show them the extent of the harm this has caused. I am told that what I achieved was “unprecedented” (I hate that word). That articles don’t get removed without lawyers, this, that, or the other fancy thing only rich or powerful people have. Nevertheless, I don’t feel victorious. I feel burned out, abused, laughed at, and alienated....",
          "link": "http://www.nathalielawhead.com/candybox/abusing-you-was-by-the-book-documenting-two-years-of-abuse-from-game-journalism-after-sharing-my-metoo-the-whole-painful-story-all-in-one-place",
          "publishedOn": "2022-06-01T08:09:53.000Z",
          "wordCount": 8947,
          "title": "“Abusing you was by the book” (documenting two years of abuse from Game Journalism, after sharing my #metoo… the whole painful story all in one place)",
          "imageUrl": "http://nathalielawhead.com/candybox/new_theme_images/IMG_BACKGROUND.png"
        },
        {
          "id": "http://www.nathalielawhead.com/candybox/?p=5363",
          "author": "alienmelon",
          "description": "I’ve been meaning to write this post for some time, but held off to wait for The Lovely Estate to release a patch that would fix the walking issue. It’s fixed. This game is tremendous and you must give it a chance! Talking about this game here was important to me because it captures everything that I love about atmospheric games. It has a MOOD. – The Lovely Estate “You’re here to get someone. They’re here to breathe until they can’t anymore. Mind the fumes. Explore the secrets within these stained walls and find something before it finds you.” The...",
          "link": "http://www.nathalielawhead.com/candybox/liminalfeverdreams",
          "publishedOn": "2022-05-13T01:34:14.000Z",
          "wordCount": 4021,
          "title": "Liminal Fever Dreams & Rejecting the Player (the surrealist, strange, upsetting otherworlds of video games)",
          "imageUrl": "http://nathalielawhead.com/noodles/liminalfeaverdream/HauntedWhoISee%205_10_2022%204_06_28%20PM.png"
        },
        {
          "id": "http://www.nathalielawhead.com/candybox/?p=5357",
          "author": "alienmelon",
          "description": "I’m finally able to share some incredible news that deserves a blog post all on its own… “Everything is going to be OK” was accepted into the permanent collection in MoMA (New York)!!! I am honored to be able to announce that. It will be part of the Never Alone exhibit this September… Never Alone Video Games and Other Interactive Design Sep 10, 2022–summer 2023 “Everything is going to be OK” is a work that I’m probably most proud of. It has everything from me, poetry, animation, meaning… I’m honored that it has meant so much to so many people,...",
          "link": "http://www.nathalielawhead.com/candybox/everything-is-going-to-be-ok-is-in-the-collection-in-moma-also-tetrageddon-won-the-webby",
          "publishedOn": "2022-05-10T02:24:31.000Z",
          "wordCount": 1432,
          "title": "“Everything is going to be OK” is in THE collection in MoMA (also Tetrageddon won the Webby)",
          "imageUrl": "http://nathalielawhead.com/noodles/momannounce/BESTBONES3_SEXIEST_SKELETON_0.gif"
        },
        {
          "id": "http://www.nathalielawhead.com/candybox/?p=5346",
          "author": "alienmelon",
          "description": "“Photogrammetry is the science of making measurements from photographs. It infers the geometry of a scene from a set of unordered photographs or videos. Photography is the projection of a 3D scene onto a 2D plane, losing depth information. The goal of photogrammetry is to reverse this process.” – Meshroom github I’ve been doing a lot of 3D modeling lately and, because I’m new to it, I have also been experimenting with finding workflows that I might be comfortable in. For example a friend of mine models a lot in VR. She swears by it. Anyone I have asked has...",
          "link": "http://www.nathalielawhead.com/candybox/photogammetry-meshroom-and-blender-some-learning-resources-that-helped-me",
          "publishedOn": "2022-05-02T21:50:36.000Z",
          "wordCount": 1931,
          "title": "Photogammetry, Meshroom, and Blender (some learning resources that helped me)",
          "imageUrl": "http://nathalielawhead.com/noodles/BS01_FACE1.png"
        }
      ]
    }
  ],
  "cliVersion": "1.15.1"
}