{
  "sources": [
    {
      "title": "Christian Heilmann",
      "feedUrl": "https://christianheilmann.com/feed/",
      "siteUrl": "https://christianheilmann.com",
      "articles": [
        {
          "id": "https://christianheilmann.com/?p=7045",
          "author": "Chris Heilmann",
          "description": "Testing for accessibility is an incredibly important part of your development process. Products that don’t block out users because of easy to avoid issues have more success. And the longer you wait with fixing accessibility problems, the harder it gets. That’s why it is annoying when it is hard to find out about accessibility problems. […]",
          "link": "https://christianheilmann.com/2021/11/18/lets-not-send-developers-to-the-accessibility-tree-tool/",
          "publishedOn": "2021-11-18T17:14:58.000Z",
          "wordCount": 801,
          "title": "Let’s not send developers to the accessibility tree tool"
        },
        {
          "id": "https://christianheilmann.com/?p=7038",
          "author": "Chris Heilmann",
          "description": "Interfaces on the web have to be accessible independent of input device. In addition to using the right HTML to make it possible to activate functionality with mouse, keyboard, voice activation or any of the possible ways it is also important to have a visual indicator which element is currently active. This is why we […]",
          "link": "https://christianheilmann.com/2021/11/07/quick-browser-developer-tools-tip-define-and-test-interaction-states-in-css-using-state-simulation/",
          "publishedOn": "2021-11-07T15:58:36.000Z",
          "wordCount": 389,
          "title": "Quick browser Developer Tools tip: define and test interaction states in CSS using state simulation"
        },
        {
          "id": "https://christianheilmann.com/?p=6999",
          "author": "Chris Heilmann",
          "description": "This is a talk that I’ve given at CityJS this September. I am a principal product manager for developer tools in Microsoft Edge and these are things I encountered during working on the tools, documenting them and going through user feedback. You can watch the recording of the talk on Youtube . Here’s a write-up […]",
          "link": "https://christianheilmann.com/2021/11/01/developer-tools-secrets-that-shouldnt-be-secrets/",
          "publishedOn": "2021-11-01T14:21:08.000Z",
          "wordCount": 2400,
          "title": "Developer Tools secrets that shouldn’t be secrets",
          "enclosure": {
            "url": "https://christianheilmann.com/wp-content/uploads/2021/10/log-vs-live-expression-smaller.mp4",
            "length": "2040538",
            "type": "video/mp4"
          }
        },
        {
          "id": "https://christianheilmann.com/?p=6988",
          "author": "Chris Heilmann",
          "description": "The 1.4.0 release of the Microsoft Tools for Visual Studio Code brings a few highly requested features. We improved the screencasting feature, added device emulation and live issue reporting in your source code. You can check the 3 minute highlight reel here . Improved screencasting In previous versions of the extension, the screencast was a […]",
          "link": "https://christianheilmann.com/2021/10/28/edge-devtools-for-visual-studio-code-1-4-0-improved-screencasting-device-emulation-and-live-inline-issue-reporting/",
          "publishedOn": "2021-10-28T06:02:36.000Z",
          "wordCount": 566,
          "title": "Edge DevTools for Visual Studio Code 1.4.0 – Improved Screencasting, Device Emulation and live, inline issue reporting"
        },
        {
          "id": "https://christianheilmann.com/?p=6972",
          "author": "Chris Heilmann",
          "description": "Starting with the next version of Microsoft Edge, we are running an experiment that allows you to use Visual Studio Code as the editor of the in-browser Developer Tools. Here’s a three minute video explaining why we think this is a good idea. Developer Tools have excellent visual tools that allow you to tweak and […]",
          "link": "https://christianheilmann.com/2021/10/12/what-if-you-could-use-visual-studio-code-as-the-editor-of-in-browser-developer-tools/",
          "publishedOn": "2021-10-12T15:21:15.000Z",
          "wordCount": 575,
          "title": "What if… you could use Visual Studio Code as the editor of in-browser Developer Tools?"
        }
      ]
    },
    {
      "title": "Hundred Rabbits",
      "feedUrl": "https://100r.co/links/rss.xml",
      "siteUrl": "https://100r.co",
      "articles": [
        {
          "id": "log.html#oct2021",
          "author": "Rekka Bellum",
          "description": "Hey everyone! This is the list of all the changes we've done to our projects and apps during the month of October. We'll also be reporting in our on position in the world, and on our future plans.\nSummary Of Changes\ndonsol, ported our Famicom(6502) code to Varvara(uxn).\nuxn, wrote a reference guide and created a list of community projects.\nnoodle, added guides for the line and rectangle tool and updated shortcuts in the documentation.\ngrimgrains, optimized images and published a Chunky Apple Jam recipe.\n100r, optimized images (see Rek's notes). Added new pages: boom tent, grinder and small space.\nleft, optimized code.\nnasu, fixed crashing bug with large selections.\nNews\nThis month, we found a used grain mill for Pino! Flour doesn't keep as well as whole grains, so we decided to start milling flour (wheat berries, soy beans or chickpeas) only as we need it. We only released a Guide to Lacto-fermenting vegetables on grimgrains.\nDonsol is now available as an uxn rom on itchio.\nSee Devine's daily drawings series for October.\nPino book club\nWe're continuing our readings of The Stories of Ray Bradbury by Ray Bradbury. Favorite shorts this month include The Long Rain, The City and Kaleidoscope.\nPino's location: 48° 42.230'N, 123° 36.900'W\nContinue Reading",
          "link": "https://100r.co/site/log.html#oct2021",
          "publishedOn": "2021-11-03T00:00:00.000Z",
          "wordCount": 6084,
          "title": "Summary of changes for October"
        },
        {
          "id": "log.html#sep2021",
          "author": "Rekka Bellum",
          "description": "Hey everyone! This is the list of all the changes we've done to our projects and apps during the month of September. We'll also be reporting in our on position in the world, and on our future plans.\nSummary Of Changes\nOrca, added way for instances of Orca to talk to each other.\nCalc, wrote a little graphical calculator to help with learning binary and hexadecimal.\nDexe, added option to copy the textual value of a selection.\nUxn, updated UxnDS emulator.\nWiktopher, added Chapter 16: The Big Dark.\n100R, added new pages: Western Canada, alcohol stove, decorations and shore power cord repair. The site also has a new splash.\nNews\nIt is an early announcement, but end of June 2022 we will be giving a keynote presentation, alongside Khyam Allami, at NIME(New Interfaces for Musical Expression).\nRekka wrote an article on Saving Energy When Cooking Aboard for Noonsite.\nCheck out Eli's guide on installing Uxn on OS X, and Keijiro's version of Flappy Bird in UxnTal.\nOur friends at Compudanzas have released part 6 of their Introduction to Uxn Programming tutorial. This new chapter basically shows you how to build Pong!\nPino book club\nWe started reading The Stories of Ray Bradbury by Ray Bradbury. Favorite shorts so far include There Will Come Soft Rains, The Coffin and There Was an Old Woman.\nPino's location: 48° 42.230'N, 123° 36.900'W\nContinue Reading",
          "link": "https://100r.co/site/log.html#sep2021",
          "publishedOn": "2021-10-03T00:00:00.000Z",
          "wordCount": 5918,
          "title": "Summary of changes for September"
        },
        {
          "id": "shore_power_cord_repair.html",
          "author": "Rekka Bellum",
          "description": "On a rainy summer day, we pulled into Silva bay on Gabriola Island and found a place at a dock to wait out a spell of bad weather. The power receptacle appeared fine, but once we were ready to leave we found the male connection of our shore power cord had melted. Two out of three prongs were stuck in the receptacle. We've never had issues with our cord before, and for now we assume that the marina shore connection was faulty. Either way, we had to repair the power cord.\nWe always prefer to repair than to replace, so when we returned to a place with a marine store, we got ourselves replacements connections, both male and female, to replace the two damaged ends.\nWe thought we'd document the process of fixing a shower power cord. Although, this is only specific to Marinco marine fittings.\nIn …",
          "link": "https://100r.co/site/shore_power_cord_repair.html",
          "publishedOn": "2021-09-29T00:00:00.000Z",
          "wordCount": 606,
          "title": "Repairing our shore power cord"
        }
      ]
    },
    {
      "title": "Blog on SaraSoueidan.com",
      "feedUrl": "https://www.sarasoueidan.com/blog/index.xml",
      "siteUrl": "https://sarasoueidan.com/blog/",
      "articles": [
        {
          "id": "https://sarasoueidan.com/blog/prefers-color-scheme-browser-vs-os/",
          "author": null,
          "description": "I spent some time in Reeder app this morning, catching up with RSS and the latest articles published by my favorite blogs.\nI was reading Scott O’Hara’s article about using JavaScript to detect high contrast and dark modes, which includes a small, very useful script to do exactly what the title says. The output of that script at first looked like it was a “false positive”. But some further investigation led me to learn something new about the prefers-color-scheme CSS user query.\n\nScott’s article includes a Codepen to demonstrate the output of the script. The script will check and detect if you currently have high contrast mode or dark mode enabled, and will output the result of the check.\nSee the Pen \n  JavaScript to detect media queries by Scott (@scottohara)\n  on CodePen.\n\n\nSince JavaScri…",
          "link": "https://sarasoueidan.com/blog/prefers-color-scheme-browser-vs-os/",
          "publishedOn": "2021-10-03T00:00:00.000Z",
          "wordCount": 798,
          "title": "The CSS prefers-color-scheme user query and order of preference"
        }
      ]
    },
    {
      "title": "there.oughta.be/",
      "feedUrl": "https://there.oughta.be/feed.xml",
      "siteUrl": "https://there.oughta.be/",
      "articles": []
    },
    {
      "title": "Grumpy Gamer",
      "feedUrl": "https://grumpygamer.com/rss",
      "siteUrl": "https://grumpygamer.com",
      "articles": [
        {
          "id": "https://grumpygamer.com/make_your_own_game_engine",
          "author": null,
          "description": "At first I was going to just copy/paste his article and call it my own then I realized that is kind of a dick move.\nHow to make your own game engine (and why) by Tyler Glaiel\nWell worth a read.\nIn my 35+ year career in games I've never used an off the shelf game engine.  Starting with SCUMM I've always build my own.  I love the power and the freedom.  It's hard work and probably cost me more but I love making game engines and writing compilers.  It's a skill you slowly acquire and after the 5th one it's not a daunting task anymore.\nI ran into a programmer at an indie meet-up and she told me this story about how another programmer at her company brought up building their own game engine.  Someone responded with \"What! Are you Ron Gilbert!\"\nI wear that as a badge of honor.  😀",
          "link": "https://grumpygamer.com/make_your_own_game_engine",
          "publishedOn": "2021-11-12T00:00:00.000Z",
          "wordCount": 299,
          "title": "How to make your own game engine"
        },
        {
          "id": "https://grumpygamer.com/dystopia",
          "author": null,
          "description": "Yes, I'm tired of dystopia fiction. A sentiment I probably didn't need to repeat because it's in the title, but I really am.  Nothing points this out more to me than Star Trek.\nIn a Star Trek vs. Star Wars internet argument I am firmly in the Star Trek camp and this is with eight years of working at The Death Star Lucasfilm (I kid, working at Lucasfilm was magical but I'm still a Star Trek person).\nStar Trek used be be about hope.  Even in the dark days of the 1960's cold war you could see hope for our future in Star Trek. They mange to comment on our then messed up world while being optimistic about the future. It's a lesson current Star Trek could learn from.\nNext Generation followed in that tradition. There was conflict but also hope in what the future could be.\nVoyager was still about …",
          "link": "https://grumpygamer.com/dystopia",
          "publishedOn": "2021-11-11T00:00:00.000Z",
          "wordCount": 2807,
          "title": "I'm tired of dystopia fiction"
        },
        {
          "id": "https://grumpygamer.com/twitter_part2",
          "author": null,
          "description": "I've decided to go back on Twitter but with a few changes:\nI unfollowed everyone. \nI will only post once (or maybe twice) a week.\nI only check twitter once every 1 or 2 days.\nI will only post positive things and mostly about game dev.\nI will not add rubbish to the Twitter dumpster fire.\nI used to follow 200+ people and now I follow 0. I apologize if I unfollowed you. It doesn't mean I love you any less. I might follow people at some point, but only friendly positive people.\nI left Twitter because it was doing serious mental damage to me. \nMaybe, just maybe this will help make twitter a better place.",
          "link": "https://grumpygamer.com/twitter_part2",
          "publishedOn": "2021-11-10T00:00:00.000Z",
          "wordCount": 1102,
          "title": "Twitter"
        },
        {
          "id": "https://grumpygamer.com/scummvm_20",
          "author": null,
          "description": "I wrote Scumm and I don't think I could do what they did.\nRespect.\nHappy Birthday ScummVM",
          "link": "https://grumpygamer.com/scummvm_20",
          "publishedOn": "2021-10-10T00:00:00.000Z",
          "wordCount": 235,
          "title": "Happy Birthday ScummVM"
        },
        {
          "id": "https://grumpygamer.com/favorite_puzzle",
          "author": null,
          "description": "Chatting with a game designer friend the other day and we were bemoaning the state of adventure game puzzles and it got us talking.  So I was wondering what is your favorite puzzle in Thimbleweed Park, Maniac Mansion, Monkey Island or any other classic point-and-click game?\nDo you like head scratchers?  What makes a puzzle good? What makes a puzzle hard? What makes a puzzle just busy work? Is that bad?",
          "link": "https://grumpygamer.com/favorite_puzzle",
          "publishedOn": "2021-10-08T00:00:00.000Z",
          "wordCount": 5122,
          "title": "Favorite Puzzle"
        }
      ]
    },
    {
      "title": "Emily Short's Interactive Storytelling",
      "feedUrl": "https://emshort.blog/feed/",
      "siteUrl": "https://emshort.blog",
      "articles": [
        {
          "id": "http://emshort.blog/?p=42234",
          "author": "Emily Short",
          "description": "Events IF Comp judging ends today — you may have a few hours left to register your opinions, if you wish — and results will be available soon. Today also marks the beginning of fos1’s jam for TADS games, which will run through early 2022. This is intended to invite more authors to try out … Continue reading \"Mid-November Link Assortment\"",
          "link": "https://emshort.blog/2021/11/15/mid-november-link-assortment-6/",
          "publishedOn": "2021-11-15T17:30:00.000Z",
          "wordCount": 1545,
          "title": "Mid-November Link Assortment"
        },
        {
          "id": "http://emshort.blog/?p=42232",
          "author": "Emily Short",
          "description": "Events IF Comp games are currently available to play and judge. Anyone can participate in judging — so if you want to be part of that, check out the website for instructions. The judging period runs through November 15. November 6 is the next meetup of the San Francisco Bay Area IF Group. Starting November … Continue reading \"End of October Link Assortment\"",
          "link": "https://emshort.blog/2021/10/31/end-of-october-link-assortment-6/",
          "publishedOn": "2021-10-31T17:30:00.000Z",
          "wordCount": 1658,
          "title": "End of October Link Assortment"
        },
        {
          "id": "http://emshort.blog/?p=42229",
          "author": "Emily Short",
          "description": "Events Roguelike Celebration runs online October 16-17, and is often a great place to pick up some talks on procedural generation of various kinds. October 18, at 2-4 PM Eastern time, Zack Whalen is running an online workshop on creating your own generative novel, in preparation for NaNoGenMo month. October 22 is usually the deadline … Continue reading \"Mid-October Link Assortment\"",
          "link": "https://emshort.blog/2021/10/15/mid-october-link-assortment-7/",
          "publishedOn": "2021-10-15T17:30:00.000Z",
          "wordCount": 1809,
          "title": "Mid-October Link Assortment"
        },
        {
          "id": "http://emshort.blog/?p=42081",
          "author": "Emily Short",
          "description": "Today’s question, gathered from Twitter a little while back, is this: How do you go from the macro to the micro, i.e. from a big, broad idea for a game to the concrete instantiation of it? A long time ago I wrote Idea to Implementation, a discussion of how to get from implementation to completed … Continue reading \"Mailbag: Macro to Micro Ideas\"",
          "link": "https://emshort.blog/2021/10/05/mailbag-macro-to-micro-ideas/",
          "publishedOn": "2021-10-05T17:22:00.000Z",
          "wordCount": 3882,
          "title": "Mailbag: Macro to Micro Ideas"
        },
        {
          "id": "http://emshort.blog/?p=42219",
          "author": "Emily Short",
          "description": "Events Tomorrow, October 1, IF Comp games will be available to play and judge. Anyone can participate in judging — so if you want to be part of that, check out the website for instructions. The judging period runs through November 15. October 2 is the next meetup of the San Francisco Bay Area IF … Continue reading \"End of September Link Assortment\"",
          "link": "https://emshort.blog/2021/09/30/end-of-september-link-assortment-6/",
          "publishedOn": "2021-09-30T17:30:00.000Z",
          "wordCount": 2011,
          "title": "End of September Link Assortment"
        }
      ]
    },
    {
      "title": "xkcd.com",
      "feedUrl": "https://xkcd.com/atom.xml",
      "siteUrl": "https://xkcd.com/",
      "articles": [
        {
          "id": "https://xkcd.com/2543/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/never_told_anyone.png\" title=\"Even if you said you were an employee of the website, if you asked for my password, I'd tell you.\" alt=\"Even if you said you were an employee of the website, if you asked for my password, I'd tell you.\" />",
          "link": "https://xkcd.com/2543/",
          "publishedOn": "2021-11-17T00:00:00.000Z",
          "wordCount": 187,
          "title": "Never Told Anyone"
        },
        {
          "id": "https://xkcd.com/2542/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/daylight_calendar.png\" title=\"Could be worse. In some towns north of here, it's already December, and the 21st will last for nearly a week.\" alt=\"Could be worse. In some towns north of here, it's already December, and the 21st will last for nearly a week.\" />",
          "link": "https://xkcd.com/2542/",
          "publishedOn": "2021-11-15T00:00:00.000Z",
          "wordCount": 185,
          "title": "Daylight Calendar"
        },
        {
          "id": "https://xkcd.com/2541/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/occam.png\" title=\"Oh no, Murphy just picked up the razor.\" alt=\"Oh no, Murphy just picked up the razor.\" />",
          "link": "https://xkcd.com/2541/",
          "publishedOn": "2021-11-12T00:00:00.000Z",
          "wordCount": 183,
          "title": "Occam"
        },
        {
          "id": "https://xkcd.com/2540/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/ttsltswbd.png\" title=\"Tomorrow's sessions will be entirely devoted to sewing machine rotary hooks.\" alt=\"Tomorrow's sessions will be entirely devoted to sewing machine rotary hooks.\" />",
          "link": "https://xkcd.com/2540/",
          "publishedOn": "2021-11-10T00:00:00.000Z",
          "wordCount": 183,
          "title": "TTSLTSWBD"
        },
        {
          "id": "https://xkcd.com/2539/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/flinch.png\" title=\"Premed: &quot;Does this count for a physics credit? Can we shorten the string so I can get it done faster? And can we do one where it hits me in the face? I gotta do a thing for first aid training right after.&quot;\" alt=\"Premed: &quot;Does this count for a physics credit? Can we shorten the string so I can get it done faster? And can we do one where it hits me in the face? I gotta do a thing for first aid training right after.&quot;\" />",
          "link": "https://xkcd.com/2539/",
          "publishedOn": "2021-11-08T00:00:00.000Z",
          "wordCount": 183,
          "title": "Flinch"
        },
        {
          "id": "https://xkcd.com/2538/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/snack.png\" title=\"Although grad students, suddenly reminded that food exists, tend to just grab and devour both without further discussion.\" alt=\"Although grad students, suddenly reminded that food exists, tend to just grab and devour both without further discussion.\" />",
          "link": "https://xkcd.com/2538/",
          "publishedOn": "2021-11-05T00:00:00.000Z",
          "wordCount": 183,
          "title": "Snack"
        },
        {
          "id": "https://xkcd.com/2537/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/painbow_award.png\" title=\"This year, our team took home the dark blue ribbon, better than the midnight blue we got last year but still short of the winning navy blue.\" alt=\"This year, our team took home the dark blue ribbon, better than the midnight blue we got last year but still short of the winning navy blue.\" />",
          "link": "https://xkcd.com/2537/",
          "publishedOn": "2021-11-03T00:00:00.000Z",
          "wordCount": 185,
          "title": "Painbow Award"
        },
        {
          "id": "https://xkcd.com/2536/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/wirecutter.png\" title=\"This was always going to be a controversial Wirecutter post, but what really got them in trouble were their 'budget' and 'upgrade' picks.\" alt=\"This was always going to be a controversial Wirecutter post, but what really got them in trouble were their 'budget' and 'upgrade' picks.\" />",
          "link": "https://xkcd.com/2536/",
          "publishedOn": "2021-11-01T00:00:00.000Z",
          "wordCount": 183,
          "title": "Wirecutter"
        },
        {
          "id": "https://xkcd.com/2535/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/common_cold_viruses.png\" title=\"&quot;It's not an influenza, but the onset has notes of the '09 H1N1 strain.&quot; &quot;Ah yes, that was a good year for H1N1.&quot;\" alt=\"&quot;It's not an influenza, but the onset has notes of the '09 H1N1 strain.&quot; &quot;Ah yes, that was a good year for H1N1.&quot;\" />",
          "link": "https://xkcd.com/2535/",
          "publishedOn": "2021-10-29T00:00:00.000Z",
          "wordCount": 187,
          "title": "Common Cold Viruses"
        },
        {
          "id": "https://xkcd.com/2534/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/retractable_rocket.png\" title=\"Hard to believe that for so many years once they were fully extended we just let them tip over.\" alt=\"Hard to believe that for so many years once they were fully extended we just let them tip over.\" />",
          "link": "https://xkcd.com/2534/",
          "publishedOn": "2021-10-27T00:00:00.000Z",
          "wordCount": 185,
          "title": "Retractable Rocket"
        },
        {
          "id": "https://xkcd.com/2533/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/slope_hypothesis_testing.png\" title=\"&quot;What? I can't hear--&quot; &quot;What? I said, are you sure--&quot; &quot;CAN YOU PLEASE SPEAK--&quot;\" alt=\"&quot;What? I can't hear--&quot; &quot;What? I said, are you sure--&quot; &quot;CAN YOU PLEASE SPEAK--&quot;\" />",
          "link": "https://xkcd.com/2533/",
          "publishedOn": "2021-10-25T00:00:00.000Z",
          "wordCount": 187,
          "title": "Slope Hypothesis Testing"
        },
        {
          "id": "https://xkcd.com/2532/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/censored_vaccine_card.png\" title=\"CVS's pharmacies are fine, but I much prefer their [censored]s.\" alt=\"CVS's pharmacies are fine, but I much prefer their [censored]s.\" />",
          "link": "https://xkcd.com/2532/",
          "publishedOn": "2021-10-22T00:00:00.000Z",
          "wordCount": 187,
          "title": "Censored Vaccine Card"
        },
        {
          "id": "https://xkcd.com/2531/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/dark_arts.png\" title=\"You think, 'okay, THIS is an ideal use case for hardlinks!' but then 6 months later you're doing some extremely cursed Google search like 'javascript ext4' and wondering where things went wrong.\" alt=\"You think, 'okay, THIS is an ideal use case for hardlinks!' but then 6 months later you're doing some extremely cursed Google search like 'javascript ext4' and wondering where things went wrong.\" />",
          "link": "https://xkcd.com/2531/",
          "publishedOn": "2021-10-20T00:00:00.000Z",
          "wordCount": 185,
          "title": "Dark Arts"
        },
        {
          "id": "https://xkcd.com/2530/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/clinical_trials.png\" title=\"We don't need to do a clinical trial of this change because the standard of care is to adopt new ideas without doing clinical trials.\" alt=\"We don't need to do a clinical trial of this change because the standard of care is to adopt new ideas without doing clinical trials.\" />",
          "link": "https://xkcd.com/2530/",
          "publishedOn": "2021-10-18T00:00:00.000Z",
          "wordCount": 185,
          "title": "Clinical Trials"
        },
        {
          "id": "https://xkcd.com/2529/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/unsolved_math_problems.png\" title=\"After decades of studying the curve and the procedure that generates it, the consensus explanation is &quot;it's just like that.&quot;\" alt=\"After decades of studying the curve and the procedure that generates it, the consensus explanation is &quot;it's just like that.&quot;\" />",
          "link": "https://xkcd.com/2529/",
          "publishedOn": "2021-10-15T00:00:00.000Z",
          "wordCount": 187,
          "title": "Unsolved Math Problems"
        },
        {
          "id": "https://xkcd.com/2528/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/flag_map_sabotage.png\" title=\"Delaware hopes to explore the western edge of areas marked with the Belgian flag, once the tornadoes die down.\" alt=\"Delaware hopes to explore the western edge of areas marked with the Belgian flag, once the tornadoes die down.\" />",
          "link": "https://xkcd.com/2528/",
          "publishedOn": "2021-10-13T00:00:00.000Z",
          "wordCount": 187,
          "title": "Flag Map Sabotage"
        },
        {
          "id": "https://xkcd.com/2527/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/new_nobel_prizes.png\" title=\"They've endowed a separate prize in Physiology or Medicine or Stopping Dr. Adams.\" alt=\"They've endowed a separate prize in Physiology or Medicine or Stopping Dr. Adams.\" />",
          "link": "https://xkcd.com/2527/",
          "publishedOn": "2021-10-11T00:00:00.000Z",
          "wordCount": 187,
          "title": "New Nobel Prizes"
        },
        {
          "id": "https://xkcd.com/2526/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/tsp_vs_tbsp.png\" title=\"It's like one teraspoon / when all you need is a kilonife\" alt=\"It's like one teraspoon / when all you need is a kilonife\" />",
          "link": "https://xkcd.com/2526/",
          "publishedOn": "2021-10-08T00:00:00.000Z",
          "wordCount": 187,
          "title": "TSP vs TBSP"
        },
        {
          "id": "https://xkcd.com/2525/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/air_travel_packing_list.png\" title=\"I know the etiquette is controversial, but I think it's rude when the person in front of me reclines their seat into the bell of my trumpet.\" alt=\"I know the etiquette is controversial, but I think it's rude when the person in front of me reclines their seat into the bell of my trumpet.\" />",
          "link": "https://xkcd.com/2525/",
          "publishedOn": "2021-10-06T00:00:00.000Z",
          "wordCount": 189,
          "title": "Air Travel Packing List"
        },
        {
          "id": "https://xkcd.com/2524/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/comet_visitor.png\" title=\"It's a myth that the Great Wall of China is the only human-made structure visible from space--there are LOTS of structures for us to feel self-conscious about!\" alt=\"It's a myth that the Great Wall of China is the only human-made structure visible from space--there are LOTS of structures for us to feel self-conscious about!\" />",
          "link": "https://xkcd.com/2524/",
          "publishedOn": "2021-10-04T00:00:00.000Z",
          "wordCount": 185,
          "title": "Comet Visitor"
        },
        {
          "id": "https://xkcd.com/2523/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/endangered.png\" title=\"The list includes polio, Guinea worm, and this one particular enterovirus strain that they've been tracking out of spite after it went around the lab a few years ago.\" alt=\"The list includes polio, Guinea worm, and this one particular enterovirus strain that they've been tracking out of spite after it went around the lab a few years ago.\" />",
          "link": "https://xkcd.com/2523/",
          "publishedOn": "2021-10-01T00:00:00.000Z",
          "wordCount": 183,
          "title": "Endangered"
        },
        {
          "id": "https://xkcd.com/2522/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/two_factor_security_key.png\" title=\"The bruises on my fingertips are my proof of work.\" alt=\"The bruises on my fingertips are my proof of work.\" />",
          "link": "https://xkcd.com/2522/",
          "publishedOn": "2021-09-29T00:00:00.000Z",
          "wordCount": 187,
          "title": "Two-Factor Security Key"
        },
        {
          "id": "https://xkcd.com/2521/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/toothpaste.png\" title=\"&quot;9 out of 10 dentists have banned me from their offices.&quot;\" alt=\"&quot;9 out of 10 dentists have banned me from their offices.&quot;\" />",
          "link": "https://xkcd.com/2521/",
          "publishedOn": "2021-09-27T00:00:00.000Z",
          "wordCount": 183,
          "title": "Toothpaste"
        },
        {
          "id": "https://xkcd.com/2520/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/symbols.png\" title=\"&quot;röntgen&quot; and &quot;rem&quot; are 20th-century physics terms that mean &quot;no trespassing.&quot;\" alt=\"&quot;röntgen&quot; and &quot;rem&quot; are 20th-century physics terms that mean &quot;no trespassing.&quot;\" />",
          "link": "https://xkcd.com/2520/",
          "publishedOn": "2021-09-24T00:00:00.000Z",
          "wordCount": 183,
          "title": "Symbols"
        },
        {
          "id": "https://xkcd.com/2519/",
          "author": null,
          "description": "<img src=\"https://imgs.xkcd.com/comics/sloped_border.png\" title=\"&quot;The slope will be 74° at ground level.&quot; &quot;Okay, I think we can hack together a  ... wait, why did they specify ground level? It's 74° everywhere, right? ... Oh no, there's a whole section in the treaty labeled 'curvature.'&quot;\" alt=\"&quot;The slope will be 74° at ground level.&quot; &quot;Okay, I think we can hack together a  ... wait, why did they specify ground level? It's 74° everywhere, right? ... Oh no, there's a whole section in the treaty labeled 'curvature.'&quot;\" />",
          "link": "https://xkcd.com/2519/",
          "publishedOn": "2021-09-22T00:00:00.000Z",
          "wordCount": 185,
          "title": "Sloped Border"
        }
      ]
    },
    {
      "title": "remy sharp's b:log",
      "feedUrl": "https://remysharp.com/feed.xml",
      "siteUrl": "https://remysharp.com",
      "articles": [
        {
          "id": "2021-11-11-0ad5612e",
          "author": null,
          "description": "I think this might be one of the first balanced or non-invested reads of what \"Web3\" means and Sloan's opening notes really resonate:\n\nIt’s for kids. I mean that in a good way! I think Web3 has resonated powerfully with young people because it feels like something genuinely new, and it feels like it can be theirs. Who could argue with those feelings? Not me.\n\nThe notes go on and I come away with the same general sense that I've had so far of the crowd cheering on for Web3: it's about making money. Which is fine, the world runs on capitalism for the most part, it's just not entirely for me.\nAnd I think that's the rub, the stories I know of the creation and the spread of the web (and indeed the internet) came from those wanting to share and do good. The stories I've read were never about making money but instead creating a place for others.\nI will concede that I don't tend to read the \"got rich by selling X web start up\" - but it's that start in the web that's what drives me, and what I love about the web. It's what I love about the Open Web.\nWeb Zero if you will. It was about sharing, community, learning and finding a place in the world.\nSource: society.robinsloan.com",
          "link": "https://remysharp.com/links/2021-11-11-0ad5612e",
          "publishedOn": "2021-11-11T19:39:57.000Z",
          "wordCount": 376,
          "title": "Notes on Web3 by Robin Sloan [link]"
        },
        {
          "id": "what-i-did-last-pandemic",
          "author": null,
          "description": "As the pandemic, or at least it's social effects, start to wind down (or certainly in the UK… or in Brighton 🤷‍♀), I thought it would be wise (for me) to write down what I got up to. I'd love to read any of your accounts too … if you even want to remember!",
          "link": "https://remysharp.com/2021/11/05/what-i-did-last-pandemic",
          "publishedOn": "2021-11-05T00:00:00.000Z",
          "wordCount": 952,
          "title": "What I did last pandemic [blog]"
        },
        {
          "id": "midi-controller-to-ps2-part-2",
          "author": null,
          "description": "In part 1 I explained how I took (mostly) off the shelf breakout boards and wired them up to talk to the Spectrum Next so I could use a MIDI controller attached to the PS/2 port (the external keyboard) to play music on the Spectrum Next's DAW software: NextDAW.\nHowever, I wanted to make it tidier and cheaper (to a potential user) which I alluded to at the end of the part 1 post.\nI did just that, and produced 30 custom PCBs with a custom 3D printed housing which have all been sold and sent to people across the globe, including the UK, Germany, Sweden, Netherlands, Brazil and Japan.",
          "link": "https://remysharp.com/2021/10/31/midi-controller-to-ps2-part-2",
          "publishedOn": "2021-10-31T09:00:00.000Z",
          "wordCount": 1551,
          "title": "MIDI controller to PS/2 - part 2 [blog]"
        },
        {
          "id": "the-hitchhikers-guide-to-the-galaxy-hitchhikers-guide-to-the-galaxy-1",
          "author": null,
          "description": "My kind of silly.\nI'd known the story for many years, but didn't realise it was written in the 70s (or \"nearly 80s\"). My best knowledge of it was the movie with Martin Freeman in 2005 … which, didn't quite live up to my expectation round the hype.\nThe book I found to be better (than the film - sorry purists - I know I shouldn't compare!), though I couldn't stop hearing Alan Rickman's voice as Marvin.\nI did sort of feel like nothing actually happened in the book. It was an adventure, but I think I missed the character arcs - or… I wasn't sure where to look!\nOverall, good, funny and properly silly.",
          "link": "https://remysharp.com/books/2021/the-hitchhikers-guide-to-the-galaxy-hitchhikers-guide-to-the-galaxy-1",
          "publishedOn": "2021-10-31T00:00:00.000Z",
          "wordCount": 287,
          "title": "The Hitchhiker's Guide to the Galaxy (Hitchhiker's Guide to the Galaxy, #1) [book]"
        },
        {
          "id": "2021-10-27-568af69b",
          "author": null,
          "description": "I hadn't realised that Medium had made JavaScript a requirement to be able to read any Medium post - I'd had JS disabled for ages on Medium just because of all the extra cruft they added.\nBut now, without JS, you only get the first few lines of content, and the rest is loaded entirely with JS - which… is stupid.\nScribe fixes all that and focuses entirely on the author's content.\nI also used the FAQ to auto redirect and now I can read the full content without being distracted by Medium's horrid cruft.\nGreat example of taking back the web.\nSource: scribe.rip",
          "link": "https://remysharp.com/links/2021-10-27-568af69b",
          "publishedOn": "2021-10-27T17:26:35.000Z",
          "wordCount": 257,
          "title": "Scribe - An alternative frontend to Medium [link]"
        },
        {
          "id": "2021-10-13-b8820d28",
          "author": null,
          "description": "The Egghead screencasts themselves are excellent, but this is a treasure trove of tips for better screencasts.\nBetter screencasts often (to me) means simpler for your audience or student to follow along - which is only positive.\nSource: howtoegghead.com",
          "link": "https://remysharp.com/links/2021-10-13-b8820d28",
          "publishedOn": "2021-10-13T12:14:06.000Z",
          "wordCount": 190,
          "title": "Screencasting technical guide by Egghead [link]"
        }
      ]
    },
    {
      "title": "Writing - rachelbythebay",
      "feedUrl": "https://rachelbythebay.com/w/atom.xml",
      "siteUrl": "https://rachelbythebay.com/w/",
      "articles": [
        {
          "id": "https://rachelbythebay.com/w/2021/11/08/hardware/",
          "author": null,
          "description": "In writing about my dumb little \"mailserv\" project this past weekend, I \npurposely avoided mentioning some of the parameters lest they distract \nfrom the message I was trying to convey.  My attempted message was \nsomething along the lines of \"everyone starts somewhere, ignorance is \nthe default state until changed, and look at some of the shit I have \ninflicted upon the world as proof\".\n\n\nIn the case of the mailserv project, that is, the thing that did what \nwe'd call \"greylisting\" today, it ran on an auxiliary box that itself \nonly existed because of yet another terrible hack involving a second T1 \nand the systemic inability to run BGP properly.  I've talked about the \nfiner points of that before, and it's not really on topic here.  But, \nkeep in mind that it meant from 1997 forward, I had a machine running \nSquid just so we could push some web traffic out this secondary \n(fractional) T1 to take the load off the main circuit.\n\n\nIt was relatively cheap shit, and it had no special \"server\" features.\n\n\n\n\n\nThat's a Pentium 150 with 128 megabytes of memory, a (PATA!) IDE hard \ndrive with just 1.6 GB of space, a 10 Mbps Ethernet card, plus a video \ncard, CD-ROM drive and Sound Blaster that meant nothing, because it was \na server.  (The SB16, incidentally, proves this was intended to be a \nclassroom box running Kid Pix for some elementary school students.)\n\n\nAll of this in 128 MB of memory and a gig and a half of disk space.\n\n\nInstrumenting things to find slow points and trying to do something \nabout it made for a bunch of little changes over the year or two that \nthis spam filtering service existed.  Everything was driven by actual \nneeds and a distinct lack of system resources.  It kept up with the load \nand stopped a great many things that otherwise would have annoyed my \nusers.\n\nThis is just an example of what we did with what was available then.",
          "link": "https://rachelbythebay.com/w/2021/11/08/hardware/",
          "publishedOn": "2021-11-08T09:51:09.000Z",
          "wordCount": 693,
          "title": "The hardware behind my old mail filtering server"
        },
        {
          "id": "https://rachelbythebay.com/w/2021/11/07/select/",
          "author": null,
          "description": "There's something to be said for writing a \npost\nlate on a Saturday night.  For some reason, it tends to bring out \nTHE ONE\nmore than any other time of the week.  I wonder why that is.\n\n\nI mean, you're not wrong... but how's the rest of that quote go?\n\n\nRecall that it turned into a situation where the individual components \nof the query (ip, helo, from, to) were now in their own tables, so they \nall had a number now - the \"id\" column.  I figured, okay, I need to \nobtain those little suckers before I can build a query with them, so \nlet's query!\n\n\nSo, yep, I fired off four queries to get four numbers, then built up a \nquery, then fired that off as a fifth to get my results.\n\n\nDid I mention that I obviously didn't know the first thing about JOIN \nback then?  It took several more years for that to happen organically.\n\nGo on, bag on me for being ignorant.  I know what that really means.",
          "link": "https://rachelbythebay.com/w/2021/11/07/select/",
          "publishedOn": "2021-11-07T19:27:57.000Z",
          "wordCount": 357,
          "title": "But wait, there's more"
        },
        {
          "id": "https://rachelbythebay.com/w/2021/11/06/sql/",
          "author": null,
          "description": "The first time you encounter something, you're probably going to make \nsome mistakes.  There's a post going around tonight about how someone \nforgot to put an index on some database thing and wound up doing full \ntable scans (or something like that).  The rub is that instead of just \nbeing slow, it also cost a fair amount of money because this crazy \nvendor system charged by the row or somesuch.  So, by scanning \nthe whole table, they touched all of those rows, and oh hey, massive \namounts of money just set ablaze!\n\n\nThis system was something that was intended to slow down or stop a lot \nof the \"open proxy\" spam that was going around at the time - late 2002.  \nIt was apparent that these spammer scum would grab an open proxy and \nthen would connect outward to your mail exchanger and would t…",
          "link": "https://rachelbythebay.com/w/2021/11/06/sql/",
          "publishedOn": "2021-11-07T19:27:06.000Z",
          "wordCount": 1199,
          "title": "A terrible schema from a clueless programmer"
        },
        {
          "id": "https://rachelbythebay.com/w/2021/11/05/sevenbits/",
          "author": null,
          "description": "Last November, I put up a\nlist\nof a bunch of \"magic numbers\" including some years in which time/date \nstuff is likely to break.  There's 2036 for the NTP era rollover, 2038 \nfor time_t requiring 32 bits in January *and* another GPS week rollover \nin November.\n\n\nLooking at the current year gives you a hint.  It's 2021, but another \nway of looking at that is that we're 121 years past the year 1900.  A \nfair number of things use(d) 1900 as an epoch, base year, or just an \noffset of sorts.  Why?  Well, they were probably invented in simpler \ntimes when the current year wasn't quite that far from 1900 at the time, \nand it would fit into fewer bits.  Specifically, it'll fit into just \nseven bits... until 2028, that is.\n\n\nSo, if someone used 1900 as their base year, stored years relative to \nthat, and then did it in just seven bits (or eight bits where one of \nthem is a sign bit), it'll overflow in a little over six years.  What \nhappens then depends on which method was used, and whether it applies \ncertain kinds of sanity checks.\n\n1773.  Neat!\n\n\nI originally spotted this thanks to a \nbug report type comment\non an epitaph (!) on HN.  That one is about ISO 9660 (CD/DVD stuff) \nsoftware and how it handles years.\n\nsimilar\nwas found in the Linux kernel in 2015 (and appears to have been \npatched).\n\nreference to this same problem\nthat might be useful if you're trying to keep your HP 3000 alive.  You \nknow, the things with the \n300+ lb disk drives?  \n(If you know, you know.)\n\n\nWikipedia does have 2028 in their epic\nlist\nof time formatting and storage bugs, naturally, but it only talks about \nsystems from the '70s.  It doesn't mention ISO 9660 at all - at the \nmoment, that is.  Perhaps someone in the know will update it and then \nthis comment will be obsolete.\n\n\n...\n\n\nEleven bits!  Luxury!  Ah, well, guess what happens in 2048?  Yep!\n\n\nFinally, one random thing for anyone who's not already aware: try\nlog2(n) to get a feel for how big a number is in binary.  Neat, right?",
          "link": "https://rachelbythebay.com/w/2021/11/05/sevenbits/",
          "publishedOn": "2021-11-05T07:13:18.000Z",
          "wordCount": 652,
          "title": "Years since 1900 + seven bits = breakage in 2028"
        },
        {
          "id": "https://rachelbythebay.com/w/2021/10/30/5tb/",
          "author": null,
          "description": "Almost ten years ago,\nI wrote an obscure post about something that would have only made sense \nif you also worked at Google at the time it happened (around 2010).  It \nwas a reference to an Xtranormal video that someone created about the \nperils of trying to get your stuff running in production without having \nsomeone hate on you for \"doing it wrong\".\n\n\nWhen it came out, I took a screenshot of the long-suffering engineer \n(some kind of red panda/fox girl thing) and had a T-shirt made from it.  \nI wore it to work a few times to great effect.  It was our own little \ninternal joke within the company.\n\n\nReady?  \nHere it is.\n\n\nAs for everything in the video, it is really close to what the reality \nof production was back in the day.  Things were actually quite a bit \nworse than what it suggests, if you can believe it.  The whole thing \nabout \"get quota in two cells\" misses the fact that it was damn near \nimpossible to get the quota you needed across multiple services \n(compute, storage, ...) in the same place at the same time.\n\n\nSo, if you heard stories about software engineers doing shady deals to \ntrade quota between teams so they could get all of the stuff in the \nsame spot?  Yep, this is where those came from.  That's the kind of \nthing that was happening.  People had to blow time and energy on \nworrying about that kind of thing instead of working on whatever they \nwere supposed to be doing.\n\n\nI'm sure my non-solution probably bit someone later.  Sorry, whoever.",
          "link": "https://rachelbythebay.com/w/2021/10/30/5tb/",
          "publishedOn": "2021-10-30T22:26:43.000Z",
          "wordCount": 581,
          "title": "Now you can (try to) serve five terabytes, too"
        },
        {
          "id": "https://rachelbythebay.com/w/2021/03/10/sealed/",
          "author": null,
          "description": "A couple of weeks ago, I read a\npost\nabout how the \"sealed system\" on Big Sur was hurting people.  I kind of \nskimmed through it and figured it was mostly complaining about the \nsize of the download.  For whatever reason, that hadn't been a problem \nfor me and my machines, so I kind of wrote it off.\n\n\nFor a good number of years, I've been (foolishly, as it turns out) using \nthe included Apache httpd to run small localhost-only stuff on my Mac \nlaptop.  In recent times, I found that every upgrade of the OS would \nrevert my httpd.conf and it would need to be put back.\n\n\nWhy would it matter if the sshd config got reverted?  Simple: it's \nbecause the stock Mac sshd install includes password-based auth, and \nthat means someone can brute-force their way onto your machine if they \ncan connect to …",
          "link": "https://rachelbythebay.com/w/2021/03/10/sealed/",
          "publishedOn": "2021-10-27T23:27:38.000Z",
          "wordCount": 1281,
          "title": "Mac upgrade opened sshd to brute force password attacks"
        },
        {
          "id": "https://rachelbythebay.com/w/2021/10/27/macssh/",
          "author": null,
          "description": "If you're riding the bleeding edge of Mac software updates, you might \nhave just installed Monterey, or you will soon.  If you're also running \nsshd so you can log in remotely, you should be aware that the typical \n\"revert your config\" shenanigans have happened, so you are\nonce again\naccepting password authentication, and thus are subject to a brute-force \nattack.\n\n\nEditing that file would likely get reverted upon the next patch \n(12.0.2?), so that's right out.  You can't go past it with a higher \nnumber, since as the sshd_config points out, the *first* instance of a \nsetting is kept, and subsequent instances of the same setting are \nignored.\n\n\n\nUsePAM no\nPasswordAuthentication no\n\n\n\nFinally, after you make this change, make sure it actually worked by \nforcing a password/interactive-only login attempt to the machine.  Make \nsure it fails and doesn't ask you for a password.  If you don't know how \nto do this, the\nprevious post\ncontains info on that, including a terrible scanner script that belongs \nin the bottom of a cat box.\n\nEnjoy.",
          "link": "https://rachelbythebay.com/w/2021/10/27/macssh/",
          "publishedOn": "2021-10-27T23:26:13.000Z",
          "wordCount": 302,
          "title": "Disabling ssh password auth on Monterey is different"
        },
        {
          "id": "https://rachelbythebay.com/w/2021/10/13/temp/",
          "author": null,
          "description": "One of the fun things I used to do at a prior job was to dig through the \nraw data points which were collected from the *many* servers we had.  I \ncould just pick an interesting-sounding metric and then would just ask \nthe system to show me the top 10 or bottom 10 out of a population of \nthousands or more.\n\n\nTo get my feet wet with the whole \"investigations\" thing that we'd do, I \nstarted looking into this one day and chose one of the many temp sensors \nwhich were being logged by the servers.  I forget exactly which one it \nwas, for there were many.  The CPUs logged it, the chassis logged it, \nthe power supply logged it, and so on.  There were so many choices.\n\n\nI went looking for a reason.  What could possibly explain this?  First \noff, it didn't line up with any obvious pattern in the host names.  The \nhosts were named for whichever team owned them, followed by a sequence \nnumber that was bumped any time a new one was provisioned.  There was no \nsignal to be found in that.\n\n\nThere was more, though.  You could also see a \"rack position\" in this \ndata, and now it started getting interesting.  It seems that all of the \nreally hot machines had a rack position of something low, like 04 or 05, \nand never anything higher than that.  In fact, when looking at a whole \nrack, it was always the lowest number of all of the positions that were \nbeing used.  Now this was worth chasing!\n\n\nIt's good that I asked, since they told me something surprising: \nposition 04 or 05 or whatever was the *bottom* of the rack.  Yes, \nsomehow, the lowest machine in the rack was the hottest!  They found \nthis interesting, too, and wound up digging into it.  Given that I was \nfar away in a distant office, this was the best way for us to proceed.\n\n\nThe problem was that the bottommost server would have nothing below it \nbut just open space until it got to the floor.  That space would not \nmove air efficiently, and it obviously mattered.\n\n\nThis rolled out and my hot spots disappeared.  Fantastic!",
          "link": "https://rachelbythebay.com/w/2021/10/13/temp/",
          "publishedOn": "2021-10-14T03:02:42.000Z",
          "wordCount": 839,
          "title": "Looking at the outlying data points"
        },
        {
          "id": "https://rachelbythebay.com/w/2021/10/12/break/",
          "author": null,
          "description": "I know I've already\ncommented\non a certain site's big outage\ntwice now,\nbut I have one more bit of rumor to share, and it apparently invalidates \nwhat I had heard previously.  That is, it may not have been a matter of \n\"show X Y\" vs. \"clear X Y\", but rather some kind of automation that went \na bit too far.\n\n\nThen, what if you didn't have to actually type something in to hit the \nbutton?  Maybe you forgot, or something else happened, and you didn't \nfill it in, so when you did that, it said \"okay, cool then\" and \ndid all of them instead?\n\n\nGo to tool, don't type in target, hit button, ALL targets affected.\n\n\nIt sounds like another kind of \"footgun\" (you know, something you can \nuse to shoot yourself in the foot) from the world of databases: an \nUPDATE without a WHERE.\n\n\n\nUPDATE my_table SET invalid = true WHERE asset_id = 1012;\n\n\n\nImagine what happens when you forget the WHERE.  It's the last thing on \nthe line as shown, so you could send off the command early and it would \ntotally work.  It would look like this:\n\n\nAnd... guess what, without that WHERE, it just set that bit everywhere.  \nEverything is marked invalid, and your business might suffer for it.\n\n\nFinal note on the \"do all the things\" thing: maybe the tool \nactually is supposed to let you do that.  In that case, maybe it would \nbe good if it said something like \"you are about to drain 123,456 \ndevices, so type in that exact number to proceed\".  You know,\nthat\nkind of thing.  It tends to add enough of a pause to prevent some \ndisasters.",
          "link": "https://rachelbythebay.com/w/2021/10/12/break/",
          "publishedOn": "2021-10-12T19:50:16.000Z",
          "wordCount": 524,
          "title": "An UPDATE without a WHERE, or something close to it"
        },
        {
          "id": "https://rachelbythebay.com/w/2021/10/05/cmd/",
          "author": null,
          "description": "Here's something fun I saw which created an outage once.  I've written \nabout this\nbefore,\nbut in light of yesterday's fun and games, I figured this one is worth \nanother mention.\n\n\nOne way to do this on a Linux box with the usual GNU userspace stuff is \nto feed it to date, like this:\n\n\nThe problem is, there's another command very much like it that will even \nspit out the same output, only it has a nice little side-effect: it \nalso sets the clock.  That command is date -s.\n\n\nAnother problem is that you might not have known that -s has that \neffect, and you have been using it because it gives you the output you \nwant, and you don't realize what else it can do.\n\n\nThis then touched off a whole bunch of badness which I already talked \nabout before.  It messed up other systems, and brought up questions of \nhow to defend against it, and all of that other good stuff you'd expect \nto hear after a problem of that sort.\n\ndisplay everything, but instead it \ncleared everything.\n\n\nshow mpls lsp\n\n\nclear mpls lsp\n\n\nHopefully the similarity to 'date -d' vs. 'date -s' is clear.\n\nSmall commands can have giant consequences.",
          "link": "https://rachelbythebay.com/w/2021/10/05/cmd/",
          "publishedOn": "2021-10-05T21:54:44.000Z",
          "wordCount": 498,
          "title": "'date -d' vs. 'date -s', and 'show foo' vs. 'clear foo'"
        },
        {
          "id": "https://rachelbythebay.com/w/2021/10/04/callthecops/",
          "author": null,
          "description": "Some people who know me and know what I used to do saw the news today \n(or just tried to go online for cat pictures and failed) have been \nreaching out for reactions.\n\n\n\n\n\nAs for the potential customer, well, you should know how to reach me.  \nBring your checkbook.",
          "link": "https://rachelbythebay.com/w/2021/10/04/callthecops/",
          "publishedOn": "2021-10-04T18:39:56.000Z",
          "wordCount": 136,
          "title": "In the news today: *munch munch munch*"
        },
        {
          "id": "https://rachelbythebay.com/w/2021/09/29/alnum/",
          "author": null,
          "description": "I got really bored tonight and went down some rabbit holes and turned up \nsomething from about a year ago.  If you follow the latest Linux type \nstuff, you probably remember this, but if not, this might seem new to \nyou.  It's just something dumb and amusing.\n\n\nGo grab a Linux box with glibc on it.  Then compile and run this C code:\n\n\nThen run it and watch what happens.  If you have multiple machines, try \nit on some of them and compare the results.  If the results are \ndifferent, why do you suppose that is?\n\n\nNeat, right?  It makes me want to go looking for places where people are \ncalling these functions with ints that I can control to see if I can \nblow it up.\n\nsource\nto see how the sausage is made by someone who did the work already.\n\n\n...\n\n\nThis is awesome because it's that many more possibilities.  I had been \ngrepping source for \"isalnum\" to try to find inputs I can control, but \nnow I realize that FAR more functions give a way into this.  Have fun!",
          "link": "https://rachelbythebay.com/w/2021/09/29/alnum/",
          "publishedOn": "2021-09-30T05:34:02.000Z",
          "wordCount": 403,
          "title": "Fun with glibc and the ctype.h functions"
        },
        {
          "id": "https://rachelbythebay.com/w/2021/09/22/membind/",
          "author": null,
          "description": "I was digging through some notes on old outages tonight and found \nsomething potentially useful for other people.  It's something I\nhave mentioned before,\nbut it seems like maybe that post didn't have enough specifics to\nmake it really \"land\" when someone else does a web search.\n\n\nOn a Wednesday night not so long ago, someone opened a SEV (that is, a \nnotification of something going wrong) and said the individual tasks for \ntheir service were \"crash looping\".  These things ran in an environment \nwhere they were supervised by the job runner, so if they died, they'd be \nrestarted, but you never wanted to keep it in this kind of state.\n\n\nIt looked like this had started when some update had rolled out.  That \nis, prior to the update, their service was fine.  After they changed \nsomething, it s…",
          "link": "https://rachelbythebay.com/w/2021/09/22/membind/",
          "publishedOn": "2021-09-23T05:10:10.000Z",
          "wordCount": 783,
          "title": "A different take on the NUMA OOM killer story"
        },
        {
          "id": "https://rachelbythebay.com/w/2021/09/20/hop/",
          "author": null,
          "description": "I have an older iPhone that used to be my daily driver.  It mostly just \nhangs around for testing random junk.  It's still getting updates, and \nso when Apple offered it iOS 15 today, I installed it.  This gave me a \nchance to turn on their beta \"private relay\" stuff which seems to be \na TOR-like system.\n\n\nWhat did surprise me is the lack of \"stickiness\" for these IP addresses.  \nEvery five seconds or so, it seems to hop to another address in the same \n(IPv6, remember) /64.  If you're not down with v6 conventions yet, this \nmeans the first four parts like \"xxxx:xxxx:xxxx:xxxx\" stay the same, but \nthe last four change completely every time.\n\n\nI actually don't have any v4-only (aka LEGACY) stuff to try it on, so I \nhave no idea what happens on that side of the world.  It probably looks \nabout the same, albeit within a much smaller range of possible source IP \naddresses.  It probably resembles a CGNAT type situation.\n\nIt'll be fun to see what this breaks, and who howls the loudest.",
          "link": "https://rachelbythebay.com/w/2021/09/20/hop/",
          "publishedOn": "2021-09-21T01:45:25.000Z",
          "wordCount": 362,
          "title": "Apple's private relay service does not sit still"
        }
      ]
    },
    {
      "title": "LOW-TECH MAGAZINE",
      "feedUrl": "https://feeds2.feedburner.com/typepad/krisdedecker/lowtechmagazineenglish",
      "siteUrl": "https://www.lowtechmagazine.com/",
      "articles": [
        {
          "id": "https://www.lowtechmagazine.com/2021/11/fascine-mattresses-basketry-gone-wild.html",
          "author": null,
          "description": "Around the 17th century, the Dutch started reinforcing their dykes and harbours with sturdy mats the size of football pitches – hand-woven from thousands of twigs grown on nearby coppice plantations. These “fascine mattresses” were weighted with rocks and sunk into canals, estuaries, and rivers. This article contains many images and would be a 12.1 MB download from this website. Therefore, I kindly invite you to read the article on our solar powered website, where it has been compressed to 1.90 MB.",
          "link": "https://www.lowtechmagazine.com/2021/11/fascine-mattresses-basketry-gone-wild.html",
          "publishedOn": "2021-11-04T18:50:58.000Z",
          "wordCount": 1158,
          "title": "Fascine Mattresses: Basketry Gone Wild"
        },
        {
          "id": "http://feedproxy.google.com/~r/typepad/krisdedecker/lowtechmagazineenglish/~3/-7QmVM_YaNw/fascine-mattresses-basketry-gone-wild.html",
          "author": null,
          "description": "Around the 17th century, the Dutch started reinforcing their dykes and harbours with sturdy mats the size of football pitches – hand-woven from thousands of twigs grown on nearby coppice plantations. These “fascine mattresses” were weighted with rocks and sunk into canals, estuaries, and rivers. This article contains many images and would be a 12.1 MB download from this website. Therefore, I kindly invite you to read the article on our solar powered website, where it has been compressed to 1.90 MB.",
          "link": "http://feedproxy.google.com/~r/typepad/krisdedecker/lowtechmagazineenglish/~3/-7QmVM_YaNw/fascine-mattresses-basketry-gone-wild.html",
          "publishedOn": "2021-11-04T18:50:58.000Z",
          "wordCount": 497,
          "title": "Fascine Mattresses: Basketry Gone Wild"
        },
        {
          "id": "https://www.lowtechmagazine.com/2021/10/how-to-build-a-low-tech-solar-panel.html",
          "author": null,
          "description": "George Cove, a forgotten solar power pioneer, may have built a highly efficient photovoltaic panel 40 years before Bell Labs engineers invented silicon cells. If proven to work, his design could lead to less complex and more sustainable solar panels. Above: George Cove stands next to his third solar array. Source: \"Generating electricity by the sun's rays\", Popular Electricity, Volume 2, nr. 12, April 1910, pp.793. More efficient, less sustainable Ever since Bell Labs presented the first practical solar PV panel in the 1950s, technological development has focused on reducing costs and increasing the efficiency of solar cells. According to these standards, researchers have made a lot of progress. The efficiency of solar panels increased from less than 5% in...",
          "link": "https://www.lowtechmagazine.com/2021/10/how-to-build-a-low-tech-solar-panel.html",
          "publishedOn": "2021-10-06T10:12:00.000Z",
          "wordCount": 6661,
          "title": "How to Build a Low-tech Solar Panel?"
        },
        {
          "id": "http://feedproxy.google.com/~r/typepad/krisdedecker/lowtechmagazineenglish/~3/s1xYIgkW3e8/how-to-build-a-low-tech-solar-panel.html",
          "author": null,
          "description": "George Cove, a forgotten solar power pioneer, may have built a highly efficient photovoltaic panel 40 years before Bell Labs engineers invented silicon cells. If proven to work, his design could lead to less complex and more sustainable solar panels. Above: George Cove stands next to his third solar array. Source: \"Generating electricity by the sun's rays\", Popular Electricity, Volume 2, nr. 12, April 1910, pp.793. More efficient, less sustainable Ever since Bell Labs presented the first practical solar PV panel in the 1950s, technological development has focused on reducing costs and increasing the efficiency of solar cells. According to these standards, researchers have made a lot of progress. The efficiency of solar panels increased from less than 5% in...",
          "link": "http://feedproxy.google.com/~r/typepad/krisdedecker/lowtechmagazineenglish/~3/s1xYIgkW3e8/how-to-build-a-low-tech-solar-panel.html",
          "publishedOn": "2021-10-06T10:12:00.000Z",
          "wordCount": 5751,
          "title": "How to Build a Low-tech Solar Panel?"
        }
      ]
    },
    {
      "title": "esoteric.codes",
      "feedUrl": "https://esoteric.codes/rss",
      "siteUrl": "https://esoteric.codes",
      "articles": [
        {
          "id": "https://esoteric.codes/blog/escher-circuits-using-vision-to-perform-computation",
          "author": null,
          "description": "In 2008, Mark Changizi, a Sloan-Swartz Fellow in Theoretical Neuroscience at Caltech, noted that the eye can make sense of complex relationships that often mystify the brain. \n\r\n\r\nOur everyday visual perceptions rely upon unfathomably complex computations carried out by tens of billions of neurons across over half our cortex. In spite of this, it does not “feel” like work to see. Our cognitive powers are, in stark contrast, “slow and painful,” and we have great trouble with embarrassingly simple logic tasks. \n\r\nMight it be possible to harness our visual computational powers for other tasks, perhaps for tasks cognition finds difficult? \n\r\n\r\nIn other words, could we trick the eye into performing computation? \n\r\nChangizi proposed the Escher Circuit, \"a special kind of image that amounts to 'visual software' our 'visual hardware' computes\" merely through perception.\n\r\nEscher Circuits work by creating different states corresponding to how the eye resolves ambiguous images. Its core component, the wire, holds a state of 0 when we perceive it as if we are to the right of it; otherwise, it holds a state of 1.\n\r\n\nwire\n\r\n\n0\n\r\n\n1\n\r\n\r\n \nRead More",
          "link": "https://esoteric.codes/blog/escher-circuits-using-vision-to-perform-computation",
          "publishedOn": "2021-09-22T07:29:00.000Z",
          "wordCount": 1009,
          "title": "Escher Circuits: Using Vision to Perform Computation"
        }
      ]
    },
    {
      "title": "Lea Verou",
      "feedUrl": "https://feeds.feedburner.com/leaverou",
      "siteUrl": "https://lea.verou.me",
      "articles": [
        {
          "id": "https://lea.verou.me/?p=3384",
          "author": "Lea Verou",
          "description": "When developing customizable components, one often wants to expose various parameters of the styling as custom properties, and form a sort of CSS API. This is still underutlized, but there are libraries, e.g. Shoelace, that already list custom properties alongside other parts of each component’s API (even CSS parts!). Note: I’m using “component” here broadly, […]",
          "link": "https://lea.verou.me/2021/10/custom-properties-with-defaults/",
          "publishedOn": "2021-10-15T11:22:40.000Z",
          "wordCount": 1247,
          "title": "Custom properties with defaults: 3+1 strategies"
        },
        {
          "id": "https://lea.verou.me/?p=3384",
          "author": "Lea Verou",
          "description": "When developing customizable components, one often wants to expose various parameters of the styling as custom properties, and form a sort of CSS API. This is still underutlized, but there are libraries, e.g. Shoelace, that already list custom properties alongside other parts of each component’s API (even CSS parts!). Note: I’m using “component” here broadly, […]",
          "link": "http://feedproxy.google.com/~r/leaverou/~3/h1tDrR0P_JU/",
          "publishedOn": "2021-10-15T11:22:40.000Z",
          "wordCount": 1247,
          "title": "Custom properties with defaults: 3+1 strategies"
        }
      ]
    },
    {
      "title": "TEXT-MODE",
      "feedUrl": "https://text-mode.tumblr.com/rss",
      "siteUrl": "https://text-mode.tumblr.com/",
      "articles": [
        {
          "id": "https://text-mode.tumblr.com/post/666306458432012288",
          "author": null,
          "description": "ascii-yume:",
          "link": "https://text-mode.tumblr.com/post/666306458432012288",
          "publishedOn": "2021-10-28T16:42:36.000Z",
          "wordCount": 207,
          "title": "Untitled"
        },
        {
          "id": "https://text-mode.tumblr.com/post/665225002021519360",
          "author": null,
          "description": "garadinervi:\nNancy Middlebrook, Norway #3, (woven with hand dyed cotton), 2020",
          "link": "https://text-mode.tumblr.com/post/665225002021519360",
          "publishedOn": "2021-10-16T18:13:19.000Z",
          "wordCount": 176,
          "title": "Untitled"
        }
      ]
    },
    {
      "title": "Julia Evans",
      "feedUrl": "https://jvns.ca/atom.xml",
      "siteUrl": "http://jvns.ca/atom.xml",
      "articles": [
        {
          "id": "https://jvns.ca/blog/2021/11/17/debugging-a-weird--file-not-found--error/",
          "author": null,
          "description": "Yesterday I ran into a weird error where I ran a program and got the error\n“file not found” even though the program I was running existed. It’s something\nI’ve run into before, but every time I’m very surprised and confused by it\n(what do you MEAN file not found, the file is RIGHT THERE???!!??)\nSo let’s talk about what happened and why!\nthe error\nLet’s start by showing the error message I got. I had a Go program called\nserve.go, and I was trying to bundle it into a Docker container with this\nDockerfile:\nFROM golang:1.17 AS go\n\nADD ./serve.go /app/serve.go\nWORKDIR /app\nRUN go build serve.go\n\nFROM alpine:3.14\n\nCOPY --from=go /app/serve /app/serve\nCOPY ./static /app/static\nWORKDIR /app/static\nCMD [\"/app/serve\"]\n\nThis Dockerfile\nBuilds the Go program\nCopies the binary into an Alpine container\nP…",
          "link": "https://jvns.ca/blog/2021/11/17/debugging-a-weird--file-not-found--error/",
          "publishedOn": "2021-11-17T12:34:36.000Z",
          "wordCount": 1284,
          "title": "Debugging a weird 'file not found' error"
        },
        {
          "id": "https://jvns.ca/blog/2021/11/15/esbuild-vue/",
          "author": null,
          "description": "Hello!\nI’ve been writing more frontend code in the last year or two – I’ve been making a bunch of little Vue projects. (for example nginx playground, sql playground, this dns lookup tool, and a couple of others)\nMy general approach to frontend development has been pretty “pretend it’s 2005” – I usually\nhave an index.html file, a script.js file, and then I do a <script\nsrc=\"script.js\"> and that’s it. You can see an example of that approach here.\nThis has been working mostly ok for me, but sometimes I run into problems. So I\nwanted to talk about one of those problems, a solution I found\n(esbuild!), and what I needed to learn to solve the problem (some very basic facts about how npm builds work).\nSome of the facts in this post might\nbe wrong because still I don’t understand Javascript build s…",
          "link": "https://jvns.ca/blog/2021/11/15/esbuild-vue/",
          "publishedOn": "2021-11-15T19:14:17.000Z",
          "wordCount": 1750,
          "title": "Some notes on using esbuild"
        },
        {
          "id": "https://jvns.ca/blog/2021/11/04/how-do-you-tell-if-a-problem-is-caused-by-dns/",
          "author": null,
          "description": "I was looking into problems people were having with DNS a few months ago and I\nnoticed one common theme – a lot of people have server issues (“my server is\ndown! or it’s slow!“), but they can’t tell if the problem is caused by DNS or\nnot.\nSo here are a few tools I use to tell if a problem I’m having is caused by DNS,\nas well as a few DNS debuggging stories from my life.\nI don’t try to interpret browser error messages\nFirst, let’s talk briefly about browser error messages. You might think that\nyour browser will tell you if the problem is DNS or not! And it could but\nmine doesn’t seem to do so in any obvious way.\nOn my machine, if Firefox fails to resolve DNS for a site, it gives me the\nerror: Hmm. We’re having trouble finding that site. We can’t connect to the\nserver at bananas.wizardzines.…",
          "link": "https://jvns.ca/blog/2021/11/04/how-do-you-tell-if-a-problem-is-caused-by-dns/",
          "publishedOn": "2021-11-04T11:19:22.000Z",
          "wordCount": 1647,
          "title": "How do you tell if a problem is caused by DNS?"
        },
        {
          "id": "https://jvns.ca/blog/2021/10/21/how-to-get-useful-answers-to-your-questions/",
          "author": null,
          "description": "5 years ago I wrote a post called how to ask good questions.\nI still really like that post, but it’s missing a few of the tactics I use to\nget useful answers like “interrupt people when they’re going off on an\nirrelevant tangent”.\nwhat can go wrong when asking questions\nOften when I ask a vague or underspecified question, what happens is one of:\nthe person starts by explaining a bunch of stuff I already know\nthe person explains some things which I don’t know, but which I don’t think\nare relevant to my problem\nthe person starts giving a relevant explanation, but using terminology that\nI don’t understand, so I still end up being confused\nNone of these give me the answer to my question and this can be quite\nfrustrating (it often feels condescending when someone embarks on a lengthy\nexplanatio…",
          "link": "https://jvns.ca/blog/2021/10/21/how-to-get-useful-answers-to-your-questions/",
          "publishedOn": "2021-10-21T11:06:26.000Z",
          "wordCount": 1868,
          "title": "How to get useful answers to your questions"
        },
        {
          "id": "https://jvns.ca/blog/2021/10/05/tools-to-look-at-bgp-routes/",
          "author": null,
          "description": "Yesterday there was a big Facebook outage caused by BGP. I’ve been vaguely\ninterested in learning more about BGP for a long time, so I was reading a\ncouple of articles.\nI got frustrated because none of the articles showed me how I could actually\nlook up information related to BGP on my computer, so I wrote a tweet asking for tools.\nI got a bunch of useful replies as always, so this blog post shows some tools\nyou can use to look up BGP information. There might be an above average number\nof things wrong in this post because I don’t understand BGP that well.\nI can’t publish BGP routes\nOne of the reasons I’ve never learned much about BGP is – as far as I know, I don’t have access to publish BGP routes on the internet.\nWith most networking protocols, you can pretty trivially get access to\nimple…",
          "link": "https://jvns.ca/blog/2021/10/05/tools-to-look-at-bgp-routes/",
          "publishedOn": "2021-10-05T08:53:24.000Z",
          "wordCount": 2684,
          "title": "Tools to explore BGP"
        },
        {
          "id": "https://jvns.ca/blog/2021/10/02/all-my-zines-are-now-available-in-print/",
          "author": null,
          "description": "Hello! In June I announced that I was releasing 4 zines in print and promised “more zines\ncoming soon”. “Soon” has arrived! You can get any zine you want in print now!\nI’m doing this now so that you can get zines in the mail in time for Christmas, or\nany other end-of-year holiday you celebrate :)\nyou can preorder zines today!\nFirst the basic facts!\nyou can preorder zines as of today\nthe preorder deadline is October 12\nzines will ship around November 5\nyou’ll get them in time for Christmas\nmore logistical details in the Preorders FAQ\nHere’s the link to get them:\nPreorder print zines\n\n\n\n\n\nHere are a few more notes about how the print zines work – they’re mostly the same as last time\nwhy a preorder?\nIt makes it easier to decide how many zines to print! I don’t want to\naccidentally underestima…",
          "link": "https://jvns.ca/blog/2021/10/02/all-my-zines-are-now-available-in-print/",
          "publishedOn": "2021-10-02T09:42:31.000Z",
          "wordCount": 993,
          "title": "All my zines are now available in print!"
        },
        {
          "id": "https://jvns.ca/blog/2021/09/24/new-tool--an-nginx-playground/",
          "author": null,
          "description": "Hello! On Wednesday I was talking to a friend about how it would be cool to\nhave an nginx playground website where you can just paste in an nginx config\nand test it out. And then I realized it might actually be pretty easy to build,\nso got excited and started coding and I built it. It’s at\nhttps://nginx-playground.wizardzines.com.\nHere’s a screenshot:\n\nFor the rest of the post I’m mostly going to talk about how I built the\nproject, because there were a few decisions that weren’t obvious to me.\nhow to use it\nYou need to enter both an nginx config and a curl or http command to make a\nHTTP request to that nginx instance\nAnd then you click “Run” in the top right, and it’ll output either:\nthe results of the command you executed (if nginx started successfully), or\nthe nginx error logs (if nginx …",
          "link": "https://jvns.ca/blog/2021/09/24/new-tool--an-nginx-playground/",
          "publishedOn": "2021-09-24T08:25:33.000Z",
          "wordCount": 1500,
          "title": "New tool: an nginx playground"
        }
      ]
    },
    {
      "title": "Josh Comeau's blog",
      "feedUrl": "https://www.joshwcomeau.com/rss.xml",
      "siteUrl": "https://www.joshwcomeau.com/",
      "articles": [
        {
          "id": "https://www.joshwcomeau.com/css/introducing-shadow-palette-generator/",
          "author": "Josh W. Comeau",
          "description": "In order to create lush, realistic shadows in CSS, we need to use multiple layers and colors. How do we come up with all of the parameters, though? I've built a tool that'll help.",
          "link": "https://www.joshwcomeau.com/css/introducing-shadow-palette-generator/",
          "publishedOn": "2021-11-16T14:00:00.000Z",
          "wordCount": 1230,
          "title": "Introducing “Shadow Palette Generator”"
        },
        {
          "id": "https://www.joshwcomeau.com/react/prefers-reduced-motion/",
          "author": "Josh W. Comeau",
          "description": "I really love animation, but not everybody does. In fact, it can make some people literally sick! In this tutorial, we'll see how to ensure that we respect user preferences, and create animations that can be disabled.",
          "link": "https://www.joshwcomeau.com/react/prefers-reduced-motion/",
          "publishedOn": "2021-10-06T05:42:21.000Z",
          "wordCount": 1826,
          "title": "Accessible Animations in React"
        },
        {
          "id": "https://www.joshwcomeau.com/animation/keyframe-animations/",
          "author": "Josh W. Comeau",
          "description": "CSS keyframe animations are incredibly flexible and powerful, but they’re also a bit weird. In this deep-dive tutorial, we'll learn how CSS keyframes work from the ground up, and see how to use them to build high-quality animations.",
          "link": "https://www.joshwcomeau.com/animation/keyframe-animations/",
          "publishedOn": "2021-09-28T14:03:38.000Z",
          "wordCount": 2009,
          "title": "An Interactive Guide to Keyframe Animations"
        },
        {
          "id": "https://www.joshwcomeau.com/css/transforms/",
          "author": "Josh W. Comeau",
          "description": "The “transform” property is such a powerful part of the CSS language! In this blog post, we'll take a deep look at this property and see some of the nifty things it can do.",
          "link": "https://www.joshwcomeau.com/css/transforms/",
          "publishedOn": "2021-09-28T14:03:38.000Z",
          "wordCount": 1927,
          "title": "The World of CSS Transforms"
        },
        {
          "id": "https://www.joshwcomeau.com/animation/3d-button/",
          "author": "Josh W. Comeau",
          "description": "Every action we take on the web starts with a button click, and yet most buttons are ho-hum and uninspired. In this tutorial, we'll build an animated 3D button with HTML and CSS that sparks joy.",
          "link": "https://www.joshwcomeau.com/animation/3d-button/",
          "publishedOn": "2021-09-28T14:03:38.000Z",
          "wordCount": 2340,
          "title": "Building a Magical 3D Button"
        },
        {
          "id": "https://www.joshwcomeau.com/css/the-importance-of-learning-css/",
          "author": "Josh W. Comeau",
          "description": "I know so many super-talented developers who share the same achilles heel: CSS. Instead of trying to “outrun” CSS, this article explores why leaning in and going deeper can be a tremendous boon for your development life and your career.",
          "link": "https://www.joshwcomeau.com/css/the-importance-of-learning-css/",
          "publishedOn": "2021-09-28T14:03:38.000Z",
          "wordCount": 2015,
          "title": "The Importance of Learning CSS"
        },
        {
          "id": "https://www.joshwcomeau.com/css/stacking-contexts/",
          "author": "Josh W. Comeau",
          "description": "The z-index property can be a tricky little bugger. Sometimes, no matter how much you crank up the number, the element never rises to the top! In this article, we explore stacking contexts, and see how they can thwart our efforts to use z-index. We'll also learn how to use this mechanism to our advantage.",
          "link": "https://www.joshwcomeau.com/css/stacking-contexts/",
          "publishedOn": "2021-09-28T14:03:38.000Z",
          "wordCount": 2581,
          "title": "What the heck, z-index??"
        },
        {
          "id": "https://www.joshwcomeau.com/css/full-bleed/",
          "author": "Josh W. Comeau",
          "description": "Certain layouts are surprisingly dastardly. On the modern web, one of the most common layouts is also one of the trickiest. In this tutorial, I break down how to build the \"full-bleed\" layout using CSS Grid.",
          "link": "https://www.joshwcomeau.com/css/full-bleed/",
          "publishedOn": "2021-09-28T14:03:38.000Z",
          "wordCount": 1791,
          "title": "Full-Bleed Layout Using CSS Grid"
        },
        {
          "id": "https://www.joshwcomeau.com/css/designing-shadows/",
          "author": "Josh W. Comeau",
          "description": "When I look around the web, most of the shadows I see are fuzzy grey boxes. It doesn't have to be this way, though! CSS gives us the tools to create rich, lush, lifelike shadows. In this tutorial, I'll show you how.",
          "link": "https://www.joshwcomeau.com/css/designing-shadows/",
          "publishedOn": "2021-09-23T19:35:28.000Z",
          "wordCount": 3739,
          "title": "Designing Beautiful Shadows in CSS"
        },
        {
          "id": "https://www.joshwcomeau.com/blog/how-to-learn-stuff-quickly/",
          "author": "Josh W. Comeau",
          "description": "As software developers, we're always learning new things; it's practically the whole gig! If we can learn to quickly pick up new languages/frameworks/tools, we'll become so much more effective at our job. It's sort of a superpower.",
          "link": "https://www.joshwcomeau.com/blog/how-to-learn-stuff-quickly/",
          "publishedOn": "2021-09-22T17:07:02.000Z",
          "wordCount": 2945,
          "title": "How To Learn Stuff Quickly"
        },
        {
          "id": "https://www.joshwcomeau.com/css/css-variables-for-react-devs/",
          "author": "Josh W. Comeau",
          "description": "CSS Variables are *really* cool, and they're incredibly powerful when it comes to React! This tutorial shows how we can use them with React to create dynamic themes. We'll see how to get the most out of CSS-in-JS tools like styled-components, and how our mental frame around media queries has been wrong all along.",
          "link": "https://www.joshwcomeau.com/css/css-variables-for-react-devs/",
          "publishedOn": "2021-09-21T17:49:38.000Z",
          "wordCount": 1749,
          "title": "CSS Variables for React Devs"
        },
        {
          "id": "https://www.joshwcomeau.com/animation/css-transitions/",
          "author": "Josh W. Comeau",
          "description": "This comprehensive guide shows how to use CSS transitions! A back-to-basics look at the fundamental building blocks we need to create microinteractions and other animations.",
          "link": "https://www.joshwcomeau.com/animation/css-transitions/",
          "publishedOn": "2021-09-21T17:49:38.000Z",
          "wordCount": 3507,
          "title": "An Interactive Guide to CSS Transitions"
        }
      ]
    },
    {
      "title": "The Mozilla Blog",
      "feedUrl": "https://blog.mozilla.org/en/feed/",
      "siteUrl": "https://blog.mozilla.org/en/",
      "articles": [
        {
          "id": "https://blog.mozilla.org/?p=68007",
          "author": "Mozilla",
          "description": "Today, Firefox Relay, a privacy-first and free product that hides your real email address to help protect your identity, is available with a new paid Premium service offering. The release comes just in time for the holiday season to help spare your inbox from being inundated with emails from e-commerce sites, especially those sites where […]\nThe post Introducing Firefox Relay Premium, allowing more aliases to protect your identity from spammers appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/mozilla/firefox-relay-and-premium-service/",
          "publishedOn": "2021-11-16T14:00:33.000Z",
          "wordCount": 1531,
          "title": "Introducing Firefox Relay Premium, allowing more aliases to protect your identity from spammers"
        },
        {
          "id": "https://blog.mozilla.org/?p=67996",
          "author": "Rebecca Smith",
          "description": "Here at Mozilla, we are the first to admit the internet isn’t perfect, but we are also quick to point out that the internet is pretty darn magical. The internet opens up doors and opportunities, allows for people to connect with others, and lets everyone find where they belong — their corners of the internet. […]\nThe post A Firefox mobile product manager on her favorite corners of the internet appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/internet-culture/interviews/my-corner-of-the-internet-with-vesta-zare/",
          "publishedOn": "2021-11-11T19:11:33.000Z",
          "wordCount": 1427,
          "title": "A Firefox mobile product manager on her favorite corners of the internet"
        },
        {
          "id": "https://blog.mozilla.org/?p=67996",
          "author": "Rebecca Smith",
          "description": "Here at Mozilla, we are the first to admit the internet isn’t perfect, but we are also quick to point out that the internet is pretty darn magical. The internet opens up doors and opportunities, allows for people to connect with others, and lets everyone find where they belong — their corners of the internet. […]\nThe post A Firefox mobile product manager on her favorite corners of the internet appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/internet-culture/interviews/my-corner-of-the-internet-with-vesta-ware/",
          "publishedOn": "2021-11-11T19:11:33.000Z",
          "wordCount": 1391,
          "title": "A Firefox mobile product manager on her favorite corners of the internet"
        },
        {
          "id": "https://blog.mozilla.org/?p=67970",
          "author": "Mozilla",
          "description": "There are plenty of reasons why you might want to keep something you are doing on the web to yourself. You might be looking for a ring for your soon-to-be fiance, looking up what those mysterious skin rashes could be, or reading a salacious celebrity gossip blog. That’s where Private Browsing mode comes in handy. […]\nThe post Firefox’s Private Browsing mode upleveled for you appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/mozilla/firefoxs-private-browsing-mode-upleveled-for-you/",
          "publishedOn": "2021-11-11T14:58:45.000Z",
          "wordCount": 1549,
          "title": "Firefox’s Private Browsing mode upleveled for you"
        },
        {
          "id": "https://blog.mozilla.org/?p=67993",
          "author": "M.J. Kelly",
          "description": "Starting with Firefox version 94, you will be able to personalize your browsing experience with 18 exciting new colorways themes. Each limited edition colorway presents its own individual bespoke characteristic. Find a color that better fits you with our palette. Learn more about how to get colorways.\nThe post Personalize Firefox with colorways appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/videos/personalize-firefox-with-colorways/",
          "publishedOn": "2021-11-10T17:13:12.000Z",
          "wordCount": 733,
          "title": "Personalize Firefox with colorways"
        },
        {
          "id": "https://blog.mozilla.org/?p=67826",
          "author": "Mozilla",
          "description": "As of today, Firefox desktop is the first major browser to become available in the Windows Store for Windows 10 and Windows 11 users. Previously, if you were on Windows and wanted to use Firefox, you had to download it from the internet and go through a clunky process from Microsoft. Now that Microsoft has […]\nThe post Firefox: the first major browser to be available in the Windows Store appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/products/firefox/firefox-the-first-major-browser-to-be-available-in-the-windows-store/",
          "publishedOn": "2021-11-09T14:00:00.000Z",
          "wordCount": 1078,
          "title": "Firefox: the first major browser to be available in the Windows Store"
        },
        {
          "id": "https://blog.mozilla.org/?p=67877",
          "author": "Mitchell Baker",
          "description": "I am excited to announce that Eric Muhlheim has joined Mozilla Corporation as our Chief Financial Officer (CFO). As our CFO Eric will be a key member of our steering committee reporting to me. He will lead our continued strategy to scale our mission impact by growing and diversifying our revenue through new investments, product […]\nThe post Welcome Eric Muhlheim, our incoming Chief Financial Officer appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/mozilla/eric-muhlheim-mozilla-chief-financial-officer/",
          "publishedOn": "2021-11-08T16:53:03.000Z",
          "wordCount": 1109,
          "title": "Welcome Eric Muhlheim, our incoming Chief Financial Officer"
        },
        {
          "id": "https://blog.mozilla.org/?p=67823",
          "author": "M.J. Kelly",
          "description": "With something like 15 billion mobile phones in the world, our collective thumbs are getting a workout from swiping and tapping tiny screens all day. Check out some of our favorite pro tips and tricks for getting the most out of Firefox on your phone and tablet that might also give your thumbs and your […]\nThe post 8 Firefox pro tips and tricks for Android and iOS (plus a few more) appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/products/firefox/firefox-tips-android-ios/",
          "publishedOn": "2021-11-08T15:29:34.000Z",
          "wordCount": 1869,
          "title": "8 Firefox pro tips and tricks for Android and iOS (plus a few more)"
        },
        {
          "id": "https://blog.mozilla.org/?p=67767",
          "author": "M.J. Kelly",
          "description": "According to researchers, the average person has about 6,200 thoughts throughout the day. That’s a lot of time spent bouncing between random thought bubbles like: Does my cat understand me?  Who is Kaia Gerber’s mom? Best sneaky vegan side dishes Why is everyone talking about bones or no bones? Parkour vs slacklining Cheapest flights to […]\nThe post Life is complicated. There’s more than one way to browse to meet your needs with Firefox Focus. appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/products/firefox/firefox-focus-or-firefox/",
          "publishedOn": "2021-11-02T22:03:39.000Z",
          "wordCount": 1248,
          "title": "Life is complicated. There’s more than one way to browse to meet your needs with Firefox Focus."
        },
        {
          "id": "https://blog.mozilla.org/?p=67656",
          "author": "Mozilla",
          "description": "Today, we are rolling out a brand new Firefox homepage on Android and iOS, designed for those on-the-go, short bursts of online interactions that are constantly interrupted by life. With this new Firefox homepage we wanted to lift that heavy mental burden of remembering to finish those halfway read articles or vacation research until you […]\nThe post Firefox brings you a new homepage making it easier to jump back in to the stuff you care about on your mobile devices appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/mozilla/news/firefox-brings-you-a-new-homepage/",
          "publishedOn": "2021-11-02T13:00:15.000Z",
          "wordCount": 1603,
          "title": "Firefox brings you a new homepage making it easier to jump back in to the stuff you care about on your mobile devices"
        },
        {
          "id": "https://blog.mozilla.org/?p=67720",
          "author": "Damiano",
          "description": "Today, Firefox is launching Colorways, a new feature that allows our users to express their most authentic selves and to bring them joy while browsing the web. As we challenge what the browser has been, and expand and define the vision of what Firefox browser is and can be, part of that challenge is to […]\nThe post Introducing new Colorways for Firefox 94 appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/products/firefox/introducing-new-colorways-for-firefox-94/",
          "publishedOn": "2021-11-02T13:00:00.000Z",
          "wordCount": 2515,
          "title": "Introducing new Colorways for Firefox 94"
        },
        {
          "id": "https://blog.mozilla.org/?p=67634",
          "author": "Mozilla",
          "description": "Mozilla’s Firefox is thrilled to be named one of the nearly 100 brands within Fast Company Magazine’s inaugural and high-profile, Brands That Matter 2021 ranking and recognition program for companies and nonprofits that have had an undeniable impact on business and culture. Mozilla’s Firefox was recognized by Fast Company specifically for “continuing to do what […]\nThe post Mozilla’s Firefox named in inaugural Brands That Matter appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/mozilla/mozillas-firefox-named-in-inaugural-brands-that-matter/",
          "publishedOn": "2021-10-28T16:16:50.000Z",
          "wordCount": 1130,
          "title": "Mozilla’s Firefox named in inaugural Brands That Matter"
        },
        {
          "id": "https://blog.mozilla.org/?p=67442",
          "author": "M.J. Kelly",
          "description": "Have you ever been in that situation where you need to give your email address over, but you don’t want to? There could be a security reason. Can you trust who you’re sharing with not to spam your inbox? Are you certain they won’t expose you to data breaches due to lax security on their […]\nThe post Tired of spam? A burner email account could be the answer. appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/products/firefox/burner-email-firefox-relay/",
          "publishedOn": "2021-10-27T16:15:00.000Z",
          "wordCount": 1551,
          "title": "Tired of spam? A burner email account could be the answer."
        },
        {
          "id": "https://blog.mozilla.org/?p=67618",
          "author": "Mozilla",
          "description": "Slate and Mozilla’s Pocket have extended their ‘Behind The Podcasts’ collaboration, partnering on a series of new Pocket Collections to provide podcast and Pocket fans with even more opportunities to explore the behind-the-scenes stories that inspired some of Slate’s most successful podcasts. This November, Pocket readers can look forward to all-new collections curated by Slate’s […]\nThe post More Stories Behind the Podcasts: Slate’s Latest Curated Collections on Pocket appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/products/pocket/slate-pocket-partnership-slow-burn-season-6/",
          "publishedOn": "2021-10-27T13:00:00.000Z",
          "wordCount": 1231,
          "title": "More Stories Behind the Podcasts: Slate’s Latest Curated Collections on Pocket"
        },
        {
          "id": "https://blog.mozilla.org/?p=67585",
          "author": "Mozilla",
          "description": "This is a story of how one email almost cleared out my life savings. Finding my dream home  My husband and I had relocated to a new city and had been renting for two and a half years. We were finally ready to buy our own place and stop throwing money away on rent, and […]\nThe post Hacked! How finding my dream home almost led me to a financial nightmare appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/internet-culture/hacked-real-estate-scam/",
          "publishedOn": "2021-10-22T01:08:43.000Z",
          "wordCount": 1836,
          "title": "Hacked! How finding my dream home almost led me to a financial nightmare"
        },
        {
          "id": "https://blog.mozilla.org/?p=67568",
          "author": "Mitchell Baker",
          "description": "I am delighted to share that Imo Udom has joined Mozilla as Senior Vice President, Innovation Ecosystems. Imo brings a unique combination of strategy, technical and product expertise and an entrepreneurial spirit to Mozilla and our work to design, develop and deliver new products and services.  While Mozilla is no stranger to innovation, this role […]\nThe post Welcome Imo Udom, Mozilla’s new Senior Vice President, Innovation Ecosystems appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/mozilla/welcome-imo-udom-mozillas-new-senior-vice-president-innovation-ecosystems/",
          "publishedOn": "2021-10-19T16:09:03.000Z",
          "wordCount": 1051,
          "title": "Welcome Imo Udom, Mozilla’s new Senior Vice President, Innovation Ecosystems"
        },
        {
          "id": "https://blog.mozilla.org/?p=67517",
          "author": "Mozilla",
          "description": "This is a story about paying a steep price for a pair of cheap socks. The first loose thread in June One Tuesday morning as I* was having my coffee and toast before kicking off the work day, I got a text from my credit card company alerting me to a suspected fraud charge. Of […]\nThe post Hacked! Unravelling a data breach appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/internet-culture/hacked-unravelling-a-data-breach/",
          "publishedOn": "2021-10-14T21:30:24.000Z",
          "wordCount": 1670,
          "title": "Hacked! Unravelling a data breach"
        },
        {
          "id": "http://blog.mozilla.org/foxtail/2017/04/21/https-protect/",
          "author": "M.J. Kelly",
          "description": "We have long advised Web users to look for HTTPS and the lock icon in the address bar of their favorite browser (Firefox!) before typing passwords or other private information into a website. These are solid tips, but it’s worth digging deeper into what HTTPS does and doesn’t do to protect your online security and […]\nThe post HTTPS and your online security appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/products/firefox/https-protect/",
          "publishedOn": "2021-10-13T21:47:32.000Z",
          "wordCount": 1779,
          "title": "HTTPS and your online security"
        },
        {
          "id": "https://blog.mozilla.org/?p=67466",
          "author": "Mozilla",
          "description": "One of our promises this year was to deliver ways that can help you navigate the web easily and get you quickly where you need to go. We took a giant step in that direction earlier this year when we shared a new Firefox experience. We were on a mission to save you time and […]\nThe post News from Firefox Focus and Firefox on Mobile appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/mozilla/news/news-from-firefox-focus-and-firefox-on-mobile/",
          "publishedOn": "2021-10-05T13:00:00.000Z",
          "wordCount": 1502,
          "title": "News from Firefox Focus and Firefox on Mobile"
        },
        {
          "id": "https://blog.mozilla.org/?p=67429",
          "author": "M.J. Kelly",
          "description": "You might have heard of VPNs — virtual private networks — at some point, and chalked them up to something only “super techy” people or hackers would ever use. At this point in the evolution of online life, however, VPNs have become more mainstream, and anyone may have good reasons to use one. VPNs are […]\nThe post Do you need a VPN at home? Here are 5 reasons you might. appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/products/mozilla-vpn/do-you-need-a-vpn-at-home-here-are-5-reasons-you-might/",
          "publishedOn": "2021-10-04T15:50:00.000Z",
          "wordCount": 1202,
          "title": "Do you need a VPN at home? Here are 5 reasons you might."
        },
        {
          "id": "https://blog.mozilla.org/?p=67511",
          "author": "Damiano",
          "description": "At Mozilla, we believe part of making the internet we want is celebrating the best of the internet, and that can be as simple as sharing a tweet that made us pause in our feed. Twitter isn’t perfect, but there are individual tweets that come pretty close. Each week in Top Shelf, we will be […]\nThe post Miracle Whip, Finstas, #InternationalPodcastDay, and #FreeBritney all made the Top Shelf this week appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/internet-culture/best-tweets-miracle-whip-finstas-internationalpodcastday-freebritney-oct-1/",
          "publishedOn": "2021-10-01T22:12:36.000Z",
          "wordCount": 1164,
          "title": "Miracle Whip, Finstas, #InternationalPodcastDay, and #FreeBritney all made the Top Shelf this week"
        },
        {
          "id": "https://blog.mozilla.org/?p=67487",
          "author": "Eric Rescorla",
          "description": "Fingerprinting is a major threat to user privacy on the Web. Fingerprinting uses existing properties of your browser like screen size, installed add-ons, etc. to create a unique or semi-unique identifier which it can use to track you around the Web. Even if individual values are not particularly unique, the combination of values can be […]\nThe post Analysis of  Google’s Privacy Budget Proposal appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/mozilla/google-privacy-budget-analysis/",
          "publishedOn": "2021-10-01T16:00:00.000Z",
          "wordCount": 1309,
          "title": "Analysis of  Google’s Privacy Budget Proposal"
        },
        {
          "id": "https://blog.mozilla.org/?p=67455",
          "author": "Jenifer Boscacci",
          "description": "A password is like a key to your house. In the online world, your password keeps your house of personal information safe, so a super strong password is like having a superhero in a fight of good vs. evil. In recognition of Cybersecurity Awareness month, we revisited our “Princesses make terrible passwords for Disney+ and […]\nThe post Superhero passwords may be your kryptonite wherever you go online appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/mozilla/news/superhero-passwords-may-be-your-kryptonite-wherever-you-go-online/",
          "publishedOn": "2021-10-01T13:00:41.000Z",
          "wordCount": 1470,
          "title": "Superhero passwords may be your kryptonite wherever you go online"
        },
        {
          "id": "https://blog.mozilla.org/?p=67369",
          "author": "M.J. Kelly",
          "description": "In real estate, the age old mantra is “location, location, location,” meaning that location drives value. That’s true even when it comes to data collection in the online world, too — your location history is valuable, authentic information. In all likelihood, you’re leaving a breadcrumb trail of location data every day, but there are a […]\nThe post Location history: How your location is tracked and how you can limit sharing it appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/internet-culture/mozilla-explains/location-history/",
          "publishedOn": "2021-09-21T22:00:42.000Z",
          "wordCount": 1466,
          "title": "Location history: How your location is tracked and how you can limit sharing it"
        },
        {
          "id": "https://blog.mozilla.org/?p=67335",
          "author": "Jonathan Claudius",
          "description": "Spyware has been in the news recently with stories like the Apple security vulnerability that allowed devices to be infected without the owner knowing it, and a former editor of The New York Observer being charged with a felony for unlawfully spying on his spouse with spyware. Spyware is a sub-category of malware that’s aimed […]\nThe post Did you hear about Apple’s security vulnerability? Here’s how to find and remove spyware. appeared first on The Mozilla Blog.",
          "link": "https://blog.mozilla.org/en/internet-culture/mozilla-explains/find-and-remove-spyware/",
          "publishedOn": "2021-09-20T16:00:57.000Z",
          "wordCount": 2037,
          "title": "Did you hear about Apple’s security vulnerability? Here’s how to find and remove spyware."
        }
      ]
    },
    {
      "title": "A List Apart: The Full Feed",
      "feedUrl": "https://alistapart.com/main/feed/",
      "siteUrl": "https://alistapart.com",
      "articles": [
        {
          "id": "https://alistapart.com/article/how-to-sell-ux-research/",
          "author": "by",
          "description": "Do you find yourself designing screens with only a vague idea of how the things on the screen relate to the things elsewhere in the system? Do you leave stakeholder meetings with unclear directives that often seem to contradict previous conversations? You know a better understanding of user needs would help the team get clear on what you are actually trying to accomplish, but time and budget for research is tight. When it comes to asking for more direct contact with your users, you might feel like poor Oliver Twist, timidly asking, “Please, sir, I want some more.” \nHere’s the trick. You need to get stakeholders themselves to identify high-risk assumptions and hidden complexity, so that they become just as motivated as you to get answers from users. Basically, you need to make them think it…",
          "link": "https://alistapart.com/article/how-to-sell-ux-research/",
          "publishedOn": "2021-10-21T14:00:00.000Z",
          "wordCount": 4062,
          "title": "How to Sell UX Research with Two Simple Questions"
        },
        {
          "id": "https://alistapart.com/article/a-content-model-is-not-a-design-system/",
          "author": "by",
          "description": "Do you remember when having a great website was enough? Now, people are getting answers from Siri, Google search snippets, and mobile apps, not just our websites. Forward-thinking organizations have adopted an omnichannel content strategy, whose mission is to reach audiences across multiple digital channels and platforms.\nBut how do you set up a content management system (CMS) to reach your audience now and in the future? I learned the hard way that creating a content model—a definition of content types, attributes, and relationships that let people and systems understand content—with my more familiar design-system thinking would capsize my customer’s omnichannel content strategy. You can avoid that outcome by creating content models that are semantic and that also connect related content.…",
          "link": "https://alistapart.com/article/a-content-model-is-not-a-design-system/",
          "publishedOn": "2021-09-23T14:00:00.000Z",
          "wordCount": 2436,
          "title": "A Content Model Is Not a Design System"
        }
      ]
    },
    {
      "title": "Pluralistic: Daily links from Cory Doctorow",
      "feedUrl": "https://pluralistic.net/feed/",
      "siteUrl": "https://pluralistic.net",
      "articles": [
        {
          "id": "https://pluralistic.net/?p=2864",
          "author": "Cory Doctorow",
          "description": "Today's links This is your Congress on drugs: Corruption kills. Harvard is full of rich, white low-achievers: 43% of white Harvard students didn't get in on merit. This day in history: 2001, 2006, 2011, 2016, 2020 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading This is your Congress on drugs (permalink) Back in 2014, a pair of political scientists published a study of 1,779 US \"policy issues\" over 20 years, concluding that elected officials make policy to benefit the richest ten percent of the country to the exclusion of the needs of everyone else. https://www.cambridge.org/core/journals/perspectives-on-politics/article/testing-theories-of-american-politics-elites-interest-groups-and-average-citizens/62327F513959D0A304D4893B382B992B Thi…",
          "link": "https://pluralistic.net/2021/11/18/bipartisan-consensus/",
          "publishedOn": "2021-11-18T15:03:38.000Z",
          "wordCount": 1782,
          "title": "Pluralistic: 18 Nov 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2856",
          "author": "Cory Doctorow",
          "description": "Today's links Aspiration's comprehensively deceptive greenwashing: It's \"do well\" OR \"do good.\" Live Nation is to blame for the Astroworld deaths: Monopoly kills fandom, literally. This day in history: 2006, 2011, 2016 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Aspiration's comprehensively deceptive greenwashing (permalink) It's impossible to miss Aspiration's star-studded marketing blitz, in which a succession of A-listers promise you that you can save the planet by switching credit-cards (\"Do good. Do well.\"). They're emblematic of the promise of green capitalism, the idea that climate emergency is about a slight misconfiguration of the profit motive and the finance sector. If that's true, it's great news for our species, our civ…",
          "link": "https://pluralistic.net/2021/11/17/do-well-do-good-do-nothing/",
          "publishedOn": "2021-11-17T20:31:58.000Z",
          "wordCount": 2724,
          "title": "Pluralistic: 17 Nov 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2848",
          "author": "Cory Doctorow",
          "description": "Today's links What Police Get When They Get Your Phone: A new season of EFF's podcast, on cop-tech and what to do about it. This day in history: 2006, 2011, 2016, 2020 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading What Police Get When They Get Your Phone (permalink) It's not surprising that the debate over digital rights is dominated by technologists – after all, spotting risks (and promises) of technology requires a technical understanding. Likewise, it's not surprising that technologists are accused of solutionism – they've got a hammer, and they're gonna look for nails. The problem with this critique is that not every tech intervention is solutionism. I mean, sure, social problems are caused by social relations, but tech can change…",
          "link": "https://pluralistic.net/2021/11/16/cop-tech/",
          "publishedOn": "2021-11-16T17:33:45.000Z",
          "wordCount": 1914,
          "title": "Pluralistic: 16 Nov 2021",
          "enclosure": {
            "url": "https://archive.org/download/h2fti-ep1-harlan-yu-mix-vfinal/h2fti-ep1-harlan-yu-mix-vfinal.mp3",
            "length": "0",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://pluralistic.net/?p=2841",
          "author": "Cory Doctorow",
          "description": "Today's links Vizio makes more money spying on people who buy TVs than it does on TVs themselves: Even if you're paying for the product, you're still the product. This day in history: 2011, 2016 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Vizio makes more money spying on people who buy TVs than it does on TVs themselves (permalink) In the simplistic account of what many call \"surveillance capitalism,\" the original sin was swapping our attention for free content, summed up in the pithy phrase, \"If you're not paying for the product, you're the product.\" That's a comforting frame if you think that the problem with surveillance capitalism is surveillance, rather than capitalism. If you think that some companies want to make money the ho…",
          "link": "https://pluralistic.net/2021/11/14/still-the-product/",
          "publishedOn": "2021-11-14T16:00:15.000Z",
          "wordCount": 1981,
          "title": "Pluralistic: 14 Nov 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2835",
          "author": "Cory Doctorow",
          "description": "Today's links How to be safe(r) online: Ars Technica's excellent guide, by Sean Gallagher. This day in history: 2006, 2011, 2016, 2020 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading How to be safe(r) online (permalink) I flatter myself that I am pretty secure online. I've written a series of global bestsellers about information security, I've worked for EFF for nearly 20 years, I've given keynotes at some of the world's largest infosec conferences. And yet, I have been hacked. It wasn't even very sophisticated! It was in 2010. My kid had made a fuss about going to day-care so my wife and I were late walking to work. The cafe we always stopped at for a coffee had longer lines at that hour, so I stood in line while she sat down and read …",
          "link": "https://pluralistic.net/2021/11/13/opsec-soup-to-nuts/",
          "publishedOn": "2021-11-13T16:16:17.000Z",
          "wordCount": 2974,
          "title": "Pluralistic: 13 Nov 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2828",
          "author": "Cory Doctorow",
          "description": "Today's links American corporate criminals in the crosshairs (finally): Lisa Monaco says she's gonna enforce those bullshit deferred prosecution agreements. This day in history: 2001, 2011, 2016, 2020 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading American corporate criminals in the crosshairs (finally) (permalink) Though corporations in America routinely break the law, often with fatal consequences, it's fair to say America has no corporate criminals, because to have criminals, you need a criminal system that identifies criminal conduct and holds it to account. America does not have that. https://pluralistic.net/2021/10/12/no-criminals-no-crimes/#get-out-of-jail-free-card When American corporations break the law, the individuals in th…",
          "link": "https://pluralistic.net/2021/11/12/with-a-fountain-pen/",
          "publishedOn": "2021-11-12T18:10:38.000Z",
          "wordCount": 1913,
          "title": "Pluralistic: 12 Nov 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2818",
          "author": "Cory Doctorow",
          "description": "Today's links Risk compensation considered harmful: HPV vaccines, N95s, seatbelts, helmets and the Chicago Boys. This day in history: 2011, 2016, 2020 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Risk compensation considered harmful (permalink) The politicization of covid started early, with the \"noble lie\" that masks wouldn't prevent the spread of the disease, a lie told in a bid to prevent panic-shoppers buying up all the N95s that health workers needed. https://www.nytimes.com/2020/03/17/opinion/coronavirus-face-masks.html Safety talk is often a pretext: sometimes paternalistic, sometimes authoritarian and sometimes (ironically) anti-regulatory. The British \"health and safety gone mad\" panic of the 1990s is a perfect microcosm of …",
          "link": "https://pluralistic.net/2021/11/10/elfin-safety/",
          "publishedOn": "2021-11-10T15:00:54.000Z",
          "wordCount": 1780,
          "title": "Pluralistic: 10 Nov 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2811",
          "author": "Cory Doctorow",
          "description": "Today's links Stockholm's war on interoperability: An object lesson in how (not) to resolve the tension between comcom and privacy. This day in history: 2006, 2011, 2016, 2020 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Stockholm's war on interoperability (permalink) The city of Stockholm commissioned Skolplattform, an omnibus app to deliver timely information to students, teachers and parents. It was a mess: a late, SEK 1B (USD 117M) \"IT disaster\" boondoggle with a 1.2 star rating. https://play.google.com/store/apps/details?id=se.stockholm.vardnadshavare&amp;hl=en&amp;gl=US Among the groups that were poorly served by the app were parents, and among those parents was Christian Landgren, a software developer. Landgren created a strea…",
          "link": "https://pluralistic.net/2021/11/09/skrota-skolplattformen/",
          "publishedOn": "2021-11-09T14:59:56.000Z",
          "wordCount": 2444,
          "title": "Pluralistic: 09 Nov 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2803",
          "author": "Cory Doctorow",
          "description": "Today's links Imagining the end of capitalism: TINA, TAPAS, and Ministry for the Future. Charlie Jane Anders' Victories Greater Than Death: YA space opera that is thoroughly modern and crackling with adventure. Right-Clicker-Mentality: Bezzlers coin a phrase to describe the anti-bezzle. This day in history: 2006, 2011, 2016 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Imagining the end of capitalism (permalink) My latest column for Locus Magazine is \"The Unimaginable,\" about the relationship of science fiction plays to the future. Sf is a literature of inspiration and warning, not prediction. https://locusmag.com/2021/11/cory-doctorow-the-unimaginable/ I mean, thank goodness. If the future was predictable, there'd be no point in gett…",
          "link": "https://pluralistic.net/2021/11/08/tina-v-tapas/",
          "publishedOn": "2021-11-08T17:28:38.000Z",
          "wordCount": 2860,
          "title": "Pluralistic: 08 Nov 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2789",
          "author": "Cory Doctorow",
          "description": "Today's links LaserWriter II: Tamara Shopsin's celebration of the heroic era of the Mac. This day in history: 2001, 2006, 2011, 2016, 2020 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading LaserWriter II (permalink) \"LaserWriter II\" is Tamara Shopsin's fictionalized history of Tekserv, NYC's legendary Apple computer repair store. It's a vivid, loving, heartfelt portrait of an heroic moment in the history of personal computing: a moment when computers transformed lives and captured the hearts of people in every field of endeavor. https://us.macmillan.com/books/9780374602581/laserwriterii Shopsin, of course, is one of the Shopsins, of Shopsin's Restaurant, the famously eccentric, floridly weird, and completely and utterly amazing NYC instit…",
          "link": "https://pluralistic.net/2021/10/29/norwegian-potato-flour-enchiladas/",
          "publishedOn": "2021-10-30T02:12:11.000Z",
          "wordCount": 1774,
          "title": "Pluralistic: 29 Oct 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2783",
          "author": "Cory Doctorow",
          "description": "Today's links The new DRM-breaking exemptions just dropped: But here's the bad news… All of science gets a general index: For your text-mining pleasure, courtesy of Carl Malamud and Public Resource. Europe's trustbusters lose the plot: Filternet, made in Europe. This day in history: 2001, 2006, 2011, 2016, 2020. Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading The new DRM-breaking exemptions just dropped (permalink) The DMCA was signed into law by Bill Clinton in 1998. It has a weird history. Its inception came from Bruce Lehmann, Microsoft's chief copyright enforcer, whom Clinton tapped to serve as his Copyright Czar. This was back in the \"Information Superhighway\" days, when Al Gore was holding hearings on the demilitarization and comm…",
          "link": "https://pluralistic.net/2021/10/28/clintons-ghost/",
          "publishedOn": "2021-10-28T16:39:32.000Z",
          "wordCount": 4353,
          "title": "Pluralistic: 28 Oct 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2779",
          "author": "Cory Doctorow",
          "description": "Today's links Hospital rings up $2755 upcharge by sending pregnant woman to ER: Poudre Valley Hospital is a clip-joint. This day in history: 2001, 2006, 2011, 2016, 2020. Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Hospital rings up $2755 upcharge by sending pregnant woman to ER (permalink) \"American health care billing horror stories\" is one of my favorite, love-to-hate-it genres. The 24/7 gaslighting delivered by the health-industrial complex is quite a mind-zap and it's nice to get these reminders that we're not all hallucinating here. If you'd like an unrolled version of this thread to read or share, here's a link to it on pluralistic.net, my surveillance-free, ad-free, tracker-free blog: https://pluralistic.net/2021/10/27/cross…",
          "link": "https://pluralistic.net/2021/10/27/crossing-a-line/",
          "publishedOn": "2021-10-27T17:31:03.000Z",
          "wordCount": 1813,
          "title": "Pluralistic: 27 Oct 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2773",
          "author": "Cory Doctorow",
          "description": "Today's links Maxing out our global credit-card with authoritarian debt: Or, why countries are spending more on \"border security\" than the climate emergency. This day in history: 2006, 2011, 2016, 2020 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Maxing out our global credit-card with authoritarian debt (permalink) People who fret about the debt we're taking on to deal with climate change are (half) right. Because there's two ways of dealing with the climate emergency: either we can avert it, or we can seek high ground and erect high walls. Guess which one we're doing. Yeah. The world's richest countries are on track to spending more on their \"border defense\" than they are on their climate commitments. Molly Taft breaks it down for G…",
          "link": "https://pluralistic.net/2021/10/26/inequality-and-guard-labor/",
          "publishedOn": "2021-10-26T15:59:35.000Z",
          "wordCount": 2375,
          "title": "Pluralistic: 26 Oct 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2769",
          "author": "Cory Doctorow",
          "description": "Today's links The Dems' most secret Congressional committee: The Steering and Policy Committee runs the show and we're not even allowed to know who's on it. Podcasting \"Against The Great Forces of History\": What Ada Palmer’s University of Chicago Papal election LARP can teach us about our own future. This day in history: 2011, 2016, 2020 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading The Dems' most secret Congressional committee (permalink) \"Personnel is policy\": the leader of an organization can set its tenor, priorities, and culture. That's especially true when it comes to Congressional committee leadership. Committee chairs decide when to hold hearings, which witnesses to call, whether to advance a bill or tie it up. Committee chair…",
          "link": "https://pluralistic.net/2021/10/25/people-do-stuff/",
          "publishedOn": "2021-10-25T16:40:11.000Z",
          "wordCount": 2288,
          "title": "Pluralistic: 25 Oct 2021",
          "enclosure": {
            "url": "https://archive.org/download/Cory_Doctorow_Podcast_406/Cory_Doctorow_Podcast_406_-_Against_the_Great_Forces_of_History.mp3",
            "length": "0",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://pluralistic.net/?p=2764",
          "author": "Cory Doctorow",
          "description": "Today's links Cyber-mercenaries helped Saudis hack an NYT reporter: Citizen Lab caught the NSO Group in a(nother) war crime. This day in history: 2001, 2006, 2011, 2016, 2020. Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Cyber-mercenaries helped Saudis hack an NYT reporter (permalink) The NSO Group are among the world's most notorious cyber-mercenaries; they're an Israeli firm under UK/EU private equity control (the owners have previously threatened to sue me and other journalists for reporting on the company's ownership structure). The company claims to be a \"lawful interception\" supplier, helping democratic, human-rights-respecting governments to spy on terrorists. Their extreme secrecy helps them sell this tale, but thanks to a gr…",
          "link": "https://pluralistic.net/2021/10/24/breaking-the-news/",
          "publishedOn": "2021-10-24T15:52:28.000Z",
          "wordCount": 2068,
          "title": "Pluralistic: 24 Oct 2021",
          "enclosure": {
            "url": "https://ia801807.us.archive.org/27/items/asl-politics/Politics%20and%20Protest%20with%20Eva%20Galperin%20and%20Ron%20Deibert.mp3",
            "length": "34597824",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://pluralistic.net/?p=2753",
          "author": "Cory Doctorow",
          "description": "Today's links Imperfections in your Bluetooth beacons allow for unstoppable tracking: Fingerprinting BLE with minor material variations in radio hardware. This day in history: 2011, 2016, 2020 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Imperfections in your Bluetooth beacons allow for unstoppable tracking (permalink) It's often said that there is a trade-off between privacy and convenience – while that's often overstated, there are some ways in which it is inarguably true. For example, it would be convenient to give all your devices radio chips that constantly broadcasted a unique number, and whenever one of our mobile devices encountered a radio beacon, it could log the event and the location. Then, if we wanted to find something …",
          "link": "https://pluralistic.net/2021/10/21/sidechannels/",
          "publishedOn": "2021-10-21T12:31:15.000Z",
          "wordCount": 1442,
          "title": "Pluralistic: 21 Oct 2021",
          "enclosure": {
            "url": "https://hwcdn.libsyn.com/p/9/8/5/9856f0a69bce6f51/EP315_ClockworkFagin.mp3?c_id=3894040&amp",
            "length": "0",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://pluralistic.net/?p=2749",
          "author": "Cory Doctorow",
          "description": "Today's links Copyleft lawsuit against Vizio will allow anyone to defend the commons: Software Freedom Conservancy realizes the dream of \"Community-Oriented GPL Enforcement.\" The monopoly strategy behind the Google/Microsoft mobile patent wars: The victory condition isn't highest profits, it's market dominance. This day in history: 2006, 2011, 2016, 2020. Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Copyleft lawsuit against Vizio will allow anyone to defend the commons (permalink) When the free software movement started to make headway, proprietary software companies like Microsoft went to war against it, describing the licenses at its core (like the GPL) as \"viral licenses\" to scare companies off from using free software. The GPL is…",
          "link": "https://pluralistic.net/2021/10/20/vizio-vs-the-world/",
          "publishedOn": "2021-10-20T17:19:18.000Z",
          "wordCount": 2551,
          "title": "Pluralistic: 20 Oct 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2741",
          "author": "Cory Doctorow",
          "description": "Today's links The true, Terry Pratchett-esque origins of the trillion-dollar coin: It's a feature, not a bug. This day in history: 2001, 2006, 2011, 2016, 2020 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading The true, Terry Pratchett-esque origins of the trillion-dollar coin (permalink) The debt ceiling debate is genuinely absurd: Congress authorized the spending of new dollars, so the Treasury has to create them. For Congress to turn around and force the Treasury not to create the dollars it ordered the Treasury to create is an obvious political gimmick. Hence the trillion dollar coin – a proposal to use a 2000 amendment to 31USC§5112k (\"Denominations, specifications, and design of coins\") that permits the Treasury Secretary to \"mint a…",
          "link": "https://pluralistic.net/2021/10/19/moist-von-lipwig/",
          "publishedOn": "2021-10-19T15:56:12.000Z",
          "wordCount": 2126,
          "title": "Pluralistic: 19 Oct 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2735",
          "author": "Cory Doctorow",
          "description": "Today's links Corporatism made John Deere ripe for a strike: Optimized for failure. Copyfraudster censors investigation of implausible covid gadget: When a US law is used to censor Indian scientific reporting. At last, a new Econ 101 textbook: CORE's \"The Economy\" vs homo economicus. Podcasting \"Dead Letters\": Email could be the last federated internet technology – but it isn't. This day in history: 2001, 2006, 2011, 2016, 2020 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Corporatism made John Deere ripe for a strike (permalink) The 10,000 workers striking John Deere represent the tension between Stein's Law (\"trends that can't continue won't\") and Keynes's \"The market can remain irrational longer than you can remain solvent.\" Deere …",
          "link": "https://pluralistic.net/2021/10/18/labor-shortage-discourse-time/",
          "publishedOn": "2021-10-18T16:54:47.000Z",
          "wordCount": 3985,
          "title": "Pluralistic: 18 Oct 2021",
          "enclosure": {
            "url": "https://ia601408.us.archive.org/16/items/Cory_Doctorow_Podcast_405/Cory_Doctorow_Podcast_405_-_Dead_Letters.mp3",
            "length": "27025408",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://pluralistic.net/?p=2726",
          "author": "Cory Doctorow",
          "description": "Today's links The Chicago Tribune is being murdered before our eyes: And it's a serial killing. This day in history: 2001, 2020. Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading The Chicago Tribune is being murdered before our eyes (permalink) Last May, the profitable Chicago Tribune was acquired by the notorious vulture firm Alden Global Capital. They suffered waves of downsizing, including a sell-off of the iconic Tribute Building. Today, a skeleton crew puts out the Trib from \"a newsroom the size of a Chipotle.\" In a long, deeply reported article about Alden for The Atlantic, McKay Coppins catalogs the civic losses that Chicago suffered when its major daily newspaper was bought and strangled by Alden and its secretive, far-right owner…",
          "link": "https://pluralistic.net/2021/10/16/sociopathic-monsters/",
          "publishedOn": "2021-10-16T23:59:39.000Z",
          "wordCount": 2745,
          "title": "Pluralistic: 16 Oct 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2722",
          "author": "Cory Doctorow",
          "description": "Today's links ROT 8000 and what \"security\" means: AKA, \"infosec is a team sport.\" This day in history: 2001, 2006, 2011, 2016, 2020 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading ROT 8000 and what \"security\" means (permalink) If you're an Internet Person of a Certain Vintage, you'll likely experience the same thrill of delight I felt this morning when I discovered ROT8000, a Unicode version of the old ROT13 cipher. But after I finished smiling, I got to thinking. http://rot8000.com/Index ROT13 is a toy cipher with a simple method for scrambling text – simply change each character in the message to the character that comes 13 letters after it in the alphabet: A=M, B=N, C=O, etc. You're ROTating each character 13 positions forward – henc…",
          "link": "https://pluralistic.net/2021/10/15/fargo-north-decoder/",
          "publishedOn": "2021-10-15T17:54:57.000Z",
          "wordCount": 2299,
          "title": "Pluralistic: 15 Oct 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2712",
          "author": "Cory Doctorow",
          "description": "Today's links Charter uses bad credit threats to corral ex-subscribers: \"Resubscribe or we'll keep trashing your credit report.\" Adobe uses copyfraud to preserve spyware: A free-as-in-surveillance-free Flash installer is gone thanks to a bogus copyright claim. India funded a starving kids' app, but not food: Solutionism at its worst. This day in history: 2011, 2016, 2020 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Charter uses bad credit threats to corral ex-subscribers (permalink) I'm more of a Charter-Spectrum hostage than a customer: I need the internet to earn my living, and my town (Burbank) has signed an exclusive deal with Charter, so I send them $134.99/mo for some of the worst internet in California. It turns out that Chart…",
          "link": "https://pluralistic.net/2021/10/13/theres-an-app-for-that/",
          "publishedOn": "2021-10-13T16:26:24.000Z",
          "wordCount": 2840,
          "title": "Pluralistic: 13 Oct 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2703",
          "author": "Cory Doctorow",
          "description": "Today's links This Thing Between Us, a neck-hair-stand-up cuycuy horror: Gus Moreno's debut novel. There are no corporate criminals in America: Because America doesn't have corporate crime prosecutions. This day in history: 2001, 2006, 2011, 2016, 2020 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading This Thing Between Us, a neck-hair-stand-up cuycuy horror (permalink) Gus Moreno's debut novel, \"This Thing Between Us,\" is a genuinely creepy supernatural horror novel, a book that made the hairs on the back of my neck stand up and prompted me to turn on the nightlight at bedtime. https://www.fsgoriginals.com/books/this-thing-between-us I almost didn't read it. It's billed as a book about a widower whose smart-speaker is haunted by his wife…",
          "link": "https://pluralistic.net/2021/10/12/no-criminals-no-crimes/",
          "publishedOn": "2021-10-12T18:22:40.000Z",
          "wordCount": 2965,
          "title": "Pluralistic: 12 Oct 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2697",
          "author": "Cory Doctorow",
          "description": "Today's links Podcasting \"Hope, Not Optimism\": A theory of change based on truth, not fiction. This day in history: 2001, 2006, 2011, 2016, 2020 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Podcasting \"Hope, Not Optimism\" (permalink) This week on my podcast, a reading of my latest Medium column, \"Hope, not optimism,\" in which I describe a theory of change that distinguishes activism from novelism. https://doctorow.medium.com/hope-not-optimism-943e88291b Plotting a novel is a process of radical simplification: a character goes through a linear progression of challenges of increasing difficulty and consequence, until the stakes are raised to their utmost when the tale reaches its climax. That's nothing like the real world (perhaps that…",
          "link": "https://pluralistic.net/2021/10/11/consider-the-ant/",
          "publishedOn": "2021-10-11T15:26:55.000Z",
          "wordCount": 2259,
          "title": "Pluralistic: 11 Oct 2021",
          "enclosure": {
            "url": "https://archive.org/download/Cory_Doctorow_Podcast_404/Cory_Doctorow_Podcast_404_-_Hope_Not_Optimism.mp3",
            "length": "0",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://pluralistic.net/?p=2692",
          "author": "Cory Doctorow",
          "description": "Today's links Facebook shouldn't be in charge of how you use Facebook: Unfollow Everything and the need for (good) tech regulation. This day in history: 2006, 2011, 2016 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Facebook shouldn't be in charge of how you use Facebook (permalink) The Facebook whistleblower's testimony was refreshing and frightening by turns, revealing the company's awful internal culture, where product design decisions that benefited its users were sidelined if they were bad for its shareholders. The big question now is, what do we do about it? The whistleblower, Frances Haugen rejected the idea that Facebook's power should be diminished; rather, she argued that it should be harnessed – put under the supervision of…",
          "link": "https://pluralistic.net/2021/10/08/unfollow-everything/",
          "publishedOn": "2021-10-08T17:55:31.000Z",
          "wordCount": 2771,
          "title": "Pluralistic: 08 Oct 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2687",
          "author": "Cory Doctorow",
          "description": "Today's links DoS a federal agency, then charge for access: Enq carries on a tradition of genuinely terrible startup ideas. \"Inclusive Access\" allows textbook monopolists to permanently consolidate their gains: Universities are auto-billing students for high-priced, self-destructing textbooks they can't loan or sell. Scottish Limited Partnerships are still laundering criminal millions: Offshore is actually onshore. This day in history: 2011, 2016, 2020 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading DoS a federal agency, then charge for access (permalink) There's a hell of a zap that neoclassical economics puts on your head. After being brainwashed to think that markets \"naturally emerge\" wherever a shortage occurs, a certain kind of ev…",
          "link": "https://pluralistic.net/2021/10/07/markets-in-everything/",
          "publishedOn": "2021-10-07T16:12:06.000Z",
          "wordCount": 2483,
          "title": "Pluralistic: 07 Oct 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2681",
          "author": "Cory Doctorow",
          "description": "Today's links We paid to develop Merck's covid pill: And now they're charging us a 4,000% markup on it. This day in history: 2016, 2020. Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading We paid to develop Merck's covid pill (permalink) Comparing the government to a household or a business isn't merely inapt (a government is a currency creator, while a household is a currency user – their budgeting constraints are totally unrelated) – it's also profoundly dishonest. Like, if you really are worried about government \"living beyond its means,\" then you should freak out every time Congress writes a $715B no-strings-attached check to the Pentagon, or sends $258B to the ultra-rich as part of the CARES Act. https://www.propublica.org/article/the…",
          "link": "https://pluralistic.net/2021/10/06/merck-cenary/",
          "publishedOn": "2021-10-06T16:13:40.000Z",
          "wordCount": 1799,
          "title": "Pluralistic: 06 Oct 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2672",
          "author": "Cory Doctorow",
          "description": "Today's links The Attack Surface paperback is out: And a once-in-a-lifetime deal on the Little Brother audiobooks. Dave Eggers' \"The Every\": A tragicomic look at Big Tech, following from \"The Circle.\" Open Access Ninja: \"The Brew of Law.\" This day in history: 2016, 2020 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading The Attack Surface paperback is out (permalink) It's my book-birthday! Today marks publication of the Tor (US/Canada) paperback edition of ATTACK SURFACE, a standalone adult Little Brother book. https://us.macmillan.com/books/9781250757517/attacksurface Little Brother and its sequel Homeland were young adult novels that told the tale of Marcus Yallow, a bright young activist in San Francisco who works with his peers to orga…",
          "link": "https://pluralistic.net/2021/10/05/masha-rides-again/",
          "publishedOn": "2021-10-05T15:43:11.000Z",
          "wordCount": 3236,
          "title": "Pluralistic: 05 Oct 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2663",
          "author": "Cory Doctorow",
          "description": "Today's links Podcasting \"Take It Back\": My Medium column on copyright termination and rights reversion. Savage Love A-Z: A bestiary of good sex. The Pandora Papers: Tax avoidance is tax evasion. USPS pilots postal banking: Slashing taxes (on the poor). This day in history: 2001, 2006, 2011, 2016, 2020 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Podcasting \"Take It Back\" (permalink) This week on my podcast, I read \"Take It Back,\" my Medium essay, \"Take it back: Copyright reversion, bargaining power, and authors’ rights,\" all about the obscure, but increasingly exciting realm of copyright termination at reversion. https://doctorow.medium.com/take-it-back-e3689628f4f0 What's copyright termination? Under US law, creators can file paper…",
          "link": "https://pluralistic.net/2021/10/04/avoidance-is-evasion/",
          "publishedOn": "2021-10-04T16:01:00.000Z",
          "wordCount": 4890,
          "title": "Pluralistic: 04 Oct 2021",
          "enclosure": {
            "url": "https://archive.org/download/Cory_Doctorow_Podcast_403/Cory_Doctorow_Podcast_403_-_Take_It_Back.mp3",
            "length": "0",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://pluralistic.net/?p=2658",
          "author": "Cory Doctorow",
          "description": "Today's links How the IMF loan-sharks the global south: With surcharges, the cruelty is the point. This day in history: 2006, 2011, 2016, 2020 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading How the IMF loan-sharks the global south (permalink) When you take out a loan or get a credit card, the headline figure is the \"APR\" – the annual percentage rate of interest. But anyone who's ever borrowed because they were poor and needed money has learned the hard way that APRs are pure fiction. To get the true APR (what economists politely call the \"effective\" APR) you have to factor in the fees, penalties and other gotchas that turn reasonable seeming interest rates into perennial, inescapable debt-traps. Take student debt. During the 2020 presi…",
          "link": "https://pluralistic.net/2021/10/02/debt-trap/",
          "publishedOn": "2021-10-02T17:50:22.000Z",
          "wordCount": 2405,
          "title": "Pluralistic: 02 Oct 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2647",
          "author": "Cory Doctorow",
          "description": "Today's links Facebook thrives on criticism of \"disinformation\": They'd rather be evil than incompetent. This day in history: 2016, 2020 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Facebook thrives on criticism of \"disinformation\" (permalink) The mainstream critique of Facebook is surprisingly compatible with Facebook's own narrative about its products. FB critics say that the company's machine learning and data-gathering slides disinformation past users' critical faculties, poisoning their minds. Meanwhile, Facebook itself tells advertisers that it can use data and machine learning to slide past users' critical faculties, convincing them to buy stuff. In other words, the mainline of Facebook critics start from the presumption that …",
          "link": "https://pluralistic.net/2021/09/30/dont-believe-the-criti-hype/",
          "publishedOn": "2021-09-30T18:06:31.000Z",
          "wordCount": 2763,
          "title": "Pluralistic: 30 Sep 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2638",
          "author": "Cory Doctorow",
          "description": "Today's links Debts that can't be paid, won't be paid: The first David Graeber Foundation meetup, between Thomas Piketty and Michael Hudson. \"Are you calling me a racist?\": The libertarian case for racism. Wells Fargo can't stop criming: The nation's third-biggest bank is a criminal enterprise. This day in history: 2001, 2011, 2016, 2020 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Debts that can't be paid, won't be paid (permalink) It's been just over a year since the death of activist, writer and anthropologist Gavid Graeber – a brilliant speaker, writer and thinker who helped give us Occupy, \"we are the 99%\" and \"Bullshit Jobs.\" On the anniversary of David's death, his widow Nika Dubrovsky convened the first \"Art Project\" discussi…",
          "link": "https://pluralistic.net/2021/09/29/jubilance/",
          "publishedOn": "2021-09-29T19:36:49.000Z",
          "wordCount": 4972,
          "title": "Pluralistic: 29 Sep 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2631",
          "author": "Cory Doctorow",
          "description": "Today's links Democrats can pass the reconciliation today (sorta): A bet on the 'endowment effect.' This day in history: 2001, 2016, 2020 Colophon: Resourcecent publications, upcoming/recent appearances, current writing projects, current reading Democrats can pass the reconciliation today (sorta) (permalink) This week, millions are playing Congressional Kremlinology, guessing whether House/Senate Dems have the votes for the $3.5T reconciliation package, playing Fantasy Football Sophie's Choice to cut programs if corporate Dems whittle it down. https://prospect.org/infrastructure/building-back-america/infrastructure-summer-sophies-choice-of-the-reconciliation-bill/ But as Harold Meyerson writes for The American Prospect, there's a high-stakes, high-risk gambit that would let the willing, pr…",
          "link": "https://pluralistic.net/2021/09/28/timescale-dependent/",
          "publishedOn": "2021-09-28T16:10:00.000Z",
          "wordCount": 1689,
          "title": "Pluralistic: 28 Sep 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2623",
          "author": "Cory Doctorow",
          "description": "Today's links Podcasting \"Breaking In\": Why you shouldn't take career advice from successful writers. Democrats, health care monopolies, and market failures: Market health care is a fatal disease. Shelter is a toxic asset: NIMBYism is a fatal disease. This day in history: 2001, 2016, 2020 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Podcasting \"Breaking In\" (permalink) This week on my podcast, a reading of \"Breaking In,\" my latest column for Locus Magazine. It was inspired by the writers who are just starting out and looking for advice on how to advance their careers – and my realization that I have none to give. https://locusmag.com/2021/09/cory-doctorow-breaking-in/ After all, when I broke into science fiction, the web barely exist…",
          "link": "https://pluralistic.net/2021/09/27/lethal-dysfunction/",
          "publishedOn": "2021-09-27T18:16:24.000Z",
          "wordCount": 3240,
          "title": "Pluralistic: 27 Sep 2021",
          "enclosure": {
            "url": "https://archive.org/download/Cory_Doctorow_Podcast_402/Cory_Doctorow_Podcast_402_-_Breaking_In.mp3",
            "length": "0",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "https://pluralistic.net/?p=2618",
          "author": "Cory Doctorow",
          "description": "Today's links The Scholars of Night: John M Ford was a goddamned WIZARD. This day in history: 2001, 2006, 2011, 2016, 2020 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading The Scholars of Night (permalink) John M Ford (\"Mike\" to his many friends) was one of science fiction's most accomplished writers, by which I mean, his accomplishments were so prodigious as to be slightly bewildering. If he hadn't been so mind-bogglingly quick-witted in person, it would be tempting to believe that his books were the product of several eccentric geniuses. Everything he did, he did brilliantly, and he did so very much. He was the author of several bestselling, award-winning RPG modules, and a Star Trek novel that was also a Gilbert and Sullivan musical, …",
          "link": "https://pluralistic.net/2021/09/26/mike-ford-rides-again/",
          "publishedOn": "2021-09-26T15:25:38.000Z",
          "wordCount": 1849,
          "title": "Pluralistic: 26 Sep 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2611",
          "author": "Cory Doctorow",
          "description": "Today's links Demonopolizing the internet with interoperability: My op-ed in the Communications of the ACM This day in history: 2001, 2016, 2020 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Demonopolizing the internet with interoperability (permalink) The Communications of the Association for Computing Machinery has just published my editorial, \"Competitive Compatibility: Let's Fix the Internet, Not the Tech Giants,\" explaining how interoperability was once an engine for competition and user empowerment – and how that ended. https://cacm.acm.org/magazines/2021/10/255710-competitive-compatibility/fulltext As the title suggests, regulators are fed up with Big Tech's abuses, but they're not sure what to do about it. One approach is to \"…",
          "link": "https://pluralistic.net/2021/09/24/comcom-acm/",
          "publishedOn": "2021-09-24T13:20:46.000Z",
          "wordCount": 1403,
          "title": "Pluralistic: 24 Sep 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2606",
          "author": "Cory Doctorow",
          "description": "Today's links The Halloween Moon: A YA novel from Nightvale creator Joseph Fink. The music monopolists: Thinking outside the antitrust box. This day in history: 2011, 2016 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading The Halloween Moon (permalink) In \"The Halloween Moon,\" Welcome to Nightvale co-creator Joseph Fink brings his superb, unmatchable gift for balancing the weird and the real to a spooky middle-grades novel that echoes such classics as Neil Gaiman's Coraline. https://www.harpercollins.com/products/the-halloween-moon-joseph-fink If you're a stranger to Fink's work, the thing you need to know is that Nightvale and his other projects manage to walk the tightrope between weird, creepypasta-style humor and real pathos, in a glo…",
          "link": "https://pluralistic.net/2021/09/23/remedies-beyond-antitrust/",
          "publishedOn": "2021-09-23T16:00:36.000Z",
          "wordCount": 3945,
          "title": "Pluralistic: 23 Sep 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2598",
          "author": "Cory Doctorow",
          "description": "Today's links Gig workers around the globe: One disease, many pathologies. Mutual Aid and David Graeber: A new, illustrated edition of Kropotkin's masterpiece, with an introduction from the great, much-missed hero of Occupy. Facebook algorithm boosts pro-Facebook news: Orwell was an optimist. This day in history: 2006, 2011, 2016, 2020 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Gig workers around the globe (permalink) My 2010 YA science fiction novel For the Win imagines a global solidarity movement among precarious gig workers paid to \"gold farm\" inside massively multiplayer online games. https://craphound.com/category/ftw/ The kids who do this work realize they have more in common with each other than their bosses, and form a glo…",
          "link": "https://pluralistic.net/2021/09/22/kropotkin-graeber/",
          "publishedOn": "2021-09-22T16:43:23.000Z",
          "wordCount": 3396,
          "title": "Pluralistic: 22 Sep 2021"
        },
        {
          "id": "https://pluralistic.net/?p=2590",
          "author": "Cory Doctorow",
          "description": "Today's links The Actual Star: Monica Byrne's millennium-spanning tour-de-force climate novel. Ignore career advice from established writers: We don't know anything about breaking in today. The Framework is the most exciting laptop I've ever used: Sustainable, upgradeable, repairable and powerful. This day in history: 2006, 2011, 2016, 2020 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading The Actual Star (permalink) This month marks the publication of \"The Actual Star,\" a new, wildly ambitious, wildly successful novel by Monica Byrne, spanning 3,000 years of history from the ancient Maya to a distant future. https://www.harpervoyagerbooks.com/book/9780063002913/the-actual-star/ The tale braids three moments: the collapse of the Mayan roy…",
          "link": "https://pluralistic.net/2021/09/21/monica-byrne/",
          "publishedOn": "2021-09-21T14:34:49.000Z",
          "wordCount": 3800,
          "title": "Pluralistic: 21 Sep 2021",
          "enclosure": {
            "url": "http://mpegmedia.abc.net.au/rn/podcast/2011/09/lnl_20110916_2240.mp3",
            "length": "8706688",
            "type": "audio/mpeg"
          }
        }
      ]
    },
    {
      "title": "The Candybox Blog",
      "feedUrl": "http://www.nathalielawhead.com/candybox/feed",
      "siteUrl": "http://www.nathalielawhead.com/candybox",
      "articles": [
        {
          "id": "http://www.nathalielawhead.com/candybox/?p=5173",
          "author": "alienmelon",
          "description": "I recently gave a keynote talk at the ATLAS Institute at the University of Colorado’s Whaaat!? 2021 Festival. A festival focusing on small and quirky games and experimental interactions. They’re doing wonderful work. I’m honored to have been part of this, talking about something very near and dear to my heart. This post is that keynote turned into a blog post. I’m sharing a lot of links here! Mind the in-line text links too for good resources. I hope this will be useful to people that share this same interest. ~ ~ ~ As most of you know, my work...",
          "link": "http://www.nathalielawhead.com/candybox/make-tiny-weird-software-please-all-about-desktop-pets-old-computer-eras-and-virtual-toys",
          "publishedOn": "2021-11-15T23:13:04.000Z",
          "wordCount": 6023,
          "title": "Make Tiny Weird Software, Please! (all about desktop pets, old computer eras, and virtual toys)"
        },
        {
          "id": "http://www.nathalielawhead.com/candybox/?p=5179",
          "author": "alienmelon",
          "description": "This is a continuation of my original post “In support of Wren (the abuse she endured while working on Fight Knight)“. More things have happened since I originally voiced support for Wren and I think it’s really important to discuss how this is all unfolding, in order to hold those responsible for this abuse accountable. I will do my best to be as concise as possible. I am still shook up. TW: severe content warning for all this. Hello, I'm the \"writer\" of the Dangen Warning and the former writer of Fight Knight. I feel it's important for me to...",
          "link": "http://www.nathalielawhead.com/candybox/part-2-in-support-of-wren-the-abuse-she-continues-to-endure-fight-knight-and-publicly-ridiculing-her-trauma",
          "publishedOn": "2021-11-13T01:55:14.000Z",
          "wordCount": 3864,
          "title": "Part 2: In support of Wren (the abuse she continues to endure, Fight Knight, and publicly ridiculing her trauma)"
        },
        {
          "id": "http://www.nathalielawhead.com/candybox/?p=5167",
          "author": "alienmelon",
          "description": "“There are countless tiny tools scattered across the internet, all made with love from independent developers. They might not look like much at first, but if you start using them in combiation with your Professional Everyday Tools, you open the doors for wonderful, unique, and beautiful art. This workshop will demo a tiny handful of these tiny tools, using them in combination with the Electric Zine Maker to make a zine! My hope is that you will leave inspired, and start collecting tiny tools of your own… to regularly find use for in your work.” Cool Tools itch.io collection Open...",
          "link": "http://www.nathalielawhead.com/candybox/zinecamp-workshop-using-tiny-open-source-tools-in-your-own-work-the-values-of-preservation-and-building-your-own-tiny-tool-box",
          "publishedOn": "2021-11-06T21:18:35.000Z",
          "wordCount": 2640,
          "title": "ZineCamp Workshop – using tiny open source tools in your own work, the values of preservation, and building your own tiny tool box"
        },
        {
          "id": "http://www.nathalielawhead.com/candybox/?p=5161",
          "author": "alienmelon",
          "description": "TW: For all the things. I’m writing this because it’s my birthday tomorrow and I REALLY need someone to talk to. My blog exists for that. Many moths ago… because of the ongoing Global Pandemic this feels like an eternity ago, but that’s another tangent… Someone reached out to me for help about coming forward with their story (abuse, the type of story we all know is too normal in the game space by now). This happens a lot and I try my absolute best to be as helpful as possible. I think it’s important to do that because I...",
          "link": "http://www.nathalielawhead.com/candybox/speaking-candidly-about-things-lately-there-is-no-justice-and-other-short-horror-stories",
          "publishedOn": "2021-10-20T01:07:20.000Z",
          "wordCount": 4021,
          "title": "Speaking candidly about things lately (there is no justice and other short horror stories)…"
        },
        {
          "id": "http://www.nathalielawhead.com/candybox/?p=5143",
          "author": "alienmelon",
          "description": "Following is the transcript of a talk I gave to the Interactive Media program at the Harrisburg University of Science and Technology. This talk goes over why uniqueness matters in a space like indie games. I discuss early internet and computer history, and why that history is something we can learn from to maintain the health and openness of the current “golden age” of the indie game space. Links in this slide: – alienmelon.com – unicornycopia.com – tetrageddon.com Hi everyone! My name is Nathalie and I go by alienmelon online and in my work. I’m mostly known for games like...",
          "link": "http://www.nathalielawhead.com/candybox/talk-transcript-your-uniqueness-is-your-strength-and-why-that-matters-to-the-indiegame-space",
          "publishedOn": "2021-10-15T20:20:14.000Z",
          "wordCount": 4474,
          "title": "Talk Transcript: Your uniqueness is your strength (and why that matters to the indiegame space)"
        },
        {
          "id": "http://www.nathalielawhead.com/candybox/?p=5131",
          "author": "alienmelon",
          "description": "I am writing this post in support of Wren. Hello, I'm the \"writer\" of the Dangen Warning and the former writer of Fight Knight. I feel it's important for me to come forward about why I left the Fight Knight project. https://t.co/ccrZgh1IeA — Wren (@rivalerose) October 1, 2021 Wren is a wonderful human who endured physical abuse, psychological abuse, gaslighting, manipulation, and pretty much that entire spectrum that we’re way too used to hearing about when survivors share their stories. She endured this while working on the game Fight Knight, putting out what I’m sure was amazing work that we...",
          "link": "http://www.nathalielawhead.com/candybox/in-support-of-wren-the-abuse-she-endured-while-working-on-fight-knight",
          "publishedOn": "2021-10-14T01:03:46.000Z",
          "wordCount": 2955,
          "title": "In support of Wren (the abuse she endured while working on Fight Knight)"
        },
        {
          "id": "http://www.nathalielawhead.com/candybox/?p=5122",
          "author": "alienmelon",
          "description": "During the month of September I ran another Electric Zine Jam (the two point oh edition!) in which people made a bunch of beautiful zines. This jam was to celebrate the new Electric Zine Maker update which introduced a number of templates, and the brand new UI update. I’m also over the moon that PAGE online wrote about it! “Zines und OpenSource passen wunderbar zueinander, findet Nathalie Lawhead und entwickelt seit 2018 den Electric Zine Maker. Nun ist ein großes Update für das Printshop-Tool erschienen.” – by Lena Simonis on PAGE, Zine Design: Micro-Heft gestalten mit dem Electric Zine Maker...",
          "link": "http://www.nathalielawhead.com/candybox/celebrating-all-the-wonderful-zines-from-the-electric-zine-jam-2-0",
          "publishedOn": "2021-10-10T00:35:00.000Z",
          "wordCount": 3097,
          "title": "Celebrating all the wonderful zines from the Electric Zine Jam 2.0"
        },
        {
          "id": "http://www.nathalielawhead.com/candybox/?p=5114",
          "author": "alienmelon",
          "description": "I hoarded a lot of links to tools again, and am putting aside some time to share them here. Here’s another tool post! I just opened a blog category called “tools” in which you can read all my writing about open source, freeware, or small tools from small devs. At this point I feel like I’ve already said everything I can possibly say about the wonderful world of tools, coming out of this space… It’s an inspiring area that never fails to surprise! One thing that I’ve been thinking about lately is the intersection between tools and games. When you...",
          "link": "http://www.nathalielawhead.com/candybox/generative-art-tools-on-the-intersection-of-toys-tools-and-games",
          "publishedOn": "2021-09-25T00:42:15.000Z",
          "wordCount": 3060,
          "title": "Generative art & tools (on the intersection of toys, tools, and games…)"
        }
      ]
    }
  ],
  "cliVersion": "1.11.3"
}